{
  "id": "38262ae8-37e0-49ea-a715-aba6522e8967",
  "transcript_name": "Jesse's UX Interview",
  "project_name": "Daria Research of Researchers",
  "interview_type": "Persona Interview",
  "project_description": "We are researching how user researchers conduct discovery activities and plan for user research, from awareness and identifying research questions to research design, execution, analysis, and delivery.",
  "date": "2025-04-23T10:19:05.529537",
  "transcript": "[Dulaney, Stephen] 13:02:04\nHello, Jesse. I'm fine. How are you?\n\n[Banwart, Jesse] 13:02:05\nHey, Steven. How's it going? I'm doing great.\n\n[Dulaney, Stephen] 13:02:10\nThank you for participating in my research.\n\n[Banwart, Jesse] 13:02:14\nOf course. Happy to be on this end of it.\n\n[Dulaney, Stephen] 13:02:16\nYeah, it's been interesting. I'm going to try to keep my researcher mask on all the way through. And then at the very end.\n\n[Dulaney, Stephen] 13:02:24\nBut it is difficult. It's kind of funny. But so let me start, Jesse, do I have your permission to take a transcript and a recording of the interview today.\n\n[Banwart, Jesse] 13:02:34\nOf course.\n\n[Dulaney, Stephen] 13:02:36\nOkay. Can you tell me a little bit about your current role and how long you've had it?\n\n[Banwart, Jesse] 13:02:43\nYeah, so my current role is experience strategist. I switched over into that in… 2002, so I guess it's going on three years here that I've been there. Before that, I was a UX designer Here at Deloitte.\n\n[Banwart, Jesse] 13:03:03\nAnd all of that, both when I was UX designer and when I was now as experienced strategist, really leaned into research and I would say most people at Deloitte think I'm a researcher.\n\n[Dulaney, Stephen] 13:03:15\nGood, good. So how did you get into the research? You started with the UX. What was your migration into the research and what attracted you to that?\n\n[Banwart, Jesse] 13:03:16\nYeah.\n\n[Banwart, Jesse] 13:03:24\nYeah, I went to a master's program that was like human factors mixed with an MBA. And so learned a lot of research methods, learned a lot about human centered design and research being a big, big piece of that.\n\n[Banwart, Jesse] 13:03:37\nSo that all kind of started, I went to school for it, but I also worked a job before that was focused on getting like kids into architecture careers and putting people in the center of solutions in that context.\n\n[Banwart, Jesse] 13:03:50\nKind of got me into human-centered design that I now apply here digitally.\n\n[Dulaney, Stephen] 13:03:55\nOkay, that sounds good. With respect to your current role as a strategist and researcher, what is your primary goal?\n\n[Banwart, Jesse] 13:04:04\nOoh.\n\n[Banwart, Jesse] 13:04:08\nSurprising people surprising people uh… information that they really that was right in front of their face all the time, but never really made sense to them.\n\n[Dulaney, Stephen] 13:04:21\nOkay. Are there any frustrations that happen when you're trying to do that?\n\n[Banwart, Jesse] 13:04:23\nHelpful.\n\n[Banwart, Jesse] 13:04:27\nUm… Yes. I think there's a very… I think there's a very human desire in a lot of scenarios to like default to what you know and not really allow yourself to think um in the abstract in the abstract to like imagine a world not rooted in what you already know and what constraints you already know.\n\n[Banwart, Jesse] 13:04:54\nThat gets in the way all the time.\n\n[Dulaney, Stephen] 13:04:57\nAre there any key principles that you've adopted along your path?\n\n[Banwart, Jesse] 13:05:02\nOh, these are big questions, Stephen. Key principles.\n\n[Banwart, Jesse] 13:05:11\nI mean, I definitely think integrity is a huge key principle, like making sure that you're just that you believe everything that you're presenting is, I think, a huge huge part of what like makes me okay with the work that we do a lot of the time.\n\n[Banwart, Jesse] 13:05:28\nYeah, I don't know. I've never like formalized my principles\n\n[Dulaney, Stephen] 13:05:31\nOkay, that's okay. So tell me about when you got started, when your user experience and you're going to graduate school, what was the study of research like? What tools did you use? What were your activities and what were your thoughts at that time?\n\n[Banwart, Jesse] 13:05:44\nOh my gosh, it was so scrappy. That's one of the things that I like really… I wish it was like more ethical to be scrappier because we did find some like really great ways. I mean, it was not advanced in terms of tools. We were like.\n\n[Banwart, Jesse] 13:06:02\nPosting Google Forms on Facebook groups. We were… just we were conducting interviews with you know one-off interviews Yeah, there wasn't a lot of like… what kind of was always frustrating about it was like, so we would start a class and they would\n\n[Banwart, Jesse] 13:06:24\nSay, okay, here's this problem that we're solving. It's a problem that none of us had ever been involved with or had anything to do with and they'd be like go find people to talk to about this. And it was like\n\n[Banwart, Jesse] 13:06:34\nWhoa, that's a huge, hard, like daunting thing to do is like, how do I find people in a community I don't belong to?\n\n[Banwart, Jesse] 13:06:43\nIntroduce myself and then get them to tell me like their deepest, darkest secrets, right? It's uh there was a lot of like just very guerrilla, like go out and figure it out like pull people on the streets Like go to community days. I like went to a crocheting class at a library in a neighborhood I'd never been to like\n\n[Banwart, Jesse] 13:07:03\nJust a lot of like weird ways to try to get connections to people that weren't like formalized at all.\n\n[Dulaney, Stephen] 13:07:11\nThat sounds great. Now, how do you think the tools that you used are different in the present? And are you satisfied?\n\n[Banwart, Jesse] 13:07:17\nYeah, I think it's way better because there's much more of a um a quid pro quo there's the like we have access to tools and there are people who are like, yes, what I do is I help people With these usability tests, I help people by interviewing. We, you know.\n\n[Banwart, Jesse] 13:07:35\nSourcing people who are down to be sourced is like Way cool. I meant to that.\n\n[Dulaney, Stephen] 13:07:42\nNow, where do you spend most of your time during the research activities?\n\n[Banwart, Jesse] 13:07:50\nHmm. Typically, it's an approval like it's in putting together a plan and like explaining it to people and getting people on board with it and making edits.\n\n[Banwart, Jesse] 13:07:59\nBecause especially with a lot of the tools that we have, once it's approved and you're ready to go, you can get results in a couple days in a week.\n\n[Banwart, Jesse] 13:08:10\nYou usually have to spend a couple of weeks getting approval, talking to people, making sure the test is right.\n\n[Dulaney, Stephen] 13:08:17\nOkay, that sounds good. Now, what do you think in the future, like three years from now, what do you think your tools and your research environment is going to look like?\n\n[Banwart, Jesse] 13:08:24\nOoh, yeah. That's a great question. I think there will be a lot more, I think, automated synthesis will be a lot better.\n\n[Banwart, Jesse] 13:08:34\nRight now, it's really unreliable and not very good. I think in three years, they'll get a lot better at it.\n\n[Banwart, Jesse] 13:08:40\nI think there will always there will be a better push in the tools that we use towards a centralized insights repository or a sense of… Like insights understanding database thing Because I think ideally what we're moving towards is You run studies, you find things out, but then you could also start posing questions to your research base and get some findings back, which Baymart already kind of does a little bit. They have like an AI integration tool where it's like.\n\n[Banwart, Jesse] 13:09:14\nHey, like maybe we haven't posted an article, but ask us a question and they'll pull up relevant articles to that question or they'll even give an AI generated kind of take on your question.\n\n[Banwart, Jesse] 13:09:25\nI think that will be more specific to like research that we've done in the past, right? And how people will respond to things and Maybe getting into a question that you didn't explicitly ask, but it can still have provide an opinion on.\n\n[Dulaney, Stephen] 13:09:35\nOkay, that's good.\n\n[Dulaney, Stephen] 13:09:42\nSo can you think of a story in your time in recent research, the last two years or so, that you had a project that looked like it was going to be just brain dead and easy, but no matter what happened, it became frustrating and just a struggle.\n\n[Dulaney, Stephen] 13:09:55\nAnd ended up having a kind of a hard ending.\n\n[Banwart, Jesse] 13:09:59\nYeah. I did a… project with Marriott one time where we were trying to understand more about card members.\n\n[Banwart, Jesse] 13:10:10\nAnd it was like, we put in like a lot of work for this. We wanted to interview like 15 people and it was like $5,000 to source them. It was a survey that was just like a screener survey that was just not very complex and then like.\n\n[Banwart, Jesse] 13:10:27\nInterviewing for 15 people like to get that level of detail that we did end up getting. I didn't actually end up conducting the interview someone else did but that was just like a slog. It was like, oh my gosh, all we need to do is talk to 15 people like\n\n[Banwart, Jesse] 13:10:44\nWhy is this taking like a month and a half? And why is it so expensive?\n\n[Dulaney, Stephen] 13:10:50\nOkay, now on the other end, can you think of a project that surprised you and had a happy ending and things just fell into place?\n\n[Dulaney, Stephen] 13:10:55\nCorrectly.\n\n[Banwart, Jesse] 13:10:57\nYeah, my favorite. So we have MUIQ access now. Our main stakeholder here at Spectrum one day on a Friday was like… What's people's experience like with going from a third party affiliate site to our site?\n\n[Banwart, Jesse] 13:11:15\nGave a list of six sites and within two days we had a test live that we were just like, let's see, let's give them an address. Let's send them to this site. Let's record their screen while they go. And we flipped around in one week's time. Really awesome insights about how bad that experience was and ways to improve it that led into more sold work.\n\n[Banwart, Jesse] 13:11:36\nThat ended up being something that is now there's like full screens for that new entry experience from affiliate sites so That was a great one. I love that.\n\n[Dulaney, Stephen] 13:11:46\nOkay, that sounds interesting. So now we're going to go into process a little bit. I want you to think about the discovery process. Like you get a new, like that particular project how long when you get it, how long do you estimate like a project? How do you come up with an estimate in your mind? Is this six weeks? Is it nine weeks? Is it four weeks?\n\n[Dulaney, Stephen] 13:12:02\nHow does that art start?\n\n[Banwart, Jesse] 13:12:04\nYeah, I like in fig jam, they have like built out calendars and I like to time block in a calendar to help understand. So I'll say, you know.\n\n[Banwart, Jesse] 13:12:14\nWe'll need, in general, three, four days for synthesis. We'll want to launch on this day, close on this day. We'll need two weeks to plan the study. So I just kind of time block it out in a calendar on fig jam\n\n[Banwart, Jesse] 13:12:27\nAnd use that as the basis for what we do moving forward. Usually I account for some wiggle room you know, a day or two for each activity.\n\n[Dulaney, Stephen] 13:12:34\nKnow what kind of information at the discovery phase, like in the first two or three days, are you trying to gather And what kind of form does it come in and what do you do with it? Like, how do you manage those assets\n\n[Banwart, Jesse] 13:12:45\nYeah, it really depends on who I'm working with. But I'll give the example for Spectrum. We have a really solid design team. So we'll host a research question ideation session that's an hour long.\n\n[Banwart, Jesse] 13:12:58\nOr we'll look at any designs that have been put together. The current experience will pull all those screenshots into a fig jam.\n\n[Banwart, Jesse] 13:13:05\nAnd we'll walk through them one at a time. We'll call out, hey, do you think this works? Do you have questions about this? Like, does this make sense to do?\n\n[Banwart, Jesse] 13:13:14\nSometimes we have to circle back with product on requirements. Sometimes it leads directly to a new task or something that we want to test So we'll build out the like landscape of what we want to find out first and then pull that into a test plan with research questions and a breakdown of like what we want to do and ask in that process.\n\n[Dulaney, Stephen] 13:13:38\nOkay, so do you do… more than one research plan for a discovery project.\n\n[Banwart, Jesse] 13:13:45\nI mean, we do a research plan for like every study and sometimes there's multiple things in a single study. But we do, yeah, I would say Pretty much we're always starting with the plan.\n\n[Dulaney, Stephen] 13:13:59\nSo when you identify that you need to do, what are some of the types of research studies that you identified in that discovery period.\n\n[Banwart, Jesse] 13:14:08\nI mean, like what types of studies or what do you mean?\n\n[Dulaney, Stephen] 13:14:12\nWell, I guess, okay, so in the discovery session, you brainstorm and you kind of figure out what's the outcome, the kind of the solidified outcome of that session.\n\n[Banwart, Jesse] 13:14:24\nIt's the research questions. It's what they want to know so that we can pick what kind of study we want to do. So if they're like, oh, I actually like, I wonder if people will get hung up here.\n\n[Banwart, Jesse] 13:14:36\nThen maybe it's like a task analysis, right? We give them the prompt. Here's a situation. Here's the prototype.\n\n[Banwart, Jesse] 13:14:42\nCan you do this? Sometimes it's like a question that we ask at the end, which is like, hey.\n\n[Banwart, Jesse] 13:14:48\nThere's this description and there's this description. Which one do you like better? We kind of like use that session to get out what we want to find out and then can use that to design the test.\n\n[Dulaney, Stephen] 13:14:59\nOkay, so when you're starting a test, you start with a research question.\n\n[Banwart, Jesse] 13:15:04\nYeah. Yeah, we're about to right after this call, we're presenting out on… This latest one we did. So some of our research questions here were\n\n[Dulaney, Stephen] 13:15:04\nOkay. And can you give me an example of a research question?\n\n[Banwart, Jesse] 13:15:21\nUm… What specific pain points or obstacles do users encounter while in the flow?\n\n[Banwart, Jesse] 13:15:28\nWhat's the overall impression of visual design and layout of the interfaces?\n\n[Banwart, Jesse] 13:15:34\nDo users understand the terms? If not, what's confusing? Which of these two descriptions has a better description?\n\n[Banwart, Jesse] 13:15:44\nYeah, so every test has like four to 10 research questions that just kind of guide what we ask and why.\n\n[Dulaney, Stephen] 13:15:52\nNow, have you ever started a project without a clear research question and is it better to have one?\n\n[Banwart, Jesse] 13:15:59\nI mean, I definitely start projects without them. I don't know that I've ever, I would say I've ever really started a test without a clear research question or a clear goal out of what we wanted. I think you can kind of interchange the idea of research questions and goals.\n\n[Dulaney, Stephen] 13:16:17\nOkay.\n\n[Banwart, Jesse] 13:16:20\nSo no, I think we always like do a pretty good job of like making sure We need to have a reason for what we're doing, you know?\n\n[Dulaney, Stephen] 13:16:28\nSo once you have your research question, what else needs to be decided that forms a full research, a complete research plan?\n\n[Banwart, Jesse] 13:16:37\nCost. We usually do a cost estimate of how it'll be and get approval and make sure we have funding for that.\n\n[Dulaney, Stephen] 13:16:39\nOkay.\n\n[Dulaney, Stephen] 13:16:46\nWhat is the biggest of those costs? What drives the cost the most?\n\n[Banwart, Jesse] 13:16:52\nTypically, it would be a platform fee in a world where it's not a platform that we already have access to.\n\n[Dulaney, Stephen] 13:16:58\nAnd is that for recruiting or just for what else?\n\n[Banwart, Jesse] 13:17:00\nIt depends on the setup sometimes. So like when we use D scout that was a single fee for The entire platform and then we had to pay recruitment on top of that like pay for them to use the… use their participant pool, pay out the incentives for participants to participate.\n\n[Banwart, Jesse] 13:17:22\nSo that was like… a $10,000 tool fee and then $10,000 of recruiting on it, right?\n\n[Banwart, Jesse] 13:17:31\nFor MUIQ because we have, it's something we already have access to that is not, we don't have to pay that tool fee every time. We just have to pay recruitment.\n\n[Banwart, Jesse] 13:17:42\nAnd so, and a good example, we're about to do something in outset the ai tool that has like almost no fees at all because it's being covered by another part of Deloitte for a year and their recruitment fees are incredibly low compared to sourcing through an MUIQ.\n\n[Dulaney, Stephen] 13:17:53\nYeah.\n\n[Banwart, Jesse] 13:18:01\nYeah, it really depends.\n\n[Dulaney, Stephen] 13:18:02\nSo much of your time after you get this plan together, how much time does it start to actually kick off the They're playing.\n\n[Banwart, Jesse] 13:18:11\nYeah, if we have the plan together and we get approval and there's no feedback and we don't have to present the plan multiple times, we're pretty good to go. We can get right into building the test. I usually… At least a day, usually no more than three days to build out any kind of test.\n\n[Dulaney, Stephen] 13:18:30\nAnd when you're building out a test, kind of explain that to me a little bit. What are you doing and what is your outcome? How do you know when you're done?\n\n[Banwart, Jesse] 13:18:37\nYeah, so we go into the tool, we add in questions, add in options, like filter out for screeners.\n\n[Banwart, Jesse] 13:18:49\nWe make, you know, when questions are conditional, we add in those conditions. A big part of it is playing with the prototypes of those and trying to break it and seeing if everything is working right.\n\n[Banwart, Jesse] 13:19:01\nSending it to other people to have them go through it and see if they can break it.\n\n[Banwart, Jesse] 13:19:07\nYeah, all that takes about a day to three days to actually build out once you have a plan.\n\n[Dulaney, Stephen] 13:19:12\nOkay, and so now we're into the, how many typically participants do you target?\n\n[Banwart, Jesse] 13:19:17\nOoh, that's the real question. Depends on if you want feelings or numbers.\n\n[Banwart, Jesse] 13:19:23\nIf it's numbers and you have a good amount of budget, you typically ask more quantitative questions where they're rating things or that you can look at charts and graphs and information after. Ideally, you're doing at least a couple hundred into a thousand range to get some real solid numbers you can rely on.\n\n[Banwart, Jesse] 13:19:47\nBut I don't actually really work in that space very much. I do mostly qualitative. So for a lot of what we do, we are in the like 15 to 50 participant range.\n\n[Dulaney, Stephen] 13:19:59\nOkay, when you're doing qualitative research, how much is it 45 minutes per person?\n\n[Banwart, Jesse] 13:20:05\nIf it's an interview, yeah, it depends on what we want to know from them. So I would never do 45 minutes with a customer or like a, you know, someone that we're like.\n\n[Banwart, Jesse] 13:20:17\nOh, like what, what, what's your shopping experience right um that would be more like 15 to 30 minutes. But a lot of whenever we get onto a project and there's like stakeholder interviews to do at the beginning.\n\n[Banwart, Jesse] 13:20:30\nThose are usually 45 minutes 45, maybe to an hour.\n\n[Dulaney, Stephen] 13:20:35\nOkay, nowadays, what kind of assets are you generating from an individual interview?\n\n[Banwart, Jesse] 13:20:41\nHmm. Well, we… If we do it through Zoom, we'll already have that transcript and we'll already have the video recording. Make sure we do that.\n\n[Banwart, Jesse] 13:20:54\nSo those will be just stored as like assets that we can access and go back to, we'll always do after we're done with a set of interviews, a synthesis deck of like what we heard, what matters most, what we need to do moving forward.\n\n[Banwart, Jesse] 13:21:10\nSo those decks are usually the main output of that. We usually build those out in Figma nowadays.\n\n[Banwart, Jesse] 13:21:17\nBut have built it out in PowerPoint. Plenty of times as well.\n\n[Dulaney, Stephen] 13:21:19\nSo how much time does it take you? Say you did 15 interviews qualitative. How much time do you spend in the now you got 15 transcripts and 15 hours of video How much time do you spend?\n\n[Dulaney, Stephen] 13:21:31\nGoing through that.\n\n[Banwart, Jesse] 13:21:33\nYeah, we'll do an interview that's like 45 minutes. We'll spend 15 minutes after that interview.\n\n[Banwart, Jesse] 13:21:39\nExternalizing. So we'll be in a board. We'll say, okay, they said this, that, the other. Here's their pain points. Here's what they said. Lay it all out there after each interview.\n\n[Banwart, Jesse] 13:21:49\nSo if we count that time, that's half a day, four, four or five hours doing that.\n\n[Banwart, Jesse] 13:21:57\nThen after we're done with all the interviews, we'll spend at least two days synthesizing those things. So we'll everyone's pain points, affinity map, look at those together, see what people are saying for pain points, get an idea of the volume. We'll do the same for…\n\n[Banwart, Jesse] 13:22:14\nMoments that matter, design ideas, any category that we're looking at. So we spend a couple days just doing that and organizing that, seeing what people really said as a collective group.\n\n[Banwart, Jesse] 13:22:27\nAnd then we'll spend another two, three days building that out into a presentation or a deck\n\n[Dulaney, Stephen] 13:22:33\nOkay, that sounds good. And then what do you generate personas or journey maps? Or what are some of your outputs once you're done\n\n[Banwart, Jesse] 13:22:40\nOoh, I love personas and journey maps. We don't really sell them anymore, which is kind of a bummer.\n\n[Banwart, Jesse] 13:22:45\nAnd I think a lot of it is people don't really have a goal or an intention with them anymore.\n\n[Banwart, Jesse] 13:22:53\nBut mostly we turn out like the synthesis and findings and recommendations that then can be either flipped into like a roadmap or can either be flipped into, you know, some kind of plan for like how we're going to build out and address these recommendations. So I would say roadmaps probably end up being more the final output of our findings.\n\n[Banwart, Jesse] 13:23:17\nMore so than personas and journeys kind of don't really do those anymore.\n\n[Dulaney, Stephen] 13:23:20\nSounds good. Now, are there any pitfalls in your process in the research, anything that are just like gaps or Gotcha.\n\n[Banwart, Jesse] 13:23:28\nUm… I mean, a big pitfall can be like people wanting to do it, but not having the infrastructure to do it. So there's been plenty. It happens a lot less nowadays. I think Ted's really kind of paved the way for us to be a lot better in this.\n\n[Banwart, Jesse] 13:23:45\nWe used to get clients that were like, yeah, we want to do research figure it out and they don't have a budget. They don't have a participant pool. They don't have like literally anything at all figured out for that.\n\n[Banwart, Jesse] 13:23:57\nAnd I've even been told by like development teams like I've been brought onto a project for research and then the dev team is like, oh, like good news. You don't have to do research because we can't figure it out. And it's like, okay, well, that's not good news.\n\n[Banwart, Jesse] 13:24:10\nI don't know what you think is good news, but… So yeah, there's definitely you run into people who don't really understand the value of user feedback or especially designers too can have kind of a little bit of an ego around what they've put together.\n\n[Banwart, Jesse] 13:24:28\nAnd are very quick to, if you present findings or recommendations, very quick to be like, well, there was a problem with your study or there's a problem with the way that we did this at the other. So that's not actually the problem with the design. It's the problem with you.\n\n[Banwart, Jesse] 13:24:46\nSo that doesn't happen all the time, but there's definitely those moments where it's like.\n\n[Banwart, Jesse] 13:24:51\nOkay, but like this happened, so… Maybe we can address it. Maybe not. I don't know.\n\n[Dulaney, Stephen] 13:24:57\nOkay, that's good. I'm going to switch gears a little bit. Who do you work with? Who are your collaborators?\n\n[Banwart, Jesse] 13:25:05\nBy name or by role? Yeah.\n\n[Dulaney, Stephen] 13:25:07\nJust kind of role types of people.\n\n[Banwart, Jesse] 13:25:12\nI work with products Because they typically will set the requirements and research feeds really well into requirements.\n\n[Banwart, Jesse] 13:25:23\nSo if there's a new thing we want to do and they have no idea where to get started, research is great to go in, talk to people, figure out what people need, and then report that back to product.\n\n[Banwart, Jesse] 13:25:33\nWork with UX designers who can we can oftentimes get them feedback on their low fidelity prototypes, find out what people are saying, if structures make sense, if things make sense that way.\n\n[Banwart, Jesse] 13:25:48\nAnd then we also work with UI who can, we can give them feedback on, you know, did people find what they needed?\n\n[Banwart, Jesse] 13:25:55\nThe hierarchy right on the page is the text right? Kind of depends on where we are in the process and who gets the most value out of our research but Those are kind of the three main areas.\n\n[Dulaney, Stephen] 13:26:06\nOkay. Who do you work for?\n\n[Banwart, Jesse] 13:26:12\nHe used to only be IT people. It used to be we would sell to like IT managers. I think a lot more companies have design components or like design leadership in them now, which is great So it's usually a head of design or a…\n\n[Banwart, Jesse] 13:26:32\nAhead of strategy or like… strategy in the terms of like a web experience or like digital product experience That's usually our client stakeholders.\n\n[Dulaney, Stephen] 13:26:46\nOkay, and who benefits most from your work?\n\n[Banwart, Jesse] 13:26:51\nMe. I get paid to do work and that's great. I don't know. I think, well, I mean, end users in theory if the work actually has a good system where we can provide feedback and make changes based on what we find.\n\n[Banwart, Jesse] 13:27:09\nUsers win, for sure. I think our clients and product people win when we can detect things early so that they don't code a problem into their design so they don't have to pay millions of dollars to fix a problem if you find it at the design level.\n\n[Banwart, Jesse] 13:27:30\nYeah.\n\n[Dulaney, Stephen] 13:27:31\nOkay, I want you to kind of write this, who you work with, who you work for and who benefits from your work.\n\n[Dulaney, Stephen] 13:27:36\nWhich one is the most important and which one is next and which one is next?\n\n[Banwart, Jesse] 13:27:42\nWe're talking in the context here of Deloitte, right? Yeah, who you work for is one.\n\n[Dulaney, Stephen] 13:27:46\nYeah.\n\n[Banwart, Jesse] 13:27:50\nWho you work with is too and who you work for or wait Yeah, who benefits is less. Yeah.\n\n[Dulaney, Stephen] 13:27:55\nWho benefits from your work? Okay, so what do you consider the victory event?\n\n[Banwart, Jesse] 13:28:02\nThe victory event, honestly, is when feedback is live published out doing its thing, being better.\n\n[Dulaney, Stephen] 13:28:11\nOkay, now we're going to switch gears a little bit into the experience framework. So what do you think is the value of the work you do and who gains the most value from it\n\n[Banwart, Jesse] 13:28:21\nValue of the work you do is in saving having to like saving hassle and and headache in any kind of experience So things are are better things are better things easier to get through.\n\n[Banwart, Jesse] 13:28:38\nWhat was the second part of your question?\n\n[Dulaney, Stephen] 13:28:41\nJust the value basically who gets the most value out of your work and\n\n[Banwart, Jesse] 13:28:45\nYeah. Well, I think again too, like thinking back to like our client stakeholders as the real value owners they the value that they get is confidence.\n\n[Banwart, Jesse] 13:28:59\nThey get to, you know, they're oftentimes taking a stab at like, oh, I want to do something better. They're vision people. They're seeing these things.\n\n[Banwart, Jesse] 13:29:09\nAnd there's risk in that and we can help them understand the, like, we'll be the first line of helping them understand how that vision is actually going to play out. So I think to them, that's kind of their main value. And I would say oftentimes they're more of our stakeholders and the end users are.\n\n[Dulaney, Stephen] 13:29:28\nOkay, so what is the problem that you're repeatedly solving when you do your work?\n\n[Banwart, Jesse] 13:29:28\nFor sure.\n\n[Banwart, Jesse] 13:29:34\nProblem we're repeatedly solving. Um…\n\n[Banwart, Jesse] 13:29:42\nI guess just like a lack of knowledge is what we're repeating repeatedly selling.\n\n[Banwart, Jesse] 13:29:49\nSolving like a lack of knowing a lack of confidence in what what's we're putting forward.\n\n[Dulaney, Stephen] 13:30:00\nOkay, that's good. Now, as a UX person, do you find yourself to be an educator and an evangelizer and Who are you needing to teach and evangelize to the most\n\n[Banwart, Jesse] 13:30:13\nYeah, I found it less. When I started here five years ago, there was definitely a you needed to evangelize the importance of research, budget for it, figure it out.\n\n[Banwart, Jesse] 13:30:29\nThat kind of like a lot more people on the Deloitte side are bought into that. And I think our clients are more bought into that. So I think it's a little bit less of a role.\n\n[Banwart, Jesse] 13:30:39\nUm… I think the days of people having to do large transformative digital work in a place where they've never done that before are kind of over.\n\n[Banwart, Jesse] 13:30:49\nIf you know what I mean.\n\n[Dulaney, Stephen] 13:30:51\nYeah. So what is the state of the tools that you use and what role do they play in your success or failure?\n\n[Dulaney, Stephen] 13:30:58\nAnd your work.\n\n[Banwart, Jesse] 13:30:59\nI think a lot of them are still early adopters, especially in terms of AI.\n\n[Banwart, Jesse] 13:31:04\nI think the ways they'll improve, I already kind of mentioned, but like getting better at synthesis, getting a little bit better at like Not just saying obvious things and having that be what they present out.\n\n[Banwart, Jesse] 13:31:19\nGetting to a little more like heart and meat of things.\n\n[Banwart, Jesse] 13:31:23\nAnd yeah, we, I mean, we use tools in every every asset even so mu iq like even though there's a lot of built-in stuff with it, a lot of times we're exporting that out to Excel and I'm building out\n\n[Banwart, Jesse] 13:31:37\nFormulas and charts and stuff in there. It's not like there's just everything I use as a tool\n\n[Dulaney, Stephen] 13:31:42\nOkay, that sounds good. Now, what role does the look and the feel of your end product place to the to the clients, how important is that?\n\n[Banwart, Jesse] 13:31:50\nNot really to the clients. It's important to me because I love working with interfaces that are nicer to work with.\n\n[Banwart, Jesse] 13:31:57\nBut not the clients, they're very rarely in the tools, if ever.\n\n[Dulaney, Stephen] 13:32:00\nNow, what about your outputs that you're sharing with the clients?\n\n[Banwart, Jesse] 13:32:04\nYeah, we spend a lot of time making those pretty for clients. It would be a lot better if tools were better about having readily exportable things that you could just pull up and pull up say like ideally it would be so nice if you could just set up in a tool your list of\n\n[Banwart, Jesse] 13:32:23\nWhat you wanted to find out, how you were going to find that out, and then click export and it spit out a presentation that said.\n\n[Banwart, Jesse] 13:32:31\nHere's what we found. Here's everything that you said you were going to do with these questions.\n\n[Banwart, Jesse] 13:32:37\nBut we're kind of a ways away from that, I think.\n\n[Dulaney, Stephen] 13:32:40\nOkay, that sounds good. So if you had a magic wand, what one thing would you change in your user research environment?\n\n[Banwart, Jesse] 13:32:49\nUm…\n\n[Banwart, Jesse] 13:32:54\nI would… make people… I don't know. I would make people pay me more. I would use my magic wand for really negative things. I would not… I guess if it's like benefiting the good of everything, I would… I mean, I would love a like bias\n\n[Dulaney, Stephen] 13:33:02\nOkay.\n\n[Banwart, Jesse] 13:33:14\nWant. I would love to like put something together and then just… Hey, like remove the humanity. Not the humanity, but remove the like So much of what you put together can sometimes be a reflection of your worldview and what you're doing. I would love if it was just like\n\n[Banwart, Jesse] 13:33:35\nEvery single time we put together a usability test, the instructions are unclear to somebody, even though they make the most sense in the world to me.\n\n[Banwart, Jesse] 13:33:43\nA magic wand that's like clarify.\n\n[Dulaney, Stephen] 13:33:46\nThat's interesting. Yeah, that's how I got here. If I talk to one of your um the people you work for. And I asked him, please describe Jesse to me in one word. What one word would you want them to tell me?\n\n[Banwart, Jesse] 13:33:59\nOoh. I would want them to tell you insightful.\n\n[Dulaney, Stephen] 13:34:04\nInsightful. Good. Is there anything during the heat of a project that keeps you up at night?\n\n[Banwart, Jesse] 13:34:13\nUm…\n\n[Banwart, Jesse] 13:34:18\nNot from worry. No, there can be things that keep me up at night. That's like a… Oh, I wish I would have pushed back in this way or like a um Oh, like I really don't think that this was like the best way to do something, but it's not like a…\n\n[Dulaney, Stephen] 13:34:24\nOkay.\n\n[Banwart, Jesse] 13:34:40\nOh, I'm so afraid that this usability test is going to go wrong.\n\n[Dulaney, Stephen] 13:34:45\nOkay. Are there any questions that you expected me to ask that I have failed to ask so far?\n\n[Banwart, Jesse] 13:34:45\nThat's not a…\n\n[Banwart, Jesse] 13:34:53\nNo, I honestly didn't really think much about what questions you were going to ask and you actually you ask incredibly deep questions, which has me feeling very mentally drained right now. I'm like, oh man, I did not prepare enough for this.\n\n[Dulaney, Stephen] 13:35:07\nThere's no preparation. I'll tell you some funny stories later after I get… back to myself. So we're going to switch now to the evaluative phase of this I'm going to share some screens. They're crude and they're break every day.\n\n[Banwart, Jesse] 13:35:15\nOkay, let's hear it.\n\n[Dulaney, Stephen] 13:35:22\nBut they are actually improving so um I wish I could give you control. Do you have, am I sharing right now? Nope, nope, share.\n\n[Banwart, Jesse] 13:35:30\nNot sharing, but you can give me control\n\n[Dulaney, Stephen] 13:35:33\nHow do I do that?\n\n[Banwart, Jesse] 13:35:36\nLet's see.\n\n[Banwart, Jesse] 13:35:42\nIn your… Do you have an option that is like… share control or control.\n\n[Dulaney, Stephen] 13:35:53\nThat's just sound. A remote controller.\n\n[Banwart, Jesse] 13:35:56\nYeah, that's sound. There's one that's Yeah.\n\n[Dulaney, Stephen] 13:36:00\nOkay, so now do you have control of the mouse?\n\n[Dulaney, Stephen] 13:36:07\nWait, do I have to do something else? Give mouse control to Jesse. Yes. Sorry.\n\n[Banwart, Jesse] 13:36:12\nPerfect. Okay. Click start.\n\n[Dulaney, Stephen] 13:36:14\nI've never done this before this new thing. So what are you looking at?\n\n[Banwart, Jesse] 13:36:20\nOkay, I'm looking.\n\n[Banwart, Jesse] 13:36:27\nI'm ready.\n\n[Dulaney, Stephen] 13:36:29\nOkay, what do you see? This is Darius. The goal here is to try to come up if you need if you had a a digital research and interview assistant.\n\n[Dulaney, Stephen] 13:36:39\nWhat you want that assistant to do? What task would it want you to offload? How could it make your streamline your work?\n\n[Banwart, Jesse] 13:36:39\nMm-hmm.\n\n[Dulaney, Stephen] 13:36:45\nSave you time, get you better insights. You know pay you more.\n\n[Banwart, Jesse] 13:36:50\nGotcha. Okay. So I see… Active projects.\n\n[Banwart, Jesse] 13:36:56\nI think that would be a little too, unless this text is like regenerated, I don't know that I would ever author any of those descriptions for that. It would probably just be a title.\n\n[Banwart, Jesse] 13:37:08\nResume where you left off. I would maybe want to like categorize this. I don't know if you have a way to like do by client or by engagement, right? So I would want to click into like a spectrum or a whatever to kind of separate those a little bit.\n\n[Banwart, Jesse] 13:37:23\nIt would be good to see…\n\n[Banwart, Jesse] 13:37:28\nA really clear way for like some kind of like digest information.\n\n[Banwart, Jesse] 13:37:34\nButton right where it's I have documents or I was sent a PDF of something. It'd be great to like upload, add that document. I don't know if that would be in start a new project or in new But it would be like a good example. I was sent a big list of medallia entries for a month, right?\n\n[Banwart, Jesse] 13:37:54\nI don't really want to like read through every single one of those and organize those. It'd be awesome to just like have a, hey, upload this.\n\n[Banwart, Jesse] 13:38:03\nProvide me a quick summary of what's in here.\n\n[Dulaney, Stephen] 13:38:06\nAnd that's a good one. Okay, let's click something and just see what happens.\n\n[Banwart, Jesse] 13:38:08\nBy like a document level.\n\n[Banwart, Jesse] 13:38:14\nOkay, let's start a new project.\n\n[Dulaney, Stephen] 13:38:16\nAnd the design is, this is basically all done in cursor and it's all prompt programming.\n\n[Dulaney, Stephen] 13:38:21\nSo I basically just say, I need a new project page and it does the design. So I haven't actually had like a research person do a design.\n\n[Dulaney, Stephen] 13:38:32\nNow, if I told you that this information that you put in there was going to be used by an AI to generate a project plan.\n\n[Banwart, Jesse] 13:38:32\nYeah, I don't…\n\n[Dulaney, Stephen] 13:38:39\nWould you spend more time filling in the the business reasons and the problem space.\n\n[Banwart, Jesse] 13:38:46\nWell, I don't know that I would trust AI to make a project plan for me. I'm not really entering in what I want to know, right?\n\n[Dulaney, Stephen] 13:38:55\nNow, why wouldn't you trust an AI to make a project plan?\n\n[Banwart, Jesse] 13:38:59\nBecause I'm not entering in what I want to know. All that work that I do that's like, oh, let's lay out the flow. What questions do you have?\n\n[Banwart, Jesse] 13:39:07\nLike, what are we concerned about? I'm not seeing a place to put any of that. So anything it spits out is it'll maybe be a generic one or it'll be like a, hey, you want to test this? Go for it.\n\n[Dulaney, Stephen] 13:39:18\nOkay, so is that different from a project or a research plan?\n\n[Banwart, Jesse] 13:39:23\nOh, I guess I don't, I wasn't differentiating between the two.\n\n[Banwart, Jesse] 13:39:27\nWhat's a project plan?\n\n[Dulaney, Stephen] 13:39:29\nA project plan is like you put in your kickoff deck and you put in like your meeting notes And you click if you're going to do stakeholder interviews or whatever. And then it basically sends you like a pretty quick little Gantt chart of like, here's how you squish things into\n\n[Dulaney, Stephen] 13:39:42\nSix weeks. And here's your milestones and here's your little time boxes.\n\n[Banwart, Jesse] 13:39:47\nThat'll be really helpful for the beginning part of projects where there's a, hey, like how long is this going to take? What would even our plan be?\n\n[Banwart, Jesse] 13:39:57\nSo understanding that that's what I'm doing here, I would do a little bit different approach.\n\n[Dulaney, Stephen] 13:40:02\nOkay.\n\n[Banwart, Jesse] 13:40:06\nI would need to, okay, so I can… The problem for me is like, I wouldn't know what methods to use for sure.\n\n[Banwart, Jesse] 13:40:16\nWithout first knowing what I wanted to find out, right? Yeah, so let's just do like kind of a really generic one. Would they want to do a new, it's a company that wants to do a new… employee tool that's going to save an employee a bunch of time, right?\n\n[Dulaney, Stephen] 13:40:20\nOkay, so you need to know what you want to find out first.\n\n[Banwart, Jesse] 13:40:38\nSo I would say, okay, the company is company one.\n\n[Banwart, Jesse] 13:40:45\nIt is… We're exploring… Creating.\n\n[Banwart, Jesse] 13:40:55\nA new… tool that pulls in APIs from multiple existing tools into one mega tool, right? Because that's all we do.\n\n[Dulaney, Stephen] 13:41:10\nOkay.\n\n[Banwart, Jesse] 13:41:11\nThe problem space, I don't really know how to answer this or what it would do.\n\n[Dulaney, Stephen] 13:41:15\nOkay, we'll leave it blank then.\n\n[Banwart, Jesse] 13:41:18\nOkay. Stakeholders, would I like tag people that are in this system.\n\n[Dulaney, Stephen] 13:41:23\nTheoretically team members, but we'll see. Stakeholders could be too because it could it could help like schedule and send emails. I don't know yet.\n\n[Banwart, Jesse] 13:41:26\nOkay. So I definitely do stakeholder interviews.\n\n[Dulaney, Stephen] 13:41:33\nThis is all like hopes and dreams.\n\n[Banwart, Jesse] 13:41:34\nYep. Totally. I think I would do wireframe evaluation. I don't know that I would do user. I would maybe do a couple user interviews, but I would do probably mostly user survey.\n\n[Dulaney, Stephen] 13:41:45\nOkay.\n\n[Banwart, Jesse] 13:41:46\nI would definitely do an ambition workshop. Not really sure what a contextual inquiry is.\n\n[Dulaney, Stephen] 13:41:51\nObservation. That's Karen's word. I need to change that. It's Eddie, where you go watch people where they were.\n\n[Banwart, Jesse] 13:41:55\nGotcha. Yeah, I think I would do that.\n\n[Banwart, Jesse] 13:42:01\nInitial research plan. Could I use this for like… sidekick and be like, hey, build out a research plan or is that kind of the idea here?\n\n[Dulaney, Stephen] 13:42:09\nYes, yes, yes. I mean, this is essentially, I've got two tracks going. We're doing these sidekick tools I didn't do that other one, but someone did one that does a research plan. And then I'm doing one that generates personas and generates\n\n[Dulaney, Stephen] 13:42:20\nAnd I don't know who's going to win yet because they both kind of send a prompt and send the interviews and they make a persona.\n\n[Dulaney, Stephen] 13:42:27\nBut we're kind of developing these. At the same time. This one allows you to manage way more files and upload more stuff.\n\n[Dulaney, Stephen] 13:42:35\nAnd then potentially if I get this next thing figured out.\n\n[Dulaney, Stephen] 13:42:38\nThe way I do the transcripts right now is just one blob, but I'm going to try to do it where it does by speaker.\n\n[Dulaney, Stephen] 13:42:45\nSo each little, and what happens, it'll have a different entry for when you speak and a different for my question And then you can send those to the vector database and then you can sentiment analysis like individual statements from individual speakers.\n\n[Dulaney, Stephen] 13:42:58\nSo that would be the big win. Okay, so this just kind of post page.\n\n[Dulaney, Stephen] 13:43:04\nAnd then new interview, I need to redo this page. This is actually, click the new interview page. How would you do I need to do like a let me try to phrase this question. If I want to do a study form\n\n[Dulaney, Stephen] 13:43:17\nDo I want to just do one research study form and it accounts for like interviews, surveys Or do I need a different form for a research study, for a survey, for an interview?\n\n[Dulaney, Stephen] 13:43:30\nWhat's your thoughts on how I should approach trying to make it easy for someone to form a research plan and then It's child objects it's is seamlessly as possible.\n\n[Banwart, Jesse] 13:43:42\nYeah, I kind of know if you like a form is the right move here. What would be really cool is to be able to upload a new interview, but upload a transcript.\n\n[Dulaney, Stephen] 13:43:51\nOkay, you can do that. Go to research And then go to upload transcript.\n\n[Banwart, Jesse] 13:43:58\nOkay.\n\n[Dulaney, Stephen] 13:43:59\nSo what kind of information i just kind of generic right now in my asking too much, not enough.\n\n[Banwart, Jesse] 13:44:06\nI think this is fine. Researcher name, role. I think that's fine.\n\n[Banwart, Jesse] 13:44:12\nProject name. I guess I would maybe want to do it more in the context of the company I just created.\n\n[Dulaney, Stephen] 13:44:20\nOkay, good, good. Yeah, it kind of does. Go to, see, where do I have that? Do I have project name. That's the company\n\n[Banwart, Jesse] 13:44:20\nBecause this feels like it's outside of that, right?\n\n[Banwart, Jesse] 13:44:29\nGot it. So this would be like a dropdown that I could… pick from existing projects.\n\n[Dulaney, Stephen] 13:44:37\nYeah.\n\n[Banwart, Jesse] 13:44:38\nYeah. Okay. I get that. Yeah. And then I would upload, I would expect to upload a text file Um.\n\n[Dulaney, Stephen] 13:44:47\nYes.\n\n[Banwart, Jesse] 13:44:50\nYeah, again, I don't know that I would fill out like all this information for each of the interviewers. I suppose I could. I mean, there's really no reason not to.\n\n[Banwart, Jesse] 13:45:00\nIdeally, I mean, I'm already asking these questions in the interview, right? So ideally I would be able to upload something and it already kind of answers like pulls this up and answers a lot of this and I can edit it as opposed to having to put in the fields. You know what I mean?\n\n[Dulaney, Stephen] 13:45:14\nI agree. I agree. I mean, this kind of has evolved like and then get left there because i started this whole study started when You know, I kind of ask the same questions every time. And the funny thing is, I haven'\n\n[Banwart, Jesse] 13:45:18\nYeah.\n\n[Dulaney, Stephen] 13:45:25\nI didn't really start with a research question, if you noticed.\n\n[Dulaney, Stephen] 13:45:30\nBecause I was self-taught and I just came along accidentally. I'm like more of an accidental researcher I do these real touchy-filly research studies.\n\n[Dulaney, Stephen] 13:45:40\nSo I consider like persona journey mapper, or if I'm going to evaluate an application. So the researcher pointed that out to me and that's when I realized I need to speak with real researchers.\n\n[Dulaney, Stephen] 13:45:53\nIt was an eye-opening experience. Okay, so that transcripts.\n\n[Banwart, Jesse] 13:45:56\nYeah, that's really cool to have. Can I go back? Will that take me back to the company? So I think what would be like.\n\n[Banwart, Jesse] 13:46:04\nSo you have this like research insights thing, I think a key findings thing is is cool.\n\n[Banwart, Jesse] 13:46:10\nI would click into that expecting it to be a little bit of synthesis from like everything that I've uploaded here.\n\n[Banwart, Jesse] 13:46:16\nBut I'm open it up to more than just interviews, right? So interviews would be great. Upload a transcript. I think it would be cool to also upload survey data. It would be cool to also upload Like sometimes we get Adobe Analytics reports.\n\n[Dulaney, Stephen] 13:46:17\nOkay.\n\n[Dulaney, Stephen] 13:46:31\nInteresting.\n\n[Banwart, Jesse] 13:46:31\nI'll get like crazy complex. I don't know, just different kinds of documents that could all kind of feed into a key findings thing.\n\n[Dulaney, Stephen] 13:46:44\nOkay. Go to plans under the primary navigation. We'll just kind of look and see.\n\n[Dulaney, Stephen] 13:46:49\nWe did research, we did a new project. Go to research plans because I think that's it's actually archive.\n\n[Dulaney, Stephen] 13:46:55\nOkay, so then this is an archive of individual transcripts that are uploaded. And then it has Zach Matt Search. Like if you search for fly fishing, you'll get five results So the idea is that each of these cards would be either notes, anything you uploaded, and then you could kind of search and sort through\n\n[Banwart, Jesse] 13:47:00\nOh, okay.\n\n[Dulaney, Stephen] 13:47:14\nInduced sentiment. Some of them have frustration, mobile, authentic Does it actually work all the way yet, but that's the um And this is probably page will go away, but this basically is Search and sort type.\n\n[Dulaney, Stephen] 13:47:29\nOf all the assets but all the assets\n\n[Banwart, Jesse] 13:47:30\nWell, you know what I really like about this is so it's cool to have this um accessible. When I've done this manually in the past, I've done like full transcript or like raw notes at the end and I have a consistent like summary page. So what would be cool here if like you had a box that was like\n\n[Banwart, Jesse] 13:47:50\nKey points or like some kind of… Well, not shopping cart to store away, but like an open field that ideally would be auto generated that you could edit, but also like even just in the meantime, like it would be great. What would really help in this. So we run these 45 minute interviews\n\n[Dulaney, Stephen] 13:47:52\nA shopping cart where you can keep your notes. It is.\n\n[Dulaney, Stephen] 13:48:00\nOkay.\n\n[Banwart, Jesse] 13:48:12\nDo our 15 minute of synthesis after. It would be great to just sit here We talk as a group. What's kind of the main points that this person brought up?\n\n[Banwart, Jesse] 13:48:21\nWhat do we need to, and also questions to ask to circle back with them on based on that conversation we always document and usually send a follow-up email with some additional questions.\n\n[Banwart, Jesse] 13:48:32\nThis could be really, really cool to kind of document as a like interview profile. I like this a lot.\n\n[Dulaney, Stephen] 13:48:38\nNow, have you done in that exercise, have you ever like pulled up AI and thrown the transcript in there as part of your debrief?\n\n[Dulaney, Stephen] 13:48:45\nAnd with the team kind of ask joint questions and then type, you know.\n\n[Dulaney, Stephen] 13:48:49\nAnd just use it as a supplement to what you're already doing.\n\n[Banwart, Jesse] 13:48:52\nKind of, no, no, we've never, I've never done that.\n\n[Dulaney, Stephen] 13:48:56\nOkay, let's go to, what do I have under research I have upload transcripts. You talk to that. Let's go to synthesis.\n\n[Dulaney, Stephen] 13:49:04\nPersona. His persona right there.\n\n[Banwart, Jesse] 13:49:05\nCreate persona or\n\n[Banwart, Jesse] 13:49:17\nOkay.\n\n[Dulaney, Stephen] 13:49:18\nOkay, what would you look? Okay, keep going.\n\n[Dulaney, Stephen] 13:49:25\nOkay. I mean, there's hover when you actually hover over the transcript or the analysis or the metadata, it kind of shows you a card.\n\n[Dulaney, Stephen] 13:49:32\nSo you can, but this is like we mentioned, it's going to be like project centric These are the interviews, these are the archives. These are the notes, anything that's part of that Fly Fishing Montana.\n\n[Dulaney, Stephen] 13:49:42\nAnd then you select it and throw it at the open ai And these prompts can be refined and improved, but\n\n[Banwart, Jesse] 13:49:55\nSpending, I think…\n\n[Dulaney, Stephen] 13:49:55\nThinking it's thinking. Nope. Wait, you got to go back. It'll do it.\n\n[Banwart, Jesse] 13:49:59\nOkay.\n\n[Dulaney, Stephen] 13:50:00\nYeah, it just takes a while because it's throwing a lot of stuff. It's um\n\n[Banwart, Jesse] 13:50:05\nYum. You said, okay, so there are cards here that give a preview of the conversation\n\n[Dulaney, Stephen] 13:50:10\nYeah. And initially I did an analysis after every interview because I did the the um it was it was that it was computer was conducting the interview?\n\n[Banwart, Jesse] 13:50:15\nYeah.\n\n[Dulaney, Stephen] 13:50:21\nBut now I think I'm going to separate out the interview from the analysis.\n\n[Dulaney, Stephen] 13:50:25\nAnd just treat the transcript differently for sentiment analysis. Okay, we'll select some of those if they'll see it or not.\n\n[Banwart, Jesse] 13:50:31\nI like this analysis. What I would make sure you can do is, oh, you can, never mind. There was a little bit glitchy for a second, but… being able to mouse over and scroll through and read analysis. I think that's great.\n\n[Dulaney, Stephen] 13:50:39\nThat is glitches risk?\n\n[Dulaney, Stephen] 13:50:48\nI select two of them and then we'll just let it churn and I'll show you something else and why that's churning.\n\n[Dulaney, Stephen] 13:50:54\nOkay, let me take you to this tool here. This is a persona builder and we're going to add two of the Kinza.\n\n[Dulaney, Stephen] 13:51:06\nAnd… I interviewed her yesterday.\n\n[Banwart, Jesse] 13:51:06\nOh, do you know Kinza? Oh, awesome. I'm trying to get a hold of her because I want access to Dovetail.\n\n[Dulaney, Stephen] 13:51:13\nOh, she was good, yeah. I'm specifically staying away from Dovetail for a bit.\n\n[Dulaney, Stephen] 13:51:20\nBecause I don't want to be influenced by dovetail or asset until I'm finished.\n\n[Dulaney, Stephen] 13:51:25\nOkay, so I uploaded two transcripts And then this is what you do in basically GPT. This would be sidekick. These are going to be sidekick skills.\n\n[Dulaney, Stephen] 13:51:39\nOkay, so now I'll let that turn. This is what we got here. What do you think?\n\n[Banwart, Jesse] 13:51:47\nUm…\n\n[Dulaney, Stephen] 13:51:48\nNow, the quality of the interviews is pretty low because that's just me answering stupid questions but um In general?\n\n[Banwart, Jesse] 13:51:55\nSo I'm very much, I'm an annoying person to talk to in this regard because I think that personas that don't have a specific goal identified of how you're going to put them to use are kind of a waste of time, right?\n\n[Dulaney, Stephen] 13:52:10\nOkay, focus and empathy. We can't do things for everybody. So we have to focus and empathy Because we care.\n\n[Banwart, Jesse] 13:52:10\nWhat I…\n\n[Dulaney, Stephen] 13:52:19\nAnd you need to have some vehicle to make sure that you're really thinking about the user and not just get lost in the details of your work.\n\n[Banwart, Jesse] 13:52:28\nOkay, understood. So the goal of these is to provide something for me to some version of a person to empathize with in a process.\n\n[Dulaney, Stephen] 13:52:38\nThe team, the whole team, so that we're not saying I like blue, you like blue. It's like, what is whoever this is Alex like?\n\n[Dulaney, Stephen] 13:52:44\nSo use it as a vehicle, a shared resource, and you all kind of fight about and agree what's in there and what's not, but you don't fight about blue or a dropdown, you think about what Alex needs.\n\n[Banwart, Jesse] 13:52:57\nSo there's information here and I can read it and that's that's fine. I think that's kind of the main goal of what this persona is, is to pull together information that's been pulled from multiple different people and have like a summarized unified person.\n\n[Banwart, Jesse] 13:53:13\nIf that's the goal, that's great. What I think personas need to do is either talk about different identities and how to shift behavior or moments in or qualities around them.\n\n[Banwart, Jesse] 13:53:25\nAnd how we can better utilize that to meet a certain goal, right?\n\n[Banwart, Jesse] 13:53:30\nSo I think there's How can we shift behavior or what are the qualities of this person that we need to approach creatively in order to shift them to behave more like the customer we want them to behave like, right?\n\n[Dulaney, Stephen] 13:53:30\nShift behavior what was the other one?\n\n[Dulaney, Stephen] 13:53:46\nThose are good points. Obviously, you don't do personas what research, what synthesis would you put add to this collection?\n\n[Banwart, Jesse] 13:53:47\nGive them a little bit.\n\n[Banwart, Jesse] 13:53:57\nLike what's missing for me is the goal so like I like that you can see this breakdown and I think there could be an exercise or an activity that's like, oh, what's interesting is like there's these areas of common pain points or there's this kind of like\n\n[Dulaney, Stephen] 13:54:16\nThe goal section.\n\n[Banwart, Jesse] 13:54:17\nThe goals, I think that's, that's interesting to think about What I would maybe want to see added here is some kind of way to like Because another way that I think personas are put to good use is like to remind designers or anyone doing anything that there are multiple different mindsets that are going to be looking at the same thing.\n\n[Dulaney, Stephen] 13:54:40\nThat's interesting because I use it to focus. As opposed to explain that there's a wide variety of people. There could be different people you don't know who it is. That's kind of, I mean, I think we clearly come at this at different angles, which is very useful for me.\n\n[Dulaney, Stephen] 13:54:54\nBecause personas, I grew up with them. I was actually in the room with Hartman when he was interviewed by Businessweek and he came up with this word along with scenario design and they printed it and we thought he was just\n\n[Dulaney, Stephen] 13:55:05\nWe scoffed at him when he did it. And now to see… what happened to that word after that one interview is just remarkable.\n\n[Dulaney, Stephen] 13:55:13\nAnd how he shaped, influenced you know how he influenced And he was just being pompous. He was an industrial designer that did the Macintosh snow white language And that was just Baharman. That's just what he did. He made up words.\n\n[Banwart, Jesse] 13:55:13\nThat's crazy.\n\n[Banwart, Jesse] 13:55:25\nYeah, that's crazy. Well, I thought you were there for the beginning of that.\n\n[Dulaney, Stephen] 13:55:27\nWhat is this? Crazy. But as far as research Because you still conduct research and maybe you still interviews, what output? I mean, can you give me examples of the of the synthesis that you value the most.\n\n[Banwart, Jesse] 13:55:30\nI think…\n\n[Banwart, Jesse] 13:55:47\nUm…\n\n[Dulaney, Stephen] 13:55:49\nI guess I want to see your deliverables at some point.\n\n[Banwart, Jesse] 13:55:51\nYeah, happy to share deliverables.\n\n[Dulaney, Stephen] 13:55:54\nThe what we can do to assist in shaping a prompt that helps you do that faster.\n\n[Banwart, Jesse] 13:56:00\nYeah. And what I was about to say, like what would be interesting here is to have some kind of way to… assess how this persona would respond to something, right?\n\n[Dulaney, Stephen] 13:56:12\nSo let's switch gears. I'm going to let you do this here. And I want you to, this is the same persona. There's an image.\n\n[Banwart, Jesse] 13:56:13\nSo.\n\n[Dulaney, Stephen] 13:56:20\nWell, it's different. Got a JSON folder.\n\n[Dulaney, Stephen] 13:56:26\nWhat question? Would you ask?\n\n[Dulaney, Stephen] 13:56:30\nWould you want to explore? This is a user researcher. This is basically Kenza and Suzette.\n\n[Dulaney, Stephen] 13:56:36\nWhat type of question would you want to ask them? From the research just from the research\n\n[Banwart, Jesse] 13:56:42\nOkay, so would a checkout flow with 15 steps be 15 steps.\n\n[Banwart, Jesse] 13:56:56\nThat took six minutes. Be too much of a… burden for this persona And how likely would they… likely would they be to get all the way through it?\n\n[Dulaney, Stephen] 13:57:21\nOkay, that's interesting. Now, the interview was the same interview I gave you.\n\n[Dulaney, Stephen] 13:57:26\nWe didn't talk about steps, but I'm going to see what it does.\n\n[Banwart, Jesse] 13:57:31\nBe perceived as burdison. The steps are clearly, yeah, this is great.\n\n[Banwart, Jesse] 13:57:37\nThese are the kinds of things that I would want to ask or like be able to ask in terms of like um across all personas. So I think personas should exist as a set. So I would be like, hey, we're putting together a checkout flow that is the step six minutes.\n\n[Banwart, Jesse] 13:57:55\nWhat would their response be to this flow? Or what would likely be their response?\n\n[Banwart, Jesse] 13:58:01\nCall out some of the things that maybe we wouldn't think of based on what this is knowing of the personas. This is awesome. I like this.\n\n[Dulaney, Stephen] 13:58:08\nAnd essentially you can do this on Sidekick where you load up your transcripts and you ask questions. But that's the idea that we're trying to do over here in Daria is… But I want to try to, I think I can do a little better because I think if I break the transcripts into individual\n\n[Dulaney, Stephen] 13:58:23\nQuestion answer, then it'll surface like what your answer is and then give it a sentiment.\n\n[Dulaney, Stephen] 13:58:27\nAnd I can't do that right now. I'm close. Okay, well, thank you for your participation. As a thank you for your help in this. You'll have early access to this to ever get off my laptop and onto a website.\n\n[Banwart, Jesse] 13:58:30\nYep. Understood. I do have to drop.\n\n[Dulaney, Stephen] 13:58:44\nThanks so much, Jesse. And I learned a lot. And the funny thing is I probably need to have a research question before I start a study, but mine's all touchy feely. I just start asking questions and then learn what I learned.\n\n[Banwart, Jesse] 13:58:56\nYeah. Yeah. I like that approach too. There's all sorts Thanks so much, Stephen. I appreciate it. We'll talk to you soon.\n\n[Dulaney, Stephen] 13:59:00\nThere he is. Really getting to see the expertise of our team and it's been fascinating. There are certain areas that I really enjoyed learning and I would take with me.\n\n[Banwart, Jesse] 13:59:09\nAwesome. Well, same here. It's awesome to see how much work you've put into this and how it's coming together.\n\n[Dulaney, Stephen] 13:59:10\nGo ahead. Okay, thank you.\n\n[Dulaney, Stephen] 13:59:15\nThanks so much. Bye\n\n",
  "chunks": [
    {
      "text": " [Dulaney, Stephen] 13:02:04 Hello, Jesse. I'm fine. How are you?  [Banwart, Jesse] 13:02:05 Hey, Steven. How's it going? I'm doing great.  [Dulaney, Stephen] 13:02:10 Thank you for participating in my research.  [Banwart, Jesse] 13:02:14 Of course. Happy to be on this end of it.  [Dulaney, Stephen] 13:02:16 Yeah, it's been interesting. I'm going to try to keep my researcher mask on all the way through. And then at the very end.  [Dulaney, Stephen] 13:02:24 But it is difficult. It's kind of funny. But so let me start, Jesse, do I have your permission to take a transcript and a recording of the interview today.  [Banwart, Jesse] 13:02:34 Of course.  [Dulaney, Stephen] 13:02:36 Okay. Can you tell me a little bit about your current role and how long you've had it?  [Banwart, Jesse] 13:02:43 Yeah, so my current role is experience strategist. I switched over into that in… 2002, so I guess it's going on three years here that I've been there. Before that, I was a UX designer Here at Deloitte.  [Banwart, Jesse] 13:03:03 And all of that, both when I was UX designer and when I was now as experienced strategist, really leaned into research and I would say most people at Deloitte think I'm a researcher.  [Dulaney, Stephen] 13:03:15 Good, good. So how did you get into the research? You started with the UX. What was your migration into the research and what attracted you to that?  [Banwart, Jesse] 13:03:16 Yeah.  [Banwart, Jesse] 13:03:24 Yeah, I went to a master's program that was like human factors mixed with an MBA. And so learned a lot of research methods, learned a lot about human centered design and research being a big, big piece of that.  [Banwart, Jesse] 13:03:37 So that all kind of started, I went to school for it, but I also worked a job before that was focused on getting like kids into architecture careers and putting people in the center of solutions in that context.  [Banwart, Jesse] 13:03:50 Kind of got me into human-centered design that I now apply here digitally.  [Dulaney, Stephen] 13:03:55 Okay, that sounds good. With respect to your current role as a strategist and researcher, what is your primary goal?  [Banwart, Jesse] 13:04:04 Ooh.  [Banwart, Jesse] 13:04:08 Surprising people surprising people uh… information that they really that was right in front of their face all the time, but never really made sense to them.  [Dulaney, Stephen] 13:04:21 Okay. Are there any frustrations that happen when you're trying to do that?  [Banwart, Jesse] 13:04:23 Helpful.  [Banwart, Jesse] 13:04:27 Um… Yes. I think there's a very… I think there's a very human desire in a lot of scenarios to like default to what you know and not really allow yourself to think um in the abstract in the abstract to like imagine a world not rooted in what you already know and what constraints you already know.  [Banwart, Jesse] 13:04:54 That gets in the way all the time.  [Dulaney, Stephen] 13:04:57 Are there any key principles that you've adopted along your path?  [Banwart, Jesse] 13:05:02 Oh, these are big questions, Stephen. Key principles.  [Banwart, Jesse] 13:05:11 I mean, I definitely think integrity is a huge key principle, like making sure that you're just that you believe everything that you're presenting is, I think, a huge huge part of what like makes me okay with the work that we do a lot of the time.  [Banwart, Jesse] 13:05:28 Yeah, I don't know. I've never like formalized my principles  [Dulaney, Stephen] 13:05:31 Okay, that's okay. So tell me about when you got started, when your user experience and you're going to graduate school, what was the study of research like? What tools did you use? What were your activities and what were your thoughts at that time?  [Banwart, Jesse] 13:05:44 Oh my gosh, it was so scrappy. That's one of the things that I like really… I wish it was like more ethical to be scrappier because we did find some like really great ways. I mean, it was not advanced in terms of tools. We were like.  [Banwart, Jesse] 13:06:02 Posting Google Forms on Facebook groups. We were… just we were conducting interviews with you know one-off interviews Yeah, there wasn't a lot of like… what kind of was always frustrating about it was like, so we would start a class and they would  [Banwart, Jesse] 13:06:24 Say, okay, here's this problem that we're solving. It's a problem that none of us had ever been involved with or had anything to do with and they'd be like go find people to talk to about this. And it was like  [Banwart, Jesse] 13:06:34 Whoa, that's a huge, hard, like daunting thing to do is like, how do I find people in a community I don't belong to?  [Banwart, Jesse] 13:06:43 Introduce myself and then get them to tell me like their deepest, darkest secrets, right? It's uh there was a lot of like just very guerrilla, like go out and figure it out like pull people on the streets Like go to community days. I like went to a crocheting class at a library in a neighborhood I'd never been to like  [Banwart, Jesse] 13:07:03 Just a lot of like weird ways to try to get connections to people that weren't like formalized at all.  [Dulaney, Stephen] 13:07:11 That sounds great. Now, how do you think the tools that you used are different in the present? And are you satisfied?  [Banwart, Jesse] 13:07:17 Yeah, I think it's way better because there's much more of a um a quid pro quo there's the like we have access to tools and there are people who are like, yes, what I do is I help people With these usability tests, I help people by interviewing. We, you know.  [Banwart, Jesse] 13:07:35 Sourcing people who are down to be sourced is like Way cool. I meant to that.  [Dulaney, Stephen] 13:07:42 Now, where do you spend most of your time during the research activities?  [Banwart, Jesse] 13:07:50 Hmm. Typically, it's an approval like it's in putting together a plan and like explaining it to people and getting people on board with it and making edits.  [Banwart, Jesse] 13:07:59 Because especially with a lot of the tools that we have, once it's approved and you're ready to go, you can get results in a couple days in a week.  [Banwart, Jesse] 13:08:10 You usually have to spend a couple of weeks getting approval, talking to people, making sure the test is right.  [Dulaney, Stephen] 13:08:17 Okay, that sounds good. Now, what do you think in the future, like three years from now, what do you think your tools and your research environment is going to look like?  [Banwart, Jesse] 13:08:24 Ooh, yeah. That's a great question. I think there will be a lot more, I think, automated synthesis will be a lot better.  [Banwart, Jesse] 13:08:34 Right now, it's really unreliable and not very good. I think in three years, they'll get a lot better at it.  [Banwart, Jesse] 13:08:40 I think there will always there will be a better push in the tools that we use towards a centralized insights repository or a sense of… Like insights understanding database thing Because I think ideally what we're moving towards is You run studies, you find things out, but then you could also start posing questions to your research base and get some findings back, which Baymart already kind of does a little bit. They have like an AI integration tool where it's like.  [Banwart, Jesse] 13:09:14 Hey, like maybe we haven't posted an article, but ask us a question and they'll pull up relevant articles to that question or they'll even give an AI generated kind of take on your question.  [Banwart, Jesse] 13:09:25 I think that will be more specific to like research that we've done in the past, right? And how people will respond to things and Maybe getting into a question that you didn't explicitly ask, but it can still have provide an opinion on.  [Dulaney, Stephen] 13:09:35 Okay, that's good.  [Dulaney, Stephen] 13:09:42 So can you think of a story in your time in recent research, the last two years or so, that you had a project that looked like it was going to be just brain dead and easy, but no matter what happened, it became frustrating and just a struggle.  [Dulaney, Stephen] 13:09:55 And ended up having a kind of a hard ending.  [Banwart, Jesse] 13:09:59 Yeah. I did a… project with Marriott one time where we were trying to understand more about card members.  [Banwart, Jesse] 13:10:10 And it was like, we put in like a lot of work for this. We wanted to interview like 15 people and it was like $5,000 to source them. It was a survey that was just like a screener survey that was just not very complex and then like.  [Banwart, Jesse] 13:10:27 Interviewing for 15 people like to get that level of detail that we did end up getting. I didn't actually end up conducting the interview someone else did but that was just like a slog. It was like, oh my gosh, all we need to do is talk to 15 people like  [Banwart, Jesse] 13:10:44 Why is this taking like a month and a half? And why is it so expensive?  [Dulaney, Stephen] 13:10:50 Okay, now on the other end, can you think of a project that surprised you and had a happy ending and things just fell into place?  [Dulaney, Stephen] 13:10:55 Correctly.  [Banwart, Jesse] 13:10:57 Yeah, my favorite. So we have MUIQ access now. Our main stakeholder here at Spectrum one day on a Friday was like… What's people's experience like with going from a third party affiliate site to our site?  [Banwart, Jesse] 13:11:15 Gave a list of six sites and within two days we had a test live that we were just like, let's see, let's give them an address. Let's send them to this site. Let's record their screen while they go. And we flipped around in one week's time. Really awesome insights about how bad that experience was and ways to improve it that led into more sold work.  [Banwart, Jesse] 13:11:36 That ended up being something that is now there's like full screens for that new entry experience from affiliate sites so That was a great one. I love that.  [Dulaney, Stephen] 13:11:46 Okay, that sounds interesting. So now we're going to go into process a little bit. I want you to think about the discovery process. Like you get a new, like that particular project how long when you get it, how long do you estimate like a project? How do you come up with an estimate in your mind? Is this six weeks? Is it nine weeks? Is it four weeks?  [Dulaney, Stephen] 13:12:02 How does that art start?  [Banwart, Jesse] 13:12:04 Yeah, I like in fig jam, they have like built out calendars and I like to time block in a calendar to help understand. So I'll say, you know.  [Banwart, Jesse] 13:12:14 We'll need, in general, three, four days for synthesis. We'll want to launch on this day, close on this day. We'll need two weeks to plan the study. So I just kind of time block it out in a calendar on fig jam  [Banwart, Jesse] 13:12:27 And use that as the basis for what we do moving forward. Usually I account for some wiggle room you know, a day or two for each activity.  [Dulaney, Stephen] 13:12:34 Know what kind of information at the discovery phase, like in the first two or three days, are you trying to gather And what kind of form does it come in and what do you do with it? Like, how do you manage those assets  [Banwart, Jesse] 13:12:45 Yeah, it really depends on who I'm working with. But I'll give the example for Spectrum. We have a really solid design team. So we'll host a research question ideation session that's an hour long.  [Banwart, Jesse] 13:12:58 Or we'll look at any designs that have been put together. The current experience will pull all those screenshots into a fig jam.  [Banwart, Jesse] 13:13:05 And we'll walk through them one at a time. We'll call out, hey, do you think this works? Do you have questions about this? Like, does this make sense to do?  [Banwart, Jesse] 13:13:14 Sometimes we have to circle back with product on requirements. Sometimes it leads directly to a new task or something that we want to test So we'll build out the like landscape of what we want to find out first and then pull that into a test plan with research questions and a breakdown of like what we want to do and ask in that process.  [Dulaney, Stephen] 13:13:38 Okay, so do you do… more than one research plan for a discovery project.  [Banwart, Jesse] 13:13:45 I mean, we do a research plan for like every study and sometimes there's multiple things in a single study. But we do, yeah, I would say Pretty much we're always starting with the plan.  [Dulaney, Stephen] 13:13:59 So when you identify that you need to do, what are some of the types of research studies that you identified in that discovery period.  [Banwart, Jesse] 13:14:08 I mean, like what types of studies or what do you mean?  [Dulaney, Stephen] 13:14:12 Well, I guess, okay, so in the discovery session, you brainstorm and you kind of figure out what's the outcome, the kind of the solidified outcome of that session.  [Banwart, Jesse] 13:14:24 It's the research questions. It's what they want to know so that we can pick what kind of study we want to do. So if they're like, oh, I actually like, I wonder if people will get hung up here.  [Banwart, Jesse] 13:14:36 Then maybe it's like a task analysis, right? We give them the prompt. Here's a situation. Here's the prototype.  [Banwart, Jesse] 13:14:42 Can you do this? Sometimes it's like a question that we ask at the end, which is like, hey.  [Banwart, Jesse] 13:14:48 There's this description and there's this description. Which one do you like better? We kind of like use that session to get out what we want to find out and then can use that to design the test.  [Dulaney, Stephen] 13:14:59 Okay, so when you're starting a test, you start with a research question.  [Banwart, Jesse] 13:15:04 Yeah. Yeah, we're about to right after this call, we're presenting out on… This latest one we did. So some of our research questions here were  [Dulaney, Stephen] 13:15:04 Okay. And can you give me an example of a research question?  [Banwart, Jesse] 13:15:21 Um… What specific pain points or obstacles do users encounter while in the flow?  [Banwart, Jesse] 13:15:28 What's the overall impression of visual design and layout of the interfaces?  [Banwart, Jesse] 13:15:34 Do users understand the terms? If not, what's confusing? Which of these two descriptions has a better description?  [Banwart, Jesse] 13:15:44 Yeah, so every test has like four to 10 research questions that just kind of guide what we ask and why.  [Dulaney, Stephen] 13:15:52 Now, have you ever started a project without a clear research question and is it better to have one?  [Banwart, Jesse] 13:15:59 I mean, I definitely start projects without them. I don't know that I've ever, I would say I've ever really started a test without a clear research question or a clear goal out of what we wanted. I think you can kind of interchange the idea of research questions and goals.  [Dulaney, Stephen] 13:16:17 Okay.  [Banwart, Jesse] 13:16:20 So no, I think we always like do a pretty good job of like making sure We need to have a reason for what we're doing, you know?  [Dulaney, Stephen] 13:16:28 So once you have your research question, what else needs to be decided that forms a full research, a complete research plan?  [Banwart, Jesse] 13:16:37 Cost. We usually do a cost estimate of how it'll be and get approval and make sure we have funding for that.  [Dulaney, Stephen] 13:16:39 Okay.  [Dulaney, Stephen] 13:16:46 What is the biggest of those costs? What drives the cost the most?  [Banwart, Jesse] 13:16:52 Typically, it would be a platform fee in a world where it's not a platform that we already have access to.  [Dulaney, Stephen] 13:16:58 And is that for recruiting or just for what else?  [Banwart, Jesse] 13:17:00 It depends on the setup sometimes. So like when we use D scout that was a single fee for The entire platform and then we had to pay recruitment on top of that like pay for them to use the… use their participant pool, pay out the incentives for participants to participate.  [Banwart, Jesse] 13:17:22 So that was like… a $10,000 tool fee and then $10,000 of recruiting on it, right?  [Banwart, Jesse] 13:17:31 For MUIQ because we have, it's something we already have access to that is not, we don't have to pay that tool fee every time. We just have to pay recruitment.  [Banwart, Jesse] 13:17:42 And so, and a good example, we're about to do something in outset the ai tool that has like almost no fees at all because it's being covered by another part of Deloitte for a year and their recruitment fees are incredibly low compared to sourcing through an MUIQ.  [Dulaney, Stephen] 13:17:53 Yeah.  [Banwart, Jesse] 13:18:01 Yeah, it really depends.  [Dulaney, Stephen] 13:18:02 So much of your time after you get this plan together, how much time does it start to actually kick off the They're playing.  [Banwart, Jesse] 13:18:11 Yeah, if we have the plan together and we get approval and there's no feedback and we don't have to present the plan multiple times, we're pretty good to go. We can get right into building the test. I usually… At least a day, usually no more than three days to build out any kind of test.  [Dulaney, Stephen] 13:18:30 And when you're building out a test, kind of explain that to me a little bit. What are you doing and what is your outcome? How do you know when you're done?  [Banwart, Jesse] 13:18:37 Yeah, so we go into the tool, we add in questions, add in options, like filter out for screeners.  [Banwart, Jesse] 13:18:49 We make, you know, when questions are conditional, we add in those conditions. A big part of it is playing with the prototypes of those and trying to break it and seeing if everything is working right.  [Banwart, Jesse] 13:19:01 Sending it to other people to have them go through it and see if they can break it.  [Banwart, Jesse] 13:19:07 Yeah, all that takes about a day to three days to actually build out once you have a plan.  [Dulaney, Stephen] 13:19:12 Okay, and so now we're into the, how many typically participants do you target?  [Banwart, Jesse] 13:19:17 Ooh, that's the real question. Depends on if you want feelings or numbers.  [Banwart, Jesse] 13:19:23 If it's numbers and you have a good amount of budget, you typically ask more quantitative questions where they're rating things or that you can look at charts and graphs and information after. Ideally, you're doing at least a couple hundred into a thousand range to get some real solid numbers you can rely on.  [Banwart, Jesse] 13:19:47 But I don't actually really work in that space very much. I do mostly qualitative. So for a lot of what we do, we are in the like 15 to 50 participant range.  [Dulaney, Stephen] 13:19:59 Okay, when you're doing qualitative research, how much is it 45 minutes per person?  [Banwart, Jesse] 13:20:05 If it's an interview, yeah, it depends on what we want to know from them. So I would never do 45 minutes with a customer or like a, you know, someone that we're like.  [Banwart, Jesse] 13:20:17 Oh, like what, what, what's your shopping experience right um that would be more like 15 to 30 minutes. But a lot of whenever we get onto a project and there's like stakeholder interviews to do at the beginning.  [Banwart, Jesse] 13:20:30 Those are usually 45 minutes 45, maybe to an hour.  [Dulaney, Stephen] 13:20:35 Okay, nowadays, what kind of assets are you generating from an individual interview?  [Banwart, Jesse] 13:20:41 Hmm. Well, we… If we do it through Zoom, we'll already have that transcript and we'll already have the video recording. Make sure we do that.  [Banwart, Jesse] 13:20:54 So those will be just stored as like assets that we can access and go back to, we'll always do after we're done with a set of interviews, a synthesis deck of like what we heard, what matters most, what we need to do moving forward.  [Banwart, Jesse] 13:21:10 So those decks are usually the main output of that. We usually build those out in Figma nowadays.  [Banwart, Jesse] 13:21:17 But have built it out in PowerPoint. Plenty of times as well.  [Dulaney, Stephen] 13:21:19 So how much time does it take you? Say you did 15 interviews qualitative. How much time do you spend in the now you got 15 transcripts and 15 hours of video How much time do you spend?  [Dulaney, Stephen] 13:21:31 Going through that.  [Banwart, Jesse] 13:21:33 Yeah, we'll do an interview that's like 45 minutes. We'll spend 15 minutes after that interview.  [Banwart, Jesse] 13:21:39 Externalizing. So we'll be in a board. We'll say, okay, they said this, that, the other. Here's their pain points. Here's what they said. Lay it all out there after each interview.  [Banwart, Jesse] 13:21:49 So if we count that time, that's half a day, four, four or five hours doing that.  [Banwart, Jesse] 13:21:57 Then after we're done with all the interviews, we'll spend at least two days synthesizing those things. So we'll everyone's pain points, affinity map, look at those together, see what people are saying for pain points, get an idea of the volume. We'll do the same for…  [Banwart, Jesse] 13:22:14 Moments that matter, design ideas, any category that we're looking at. So we spend a couple days just doing that and organizing that, seeing what people really said as a collective group.  [Banwart, Jesse] 13:22:27 And then we'll spend another two, three days building that out into a presentation or a deck  [Dulaney, Stephen] 13:22:33 Okay, that sounds good. And then what do you generate personas or journey maps? Or what are some of your outputs once you're done  [Banwart, Jesse] 13:22:40 Ooh, I love personas and journey maps. We don't really sell them anymore, which is kind of a bummer.  [Banwart, Jesse] 13:22:45 And I think a lot of it is people don't really have a goal or an intention with them anymore.  [Banwart, Jesse] 13:22:53 But mostly we turn out like the synthesis and findings and recommendations that then can be either flipped into like a roadmap or can either be flipped into, you know, some kind of plan for like how we're going to build out and address these recommendations. So I would say roadmaps probably end up being more the final output of our findings.  [Banwart, Jesse] 13:23:17 More so than personas and journeys kind of don't really do those anymore.  [Dulaney, Stephen] 13:23:20 Sounds good. Now, are there any pitfalls in your process in the research, anything that are just like gaps or Gotcha.  [Banwart, Jesse] 13:23:28 Um… I mean, a big pitfall can be like people wanting to do it, but not having the infrastructure to do it. So there's been plenty. It happens a lot less nowadays. I think Ted's really kind of paved the way for us to be a lot better in this.  [Banwart, Jesse] 13:23:45 We used to get clients that were like, yeah, we want to do research figure it out and they don't have a budget. They don't have a participant pool. They don't have like literally anything at all figured out for that.  [Banwart, Jesse] 13:23:57 And I've even been told by like development teams like I've been brought onto a project for research and then the dev team is like, oh, like good news. You don't have to do research because we can't figure it out. And it's like, okay, well, that's not good news.  [Banwart, Jesse] 13:24:10 I don't know what you think is good news, but… So yeah, there's definitely you run into people who don't really understand the value of user feedback or especially designers too can have kind of a little bit of an ego around what they've put together.  [Banwart, Jesse] 13:24:28 And are very quick to, if you present findings or recommendations, very quick to be like, well, there was a problem with your study or there's a problem with the way that we did this at the other. So that's not actually the problem with the design. It's the problem with you.  [Banwart, Jesse] 13:24:46 So that doesn't happen all the time, but there's definitely those moments where it's like.  [Banwart, Jesse] 13:24:51 Okay, but like this happened, so… Maybe we can address it. Maybe not. I don't know.  [Dulaney, Stephen] 13:24:57 Okay, that's good. I'm going to switch gears a little bit. Who do you work with? Who are your collaborators?  [Banwart, Jesse] 13:25:05 By name or by role? Yeah.  [Dulaney, Stephen] 13:25:07 Just kind of role types of people.  [Banwart, Jesse] 13:25:12 I work with products Because they typically will set the requirements and research feeds really well into requirements.  [Banwart, Jesse] 13:25:23 So if there's a new thing we want to do and they have no idea where to get started, research is great to go in, talk to people, figure out what people need, and then report that back to product.  [Banwart, Jesse] 13:25:33 Work with UX designers who can we can oftentimes get them feedback on their low fidelity prototypes, find out what people are saying, if structures make sense, if things make sense that way.  [Banwart, Jesse] 13:25:48 And then we also work with UI who can, we can give them feedback on, you know, did people find what they needed?  [Banwart, Jesse] 13:25:55 The hierarchy right on the page is the text right? Kind of depends on where we are in the process and who gets the most value out of our research but Those are kind of the three main areas.  [Dulaney, Stephen] 13:26:06 Okay. Who do you work for?  [Banwart, Jesse] 13:26:12 He used to only be IT people. It used to be we would sell to like IT managers. I think a lot more companies have design components or like design leadership in them now, which is great So it's usually a head of design or a…  [Banwart, Jesse] 13:26:32 Ahead of strategy or like… strategy in the terms of like a web experience or like digital product experience That's usually our client stakeholders.  [Dulaney, Stephen] 13:26:46 Okay, and who benefits most from your work?  [Banwart, Jesse] 13:26:51 Me. I get paid to do work and that's great. I don't know. I think, well, I mean, end users in theory if the work actually has a good system where we can provide feedback and make changes based on what we find.  [Banwart, Jesse] 13:27:09 Users win, for sure. I think our clients and product people win when we can detect things early so that they don't code a problem into their design so they don't have to pay millions of dollars to fix a problem if you find it at the design level.  [Banwart, Jesse] 13:27:30 Yeah.  [Dulaney, Stephen] 13:27:31 Okay, I want you to kind of write this, who you work with, who you work for and who benefits from your work.  [Dulaney, Stephen] 13:27:36 Which one is the most important and which one is next and which one is next?  [Banwart, Jesse] 13:27:42 We're talking in the context here of Deloitte, right? Yeah, who you work for is one.  [Dulaney, Stephen] 13:27:46 Yeah.  [Banwart, Jesse] 13:27:50 Who you work with is too and who you work for or wait Yeah, who benefits is less. Yeah.  [Dulaney, Stephen] 13:27:55 Who benefits from your work? Okay, so what do you consider the victory event?  [Banwart, Jesse] 13:28:02 The victory event, honestly, is when feedback is live published out doing its thing, being better.  [Dulaney, Stephen] 13:28:11 Okay, now we're going to switch gears a little bit into the experience framework. So what do you think is the value of the work you do and who gains the most value from it  [Banwart, Jesse] 13:28:21 Value of the work you do is in saving having to like saving hassle and and headache in any kind of experience So things are are better things are better things easier to get through.  [Banwart, Jesse] 13:28:38 What was the second part of your question?  [Dulaney, Stephen] 13:28:41 Just the value basically who gets the most value out of your work and  [Banwart, Jesse] 13:28:45 Yeah. Well, I think again too, like thinking back to like our client stakeholders as the real value owners they the value that they get is confidence.  [Banwart, Jesse] 13:28:59 They get to, you know, they're oftentimes taking a stab at like, oh, I want to do something better. They're vision people. They're seeing these things.  [Banwart, Jesse] 13:29:09 And there's risk in that and we can help them understand the, like, we'll be the first line of helping them understand how that vision is actually going to play out. So I think to them, that's kind of their main value. And I would say oftentimes they're more of our stakeholders and the end users are.  [Dulaney, Stephen] 13:29:28 Okay, so what is the problem that you're repeatedly solving when you do your work?  [Banwart, Jesse] 13:29:28 For sure.  [Banwart, Jesse] 13:29:34 Problem we're repeatedly solving. Um…  [Banwart, Jesse] 13:29:42 I guess just like a lack of knowledge is what we're repeating repeatedly selling.  [Banwart, Jesse] 13:29:49 Solving like a lack of knowing a lack of confidence in what what's we're putting forward.  [Dulaney, Stephen] 13:30:00 Okay, that's good. Now, as a UX person, do you find yourself to be an educator and an evangelizer and Who are you needing to teach and evangelize to the most  [Banwart, Jesse] 13:30:13 Yeah, I found it less. When I started here five years ago, there was definitely a you needed to evangelize the importance of research, budget for it, figure it out.  [Banwart, Jesse] 13:30:29 That kind of like a lot more people on the Deloitte side are bought into that. And I think our clients are more bought into that. So I think it's a little bit less of a role.  [Banwart, Jesse] 13:30:39 Um… I think the days of people having to do large transformative digital work in a place where they've never done that before are kind of over.  [Banwart, Jesse] 13:30:49 If you know what I mean.  [Dulaney, Stephen] 13:30:51 Yeah. So what is the state of the tools that you use and what role do they play in your success or failure?  [Dulaney, Stephen] 13:30:58 And your work.  [Banwart, Jesse] 13:30:59 I think a lot of them are still early adopters, especially in terms of AI.  [Banwart, Jesse] 13:31:04 I think the ways they'll improve, I already kind of mentioned, but like getting better at synthesis, getting a little bit better at like Not just saying obvious things and having that be what they present out.  [Banwart, Jesse] 13:31:19 Getting to a little more like heart and meat of things.  [Banwart, Jesse] 13:31:23 And yeah, we, I mean, we use tools in every every asset even so mu iq like even though there's a lot of built-in stuff with it, a lot of times we're exporting that out to Excel and I'm building out  [Banwart, Jesse] 13:31:37 Formulas and charts and stuff in there. It's not like there's just everything I use as a tool  [Dulaney, Stephen] 13:31:42 Okay, that sounds good. Now, what role does the look and the feel of your end product place to the to the clients, how important is that?  [Banwart, Jesse] 13:31:50 Not really to the clients. It's important to me because I love working with interfaces that are nicer to work with.  [Banwart, Jesse] 13:31:57 But not the clients, they're very rarely in the tools, if ever.  [Dulaney, Stephen] 13:32:00 Now, what about your outputs that you're sharing with the clients?  [Banwart, Jesse] 13:32:04 Yeah, we spend a lot of time making those pretty for clients. It would be a lot better if tools were better about having readily exportable things that you could just pull up and pull up say like ideally it would be so nice if you could just set up in a tool your list of  [Banwart, Jesse] 13:32:23 What you wanted to find out, how you were going to find that out, and then click export and it spit out a presentation that said.  [Banwart, Jesse] 13:32:31 Here's what we found. Here's everything that you said you were going to do with these questions.  [Banwart, Jesse] 13:32:37 But we're kind of a ways away from that, I think.  [Dulaney, Stephen] 13:32:40 Okay, that sounds good. So if you had a magic wand, what one thing would you change in your user research environment?  [Banwart, Jesse] 13:32:49 Um…  [Banwart, Jesse] 13:32:54 I would… make people… I don't know. I would make people pay me more. I would use my magic wand for really negative things. I would not… I guess if it's like benefiting the good of everything, I would… I mean, I would love a like bias  [Dulaney, Stephen] 13:33:02 Okay.  [Banwart, Jesse] 13:33:14 Want. I would love to like put something together and then just… Hey, like remove the humanity. Not the humanity, but remove the like So much of what you put together can sometimes be a reflection of your worldview and what you're doing. I would love if it was just like  [Banwart, Jesse] 13:33:35 Every single time we put together a usability test, the instructions are unclear to somebody, even though they make the most sense in the world to me.  [Banwart, Jesse] 13:33:43 A magic wand that's like clarify.  [Dulaney, Stephen] 13:33:46 That's interesting. Yeah, that's how I got here. If I talk to one of your um the people you work for. And I asked him, please describe Jesse to me in one word. What one word would you want them to tell me?  [Banwart, Jesse] 13:33:59 Ooh. I would want them to tell you insightful.  [Dulaney, Stephen] 13:34:04 Insightful. Good. Is there anything during the heat of a project that keeps you up at night?  [Banwart, Jesse] 13:34:13 Um…  [Banwart, Jesse] 13:34:18 Not from worry. No, there can be things that keep me up at night. That's like a… Oh, I wish I would have pushed back in this way or like a um Oh, like I really don't think that this was like the best way to do something, but it's not like a…  [Dulaney, Stephen] 13:34:24 Okay.  [Banwart, Jesse] 13:34:40 Oh, I'm so afraid that this usability test is going to go wrong.  [Dulaney, Stephen] 13:34:45 Okay. Are there any questions that you expected me to ask that I have failed to ask so far?  [Banwart, Jesse] 13:34:45 That's not a…  [Banwart, Jesse] 13:34:53 No, I honestly didn't really think much about what questions you were going to ask and you actually you ask incredibly deep questions, which has me feeling very mentally drained right now. I'm like, oh man, I did not prepare enough for this.  [Dulaney, Stephen] 13:35:07 There's no preparation. I'll tell you some funny stories later after I get… back to myself. So we're going to switch now to the evaluative phase of this I'm going to share some screens. They're crude and they're break every day.  [Banwart, Jesse] 13:35:15 Okay, let's hear it.  [Dulaney, Stephen] 13:35:22 But they are actually improving so um I wish I could give you control. Do you have, am I sharing right now? Nope, nope, share.  [Banwart, Jesse] 13:35:30 Not sharing, but you can give me control  [Dulaney, Stephen] 13:35:33 How do I do that?  [Banwart, Jesse] 13:35:36 Let's see.  [Banwart, Jesse] 13:35:42 In your… Do you have an option that is like… share control or control.  [Dulaney, Stephen] 13:35:53 That's just sound. A remote controller.  [Banwart, Jesse] 13:35:56 Yeah, that's sound. There's one that's Yeah.  [Dulaney, Stephen] 13:36:00 Okay, so now do you have control of the mouse?  [Dulaney, Stephen] 13:36:07 Wait, do I have to do something else? Give mouse control to Jesse. Yes. Sorry.  [Banwart, Jesse] 13:36:12 Perfect. Okay. Click start.  [Dulaney, Stephen] 13:36:14 I've never done this before this new thing. So what are you looking at?  [Banwart, Jesse] 13:36:20 Okay, I'm looking.  [Banwart, Jesse] 13:36:27 I'm ready.  [Dulaney, Stephen] 13:36:29 Okay, what do you see? This is Darius. The goal here is to try to come up if you need if you had a a digital research and interview assistant.  [Dulaney, Stephen] 13:36:39 What you want that assistant to do? What task would it want you to offload? How could it make your streamline your work?  [Banwart, Jesse] 13:36:39 Mm-hmm.  [Dulaney, Stephen] 13:36:45 Save you time, get you better insights. You know pay you more.  [Banwart, Jesse] 13:36:50 Gotcha. Okay. So I see… Active projects.  [Banwart, Jesse] 13:36:56 I think that would be a little too, unless this text is like regenerated, I don't know that I would ever author any of those descriptions for that. It would probably just be a title.  [Banwart, Jesse] 13:37:08 Resume where you left off. I would maybe want to like categorize this. I don't know if you have a way to like do by client or by engagement, right? So I would want to click into like a spectrum or a whatever to kind of separate those a little bit.  [Banwart, Jesse] 13:37:23 It would be good to see…  [Banwart, Jesse] 13:37:28 A really clear way for like some kind of like digest information.  [Banwart, Jesse] 13:37:34 Button right where it's I have documents or I was sent a PDF of something. It'd be great to like upload, add that document. I don't know if that would be in start a new project or in new But it would be like a good example. I was sent a big list of medallia entries for a month, right?  [Banwart, Jesse] 13:37:54 I don't really want to like read through every single one of those and organize those. It'd be awesome to just like have a, hey, upload this.  [Banwart, Jesse] 13:38:03 Provide me a quick summary of what's in here.  [Dulaney, Stephen] 13:38:06 And that's a good one. Okay, let's click something and just see what happens.  [Banwart, Jesse] 13:38:08 By like a document level.  [Banwart, Jesse] 13:38:14 Okay, let's start a new project.  [Dulaney, Stephen] 13:38:16 And the design is, this is basically all done in cursor and it's all prompt programming.  [Dulaney, Stephen] 13:38:21 So I basically just say, I need a new project page and it does the design. So I haven't actually had like a research person do a design.  [Dulaney, Stephen] 13:38:32 Now, if I told you that this information that you put in there was going to be used by an AI to generate a project plan.  [Banwart, Jesse] 13:38:32 Yeah, I don't…  [Dulaney, Stephen] 13:38:39 Would you spend more time filling in the the business reasons and the problem space.  [Banwart, Jesse] 13:38:46 Well, I don't know that I would trust AI to make a project plan for me. I'm not really entering in what I want to know, right?  [Dulaney, Stephen] 13:38:55 Now, why wouldn't you trust an AI to make a project plan?  [Banwart, Jesse] 13:38:59 Because I'm not entering in what I want to know. All that work that I do that's like, oh, let's lay out the flow. What questions do you have?  [Banwart, Jesse] 13:39:07 Like, what are we concerned about? I'm not seeing a place to put any of that. So anything it spits out is it'll maybe be a generic one or it'll be like a, hey, you want to test this? Go for it.  [Dulaney, Stephen] 13:39:18 Okay, so is that different from a project or a research plan?  [Banwart, Jesse] 13:39:23 Oh, I guess I don't, I wasn't differentiating between the two.  [Banwart, Jesse] 13:39:27 What's a project plan?  [Dulaney, Stephen] 13:39:29 A project plan is like you put in your kickoff deck and you put in like your meeting notes And you click if you're going to do stakeholder interviews or whatever. And then it basically sends you like a pretty quick little Gantt chart of like, here's how you squish things into  [Dulaney, Stephen] 13:39:42 Six weeks. And here's your milestones and here's your little time boxes.  [Banwart, Jesse] 13:39:47 That'll be really helpful for the beginning part of projects where there's a, hey, like how long is this going to take? What would even our plan be?  [Banwart, Jesse] 13:39:57 So understanding that that's what I'm doing here, I would do a little bit different approach.  [Dulaney, Stephen] 13:40:02 Okay.  [Banwart, Jesse] 13:40:06 I would need to, okay, so I can… The problem for me is like, I wouldn't know what methods to use for sure.  [Banwart, Jesse] 13:40:16 Without first knowing what I wanted to find out, right? Yeah, so let's just do like kind of a really generic one. Would they want to do a new, it's a company that wants to do a new… employee tool that's going to save an employee a bunch of time, right?  [Dulaney, Stephen] 13:40:20 Okay, so you need to know what you want to find out first.  [Banwart, Jesse] 13:40:38 So I would say, okay, the company is company one.  [Banwart, Jesse] 13:40:45 It is… We're exploring… Creating.  [Banwart, Jesse] 13:40:55 A new… tool that pulls in APIs from multiple existing tools into one mega tool, right? Because that's all we do.  [Dulaney, Stephen] 13:41:10 Okay.  [Banwart, Jesse] 13:41:11 The problem space, I don't really know how to answer this or what it would do.  [Dulaney, Stephen] 13:41:15 Okay, we'll leave it blank then.  [Banwart, Jesse] 13:41:18 Okay. Stakeholders, would I like tag people that are in this system.  [Dulaney, Stephen] 13:41:23 Theoretically team members, but we'll see. Stakeholders could be too because it could it could help like schedule and send emails. I don't know yet.  [Banwart, Jesse] 13:41:26 Okay. So I definitely do stakeholder interviews.  [Dulaney, Stephen] 13:41:33 This is all like hopes and dreams.  [Banwart, Jesse] 13:41:34 Yep. Totally. I think I would do wireframe evaluation. I don't know that I would do user. I would maybe do a couple user interviews, but I would do probably mostly user survey.  [Dulaney, Stephen] 13:41:45 Okay.  [Banwart, Jesse] 13:41:46 I would definitely do an ambition workshop. Not really sure what a contextual inquiry is.  [Dulaney, Stephen] 13:41:51 Observation. That's Karen's word. I need to change that. It's Eddie, where you go watch people where they were.  [Banwart, Jesse] 13:41:55 Gotcha. Yeah, I think I would do that.  [Banwart, Jesse] 13:42:01 Initial research plan. Could I use this for like… sidekick and be like, hey, build out a research plan or is that kind of the idea here?  [Dulaney, Stephen] 13:42:09 Yes, yes, yes. I mean, this is essentially, I've got two tracks going. We're doing these sidekick tools I didn't do that other one, but someone did one that does a research plan. And then I'm doing one that generates personas and generates  [Dulaney, Stephen] 13:42:20 And I don't know who's going to win yet because they both kind of send a prompt and send the interviews and they make a persona.  [Dulaney, Stephen] 13:42:27 But we're kind of developing these. At the same time. This one allows you to manage way more files and upload more stuff.  [Dulaney, Stephen] 13:42:35 And then potentially if I get this next thing figured out.  [Dulaney, Stephen] 13:42:38 The way I do the transcripts right now is just one blob, but I'm going to try to do it where it does by speaker.  [Dulaney, Stephen] 13:42:45 So each little, and what happens, it'll have a different entry for when you speak and a different for my question And then you can send those to the vector database and then you can sentiment analysis like individual statements from individual speakers.  [Dulaney, Stephen] 13:42:58 So that would be the big win. Okay, so this just kind of post page.  [Dulaney, Stephen] 13:43:04 And then new interview, I need to redo this page. This is actually, click the new interview page. How would you do I need to do like a let me try to phrase this question. If I want to do a study form  [Dulaney, Stephen] 13:43:17 Do I want to just do one research study form and it accounts for like interviews, surveys Or do I need a different form for a research study, for a survey, for an interview?  [Dulaney, Stephen] 13:43:30 What's your thoughts on how I should approach trying to make it easy for someone to form a research plan and then It's child objects it's is seamlessly as possible.  [Banwart, Jesse] 13:43:42 Yeah, I kind of know if you like a form is the right move here. What would be really cool is to be able to upload a new interview, but upload a transcript.  [Dulaney, Stephen] 13:43:51 Okay, you can do that. Go to research And then go to upload transcript.  [Banwart, Jesse] 13:43:58 Okay.  [Dulaney, Stephen] 13:43:59 So what kind of information i just kind of generic right now in my asking too much, not enough.  [Banwart, Jesse] 13:44:06 I think this is fine. Researcher name, role. I think that's fine.  [Banwart, Jesse] 13:44:12 Project name. I guess I would maybe want to do it more in the context of the company I just created.  [Dulaney, Stephen] 13:44:20 Okay, good, good. Yeah, it kind of does. Go to, see, where do I have that? Do I have project name. That's the company  [Banwart, Jesse] 13:44:20 Because this feels like it's outside of that, right?  [Banwart, Jesse] 13:44:29 Got it. So this would be like a dropdown that I could… pick from existing projects.  [Dulaney, Stephen] 13:44:37 Yeah.  [Banwart, Jesse] 13:44:38 Yeah. Okay. I get that. Yeah. And then I would upload, I would expect to upload a text file Um.  [Dulaney, Stephen] 13:44:47 Yes.  [Banwart, Jesse] 13:44:50 Yeah, again, I don't know that I would fill out like all this information for each of the interviewers. I suppose I could. I mean, there's really no reason not to.  [Banwart, Jesse] 13:45:00 Ideally, I mean, I'm already asking these questions in the interview, right? So ideally I would be able to upload something and it already kind of answers like pulls this up and answers a lot of this and I can edit it as opposed to having to put in the fields. You know what I mean?  [Dulaney, Stephen] 13:45:14 I agree. I agree. I mean, this kind of has evolved like and then get left there because i started this whole study started when You know, I kind of ask the same questions every time. And the funny thing is, I haven'  [Banwart, Jesse] 13:45:18 Yeah.  [Dulaney, Stephen] 13:45:25 I didn't really start with a research question, if you noticed.  [Dulaney, Stephen] 13:45:30 Because I was self-taught and I just came along accidentally. I'm like more of an accidental researcher I do these real touchy-filly research studies.  [Dulaney, Stephen] 13:45:40 So I consider like persona journey mapper, or if I'm going to evaluate an application. So the researcher pointed that out to me and that's when I realized I need to speak with real researchers.  [Dulaney, Stephen] 13:45:53 It was an eye-opening experience. Okay, so that transcripts.  [Banwart, Jesse] 13:45:56 Yeah, that's really cool to have. Can I go back? Will that take me back to the company? So I think what would be like.  [Banwart, Jesse] 13:46:04 So you have this like research insights thing, I think a key findings thing is is cool.  [Banwart, Jesse] 13:46:10 I would click into that expecting it to be a little bit of synthesis from like everything that I've uploaded here.  [Banwart, Jesse] 13:46:16 But I'm open it up to more than just interviews, right? So interviews would be great. Upload a transcript. I think it would be cool to also upload survey data. It would be cool to also upload Like sometimes we get Adobe Analytics reports.  [Dulaney, Stephen] 13:46:17 Okay.  [Dulaney, Stephen] 13:46:31 Interesting.  [Banwart, Jesse] 13:46:31 I'll get like crazy complex. I don't know, just different kinds of documents that could all kind of feed into a key findings thing.  [Dulaney, Stephen] 13:46:44 Okay. Go to plans under the primary navigation. We'll just kind of look and see.  [Dulaney, Stephen] 13:46:49 We did research, we did a new project. Go to research plans because I think that's it's actually archive.  [Dulaney, Stephen] 13:46:55 Okay, so then this is an archive of individual transcripts that are uploaded. And then it has Zach Matt Search. Like if you search for fly fishing, you'll get five results So the idea is that each of these cards would be either notes, anything you uploaded, and then you could kind of search and sort through  [Banwart, Jesse] 13:47:00 Oh, okay.  [Dulaney, Stephen] 13:47:14 Induced sentiment. Some of them have frustration, mobile, authentic Does it actually work all the way yet, but that's the um And this is probably page will go away, but this basically is Search and sort type.  [Dulaney, Stephen] 13:47:29 Of all the assets but all the assets  [Banwart, Jesse] 13:47:30 Well, you know what I really like about this is so it's cool to have this um accessible. When I've done this manually in the past, I've done like full transcript or like raw notes at the end and I have a consistent like summary page. So what would be cool here if like you had a box that was like  [Banwart, Jesse] 13:47:50 Key points or like some kind of… Well, not shopping cart to store away, but like an open field that ideally would be auto generated that you could edit, but also like even just in the meantime, like it would be great. What would really help in this. So we run these 45 minute interviews  [Dulaney, Stephen] 13:47:52 A shopping cart where you can keep your notes. It is.  [Dulaney, Stephen] 13:48:00 Okay.  [Banwart, Jesse] 13:48:12 Do our 15 minute of synthesis after. It would be great to just sit here We talk as a group. What's kind of the main points that this person brought up?  [Banwart, Jesse] 13:48:21 What do we need to, and also questions to ask to circle back with them on based on that conversation we always document and usually send a follow-up email with some additional questions.  [Banwart, Jesse] 13:48:32 This could be really, really cool to kind of document as a like interview profile. I like this a lot.  [Dulaney, Stephen] 13:48:38 Now, have you done in that exercise, have you ever like pulled up AI and thrown the transcript in there as part of your debrief?  [Dulaney, Stephen] 13:48:45 And with the team kind of ask joint questions and then type, you know.  [Dulaney, Stephen] 13:48:49 And just use it as a supplement to what you're already doing.  [Banwart, Jesse] 13:48:52 Kind of, no, no, we've never, I've never done that.  [Dulaney, Stephen] 13:48:56 Okay, let's go to, what do I have under research I have upload transcripts. You talk to that. Let's go to synthesis.  [Dulaney, Stephen] 13:49:04 Persona. His persona right there.  [Banwart, Jesse] 13:49:05 Create persona or  [Banwart, Jesse] 13:49:17 Okay.  [Dulaney, Stephen] 13:49:18 Okay, what would you look? Okay, keep going.  [Dulaney, Stephen] 13:49:25 Okay. I mean, there's hover when you actually hover over the transcript or the analysis or the metadata, it kind of shows you a card.  [Dulaney, Stephen] 13:49:32 So you can, but this is like we mentioned, it's going to be like project centric These are the interviews, these are the archives. These are the notes, anything that's part of that Fly Fishing Montana.  [Dulaney, Stephen] 13:49:42 And then you select it and throw it at the open ai And these prompts can be refined and improved, but  [Banwart, Jesse] 13:49:55 Spending, I think…  [Dulaney, Stephen] 13:49:55 Thinking it's thinking. Nope. Wait, you got to go back. It'll do it.  [Banwart, Jesse] 13:49:59 Okay.  [Dulaney, Stephen] 13:50:00 Yeah, it just takes a while because it's throwing a lot of stuff. It's um  [Banwart, Jesse] 13:50:05 Yum. You said, okay, so there are cards here that give a preview of the conversation  [Dulaney, Stephen] 13:50:10 Yeah. And initially I did an analysis after every interview because I did the the um it was it was that it was computer was conducting the interview?  [Banwart, Jesse] 13:50:15 Yeah.  [Dulaney, Stephen] 13:50:21 But now I think I'm going to separate out the interview from the analysis.  [Dulaney, Stephen] 13:50:25 And just treat the transcript differently for sentiment analysis. Okay, we'll select some of those if they'll see it or not.  [Banwart, Jesse] 13:50:31 I like this analysis. What I would make sure you can do is, oh, you can, never mind. There was a little bit glitchy for a second, but… being able to mouse over and scroll through and read analysis. I think that's great.  [Dulaney, Stephen] 13:50:39 That is glitches risk?  [Dulaney, Stephen] 13:50:48 I select two of them and then we'll just let it churn and I'll show you something else and why that's churning.  [Dulaney, Stephen] 13:50:54 Okay, let me take you to this tool here. This is a persona builder and we're going to add two of the Kinza.  [Dulaney, Stephen] 13:51:06 And… I interviewed her yesterday.  [Banwart, Jesse] 13:51:06 Oh, do you know Kinza? Oh, awesome. I'm trying to get a hold of her because I want access to Dovetail.  [Dulaney, Stephen] 13:51:13 Oh, she was good, yeah. I'm specifically staying away from Dovetail for a bit.  [Dulaney, Stephen] 13:51:20 Because I don't want to be influenced by dovetail or asset until I'm finished.  [Dulaney, Stephen] 13:51:25 Okay, so I uploaded two transcripts And then this is what you do in basically GPT. This would be sidekick. These are going to be sidekick skills.  [Dulaney, Stephen] 13:51:39 Okay, so now I'll let that turn. This is what we got here. What do you think?  [Banwart, Jesse] 13:51:47 Um…  [Dulaney, Stephen] 13:51:48 Now, the quality of the interviews is pretty low because that's just me answering stupid questions but um In general?  [Banwart, Jesse] 13:51:55 So I'm very much, I'm an annoying person to talk to in this regard because I think that personas that don't have a specific goal identified of how you're going to put them to use are kind of a waste of time, right?  [Dulaney, Stephen] 13:52:10 Okay, focus and empathy. We can't do things for everybody. So we have to focus and empathy Because we care.  [Banwart, Jesse] 13:52:10 What I…  [Dulaney, Stephen] 13:52:19 And you need to have some vehicle to make sure that you're really thinking about the user and not just get lost in the details of your work.  [Banwart, Jesse] 13:52:28 Okay, understood. So the goal of these is to provide something for me to some version of a person to empathize with in a process.  [Dulaney, Stephen] 13:52:38 The team, the whole team, so that we're not saying I like blue, you like blue. It's like, what is whoever this is Alex like?  [Dulaney, Stephen] 13:52:44 So use it as a vehicle, a shared resource, and you all kind of fight about and agree what's in there and what's not, but you don't fight about blue or a dropdown, you think about what Alex needs.  [Banwart, Jesse] 13:52:57 So there's information here and I can read it and that's that's fine. I think that's kind of the main goal of what this persona is, is to pull together information that's been pulled from multiple different people and have like a summarized unified person.  [Banwart, Jesse] 13:53:13 If that's the goal, that's great. What I think personas need to do is either talk about different identities and how to shift behavior or moments in or qualities around them.  [Banwart, Jesse] 13:53:25 And how we can better utilize that to meet a certain goal, right?  [Banwart, Jesse] 13:53:30 So I think there's How can we shift behavior or what are the qualities of this person that we need to approach creatively in order to shift them to behave more like the customer we want them to behave like, right?  [Dulaney, Stephen] 13:53:30 Shift behavior what was the other one?  [Dulaney, Stephen] 13:53:46 Those are good points. Obviously, you don't do personas what research, what synthesis would you put add to this collection?  [Banwart, Jesse] 13:53:47 Give them a little bit.  [Banwart, Jesse] 13:53:57 Like what's missing for me is the goal so like I like that you can see this breakdown and I think there could be an exercise or an activity that's like, oh, what's interesting is like there's these areas of common pain points or there's this kind of like  [Dulaney, Stephen] 13:54:16 The goal section.  [Banwart, Jesse] 13:54:17 The goals, I think that's, that's interesting to think about What I would maybe want to see added here is some kind of way to like Because another way that I think personas are put to good use is like to remind designers or anyone doing anything that there are multiple different mindsets that are going to be looking at the same thing.  [Dulaney, Stephen] 13:54:40 That's interesting because I use it to focus. As opposed to explain that there's a wide variety of people. There could be different people you don't know who it is. That's kind of, I mean, I think we clearly come at this at different angles, which is very useful for me.  [Dulaney, Stephen] 13:54:54 Because personas, I grew up with them. I was actually in the room with Hartman when he was interviewed by Businessweek and he came up with this word along with scenario design and they printed it and we thought he was just  [Dulaney, Stephen] 13:55:05 We scoffed at him when he did it. And now to see… what happened to that word after that one interview is just remarkable.  [Dulaney, Stephen] 13:55:13 And how he shaped, influenced you know how he influenced And he was just being pompous. He was an industrial designer that did the Macintosh snow white language And that was just Baharman. That's just what he did. He made up words.  [Banwart, Jesse] 13:55:13 That's crazy.  [Banwart, Jesse] 13:55:25 Yeah, that's crazy. Well, I thought you were there for the beginning of that.  [Dulaney, Stephen] 13:55:27 What is this? Crazy. But as far as research Because you still conduct research and maybe you still interviews, what output? I mean, can you give me examples of the of the synthesis that you value the most.  [Banwart, Jesse] 13:55:30 I think…  [Banwart, Jesse] 13:55:47 Um…  [Dulaney, Stephen] 13:55:49 I guess I want to see your deliverables at some point.  [Banwart, Jesse] 13:55:51 Yeah, happy to share deliverables.  [Dulaney, Stephen] 13:55:54 The what we can do to assist in shaping a prompt that helps you do that faster.  [Banwart, Jesse] 13:56:00 Yeah. And what I was about to say, like what would be interesting here is to have some kind of way to… assess how this persona would respond to something, right?  [Dulaney, Stephen] 13:56:12 So let's switch gears. I'm going to let you do this here. And I want you to, this is the same persona. There's an image.  [Banwart, Jesse] 13:56:13 So.  [Dulaney, Stephen] 13:56:20 Well, it's different. Got a JSON folder.  [Dulaney, Stephen] 13:56:26 What question? Would you ask?  [Dulaney, Stephen] 13:56:30 Would you want to explore? This is a user researcher. This is basically Kenza and Suzette.  [Dulaney, Stephen] 13:56:36 What type of question would you want to ask them? From the research just from the research  [Banwart, Jesse] 13:56:42 Okay, so would a checkout flow with 15 steps be 15 steps.  [Banwart, Jesse] 13:56:56 That took six minutes. Be too much of a… burden for this persona And how likely would they… likely would they be to get all the way through it?  [Dulaney, Stephen] 13:57:21 Okay, that's interesting. Now, the interview was the same interview I gave you.  [Dulaney, Stephen] 13:57:26 We didn't talk about steps, but I'm going to see what it does.  [Banwart, Jesse] 13:57:31 Be perceived as burdison. The steps are clearly, yeah, this is great.  [Banwart, Jesse] 13:57:37 These are the kinds of things that I would want to ask or like be able to ask in terms of like um across all personas. So I think personas should exist as a set. So I would be like, hey, we're putting together a checkout flow that is the step six minutes.  [Banwart, Jesse] 13:57:55 What would their response be to this flow? Or what would likely be their response?  [Banwart, Jesse] 13:58:01 Call out some of the things that maybe we wouldn't think of based on what this is knowing of the personas. This is awesome. I like this.  [Dulaney, Stephen] 13:58:08 And essentially you can do this on Sidekick where you load up your transcripts and you ask questions. But that's the idea that we're trying to do over here in Daria is… But I want to try to, I think I can do a little better because I think if I break the transcripts into individual  [Dulaney, Stephen] 13:58:23 Question answer, then it'll surface like what your answer is and then give it a sentiment.  [Dulaney, Stephen] 13:58:27 And I can't do that right now. I'm close. Okay, well, thank you for your participation. As a thank you for your help in this. You'll have early access to this to ever get off my laptop and onto a website.  [Banwart, Jesse] 13:58:30 Yep. Understood. I do have to drop.  [Dulaney, Stephen] 13:58:44 Thanks so much, Jesse. And I learned a lot. And the funny thing is I probably need to have a research question before I start a study, but mine's all touchy feely. I just start asking questions and then learn what I learned.  [Banwart, Jesse] 13:58:56 Yeah. Yeah. I like that approach too. There's all sorts Thanks so much, Stephen. I appreciate it. We'll talk to you soon.  [Dulaney, Stephen] 13:59:00 There he is. Really getting to see the expertise of our team and it's been fascinating. There are certain areas that I really enjoyed learning and I would take with me.  [Banwart, Jesse] 13:59:09 Awesome. Well, same here. It's awesome to see how much work you've put into this and how it's coming together.  [Dulaney, Stephen] 13:59:10 Go ahead. Okay, thank you.  [Dulaney, Stephen] 13:59:15 Thanks so much. Bye  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Jesse Banwart",
      "age": "35-44",
      "gender": "male",
      "location": "Los Angeles CA",
      "occupation": "Researcher",
      "industry": "Consulting",
      "experience": "14",
      "education": "masters"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  },
  "created_at": "2025-04-23T10:19:05.530280"
}