{
  "id": "4264d33e-a96b-45da-ab34-38b9fc2cbf29",
  "transcript_name": "Pukka's User Interview",
  "project_name": "Daria Research of Researchers",
  "interview_type": "Persona Interview",
  "project_description": "Interview to understand how qualitative interview approach is the same or different from quant",
  "date": "2025-04-26T12:26:42.471734",
  "transcript": "[Dulaney, Stephen] 08:58:48\nTesting the transcript.\n\n[Dulaney, Stephen] 09:03:19\nHello, how are you?\n\n[Pukka Tackie] 09:03:22\nHello, I'm good. Sorry I'm late. She's jumping. Yeah, yeah.\n\n[Dulaney, Stephen] 09:03:24\nI'm going to turn off the washer real quick so that I don't have too much note.\n\n[Dulaney, Stephen] 09:03:39\nHello, thank you for participating in my research study. I'm going to go kind of fast.\n\n[Pukka Tackie] 09:03:42\nNot a problem, yeah. We do 30, just a bunch of meetings popping up this week. So it's a little wild. Yeah.\n\n[Dulaney, Stephen] 09:03:49\nI understand. Anytime. I appreciate it. Do I have your permission to do a recording and keep a transcript?\n\n[Pukka Tackie] 09:03:55\nYes, please do.\n\n[Dulaney, Stephen] 09:03:56\nThank you. Starting. So will you please tell me a little bit about your background and what your current role is and how you ended up in user research?\n\n[Pukka Tackie] 09:04:06\nOkay. Current well My role is evolving at the firm, but I'll just kind of like speak to in the context of being a researcher. So within the applied design practice, I sort of started or my origin story has been an insights lead.\n\n[Pukka Tackie] 09:04:23\nSo a lot of what that is is qualitative research using human-centered design sort of principles To have conversations with different kinds of users, pulling those kinds of insights.\n\n[Pukka Tackie] 09:04:38\nWhere we kind of ask questions that get to the why. And then using that kind of shape either product, service, general strategy around how different clients are kind of like executing on those things. So that's the context of my role and sort of how I serve clients here at the firm.\n\n[Dulaney, Stephen] 09:04:55\nOkay, how did you get into this line of work? Did you have any mentors or influential Positions?\n\n[Pukka Tackie] 09:05:03\nWell, the origin story kind of came from college. I had a friend who was actually doing an internship program who came, who was telling me about human-centered design. And then so she had a bunch of books, a bunch of like courses, and then that sort of like created my, I just kind of followed that curiosity and that kind of landed me here.\n\n[Pukka Tackie] 09:05:23\nIt was less of a purse. Well, I guess like, you know, it was from this friend, but it was less of like a mentor or someone who talked to me about it. It was more so I started to see the possibilities with having a human centered design lens. And I just wanted to be sort of plugged into that world. And so I was exploring the potential directions and options there. And that kind of landed me in the research um\n\n[Pukka Tackie] 09:05:46\nRealm of what that is. So that's kind of how I landed here.\n\n[Dulaney, Stephen] 09:05:50\nSounds great. With respect to your role as Insights Lead, what is your primary goal?\n\n[Pukka Tackie] 09:05:56\nHmm, primary goal is always through from… The research objectives that we have, we sort of agreed on it's digging into and asking the why. So getting into understanding motivations, needs, preferences.\n\n[Pukka Tackie] 09:06:18\nIt's truly that why question, trying to understand the why behind reasoning for behaviors. And so regardless of what those objectives are, I think that's what that's that's what it serves in being a qualitative research. And then it's really advocating for that voice as we continue to shape\n\n[Pukka Tackie] 09:06:39\nWhat those insights are. So when it gets into the realm of product or the realm of service.\n\n[Pukka Tackie] 09:06:45\nWhether it's like a marketing sort of like initiative, it's really advocating for the voice of the user. So that's sort of like the goal that I'm usually thinking of when I'm talking to people.\n\n[Dulaney, Stephen] 09:06:57\nAre there any key frustrations that you encounter when pursuing your primary goal?\n\n[Pukka Tackie] 09:07:03\nUm… Yes, I guess like that's you know how we can talk about frustrations it's across I guess like different categories. So there's a process piece Where it's like, depending on the type of project, how long it's scoped out for and such.\n\n[Pukka Tackie] 09:07:23\nThere are key parts of the process that can be challenging. So it's like, if you're going to be doing, if you have a very targeted sort of audience that you're getting into. Recruiting can be a very challenging process.\n\n[Pukka Tackie] 09:07:35\nAnd that usually is a piece like challenges from a research like a qualitative research project can start because it's getting the right folks and talking to the right folks, especially if it's finding customers in the wild. So if it's not like\n\n[Pukka Tackie] 09:07:50\nA specific group of people that are already sort of like existing that you can just kind of pull from from the data set or like focus group or something like so that already exists.\n\n[Pukka Tackie] 09:08:00\nSo recruits are usually difficult. I think within having conversations with folks as well, it's sort of like figuring out the skill of like pivoting, expanding how you think about questions and such based on your objectives to make sure that you're actually pulling insights that are relevant or getting conversations that are relevant.\n\n[Pukka Tackie] 09:08:22\nAnd then there is like data processing, which is also like a process piece, which is like, I have all these quotes and all these different things.\n\n[Pukka Tackie] 09:08:31\nHow do we kind of make sure that piece, you know, we're able to synthesize those into something that's useful. So I think process pieces are one. And then there's a second piece too, which is For qualitative research, you're always trying to advocate for the process.\n\n[Pukka Tackie] 09:08:48\nAnd so it's especially here at the firm where we work primarily with clients kind of doing these kinds of things, it's making sure everyone's kind of on the same page, the process makes sense when you have multiple stakeholders trying to get them through the process as well and not kind of tamper with like.\n\n[Pukka Tackie] 09:09:05\nEspecially because it's generative research. It comes from grounded theory research where it's like, let's figure out what we're learning, then we'll figure out how it kind of lands with different kinds of perspectives that can be challenging for people to understand.\n\n[Pukka Tackie] 09:09:20\nThere's a process piece which is like. Tools to kind of make everything move faster. And then there's a piece where it's like wrangling stakeholders to make sure that the process happens the way it should also.\n\n[Pukka Tackie] 09:09:34\nSo I hope what I'm saying makes sense, but\n\n[Dulaney, Stephen] 09:09:35\nYeah, it does. And everything you say makes sense because you know the kind of work I'm doing. So I'd like you to think back about your first type research activities. What kind of tools and what kind of process, how did you approach your research studies when you just got started?\n\n[Pukka Tackie] 09:09:48\nOh, God. That is a while back.\n\n[Pukka Tackie] 09:09:55\nI was pretty… I would say it was like cobbling together different tools, but it was pretty manual, which there's always an element of that when it comes to qualitative research.\n\n[Pukka Tackie] 09:10:10\nBut when I think back. I think we were trying to do like a traditional journey map so what happened was we used like a survey monkey to do the recruit So that was sort of like the tool for recruiting. Then we did\n\n[Pukka Tackie] 09:10:33\nWhat else? But we had a data set for like people to target and then that was helpful. So it's like we sent the the survey link for which is like a screener to a whole bunch of folks and then that, so that kind of helped with the targeting or the recruit. But it's sort of like the manual process of like.\n\n[Pukka Tackie] 09:10:52\nI need to see all the responses that are coming in. Then I have to kind of like use a checklist, look at the responses, tick off who I want to follow up with.\n\n[Pukka Tackie] 09:11:03\nThen send them an email. Hopefully get a response.\n\n[Pukka Tackie] 09:11:09\nSo then the manual process there was like, you need to pay attention to like responses that are coming through. You need to sift through those responses. You need to reach out to people. You need to monitor for people to reach back out. I remember I started like texting people because we weren't getting responses through email.\n\n[Pukka Tackie] 09:11:25\nIt was wild. But there was that piece. And then it's like you get the interviews.\n\n[Pukka Tackie] 09:11:31\nThen we just used Zoom for the interviews. Got the transcript from Zoom, if I remember correctly, but then it was the process of like, man, now we have to go back, which is like always a manual process.\n\n[Pukka Tackie] 09:11:45\nGo back, look at the quotes. Pull out relevant quotes to use to build this journey.\n\n[Pukka Tackie] 09:11:54\nRight now, I haven't done a journey map in a long time and to the point where my role is changing, how research is done right now, because I'm usually like managing people who are doing Yeah.\n\n[Dulaney, Stephen] 09:12:01\nSo that's the next question I'm going to interrupt you. How do you do that same research project today?\n\n[Pukka Tackie] 09:12:07\nOh, yeah. So now I think there are interesting tools that can be used.\n\n[Pukka Tackie] 09:12:12\nI'm blanking out on the tool that we use right now.\n\n[Dulaney, Stephen] 09:12:16\nThat's okay. It'll come to you.\n\n[Pukka Tackie] 09:12:19\nYeah, I'll just keep talking. It'll probably come. But we like dovetail. There we go. So then… dovetail or when we used to have this contract with like descout and such, sometimes you can do your research studies in there and what happens is like when you're done with the interview, you get the automatic transcript.\n\n[Pukka Tackie] 09:12:38\nSome of the research vendors that we use here as well have capabilities like so where it's like you do an interview within You do a certain kind of interview or an interview within a platform that's like homegrown for them or something, then you get the automatic\n\n[Pukka Tackie] 09:12:56\nTranscripts when you're going through, you can like snip, you can get the quotes like in there, like within their platform and then you pull out what you need.\n\n[Pukka Tackie] 09:13:05\nRight now, we still kind of depend on mural, mural, depending on like how you like to work. I've always used that tool. So in terms of evolution, I've always used a whiteboarding tool to kind of like put everything, like see everything, synthesize\n\n[Pukka Tackie] 09:13:20\nBut how it's faster now is like transcription Trying to pull quotes and such.\n\n[Pukka Tackie] 09:13:28\nThat kind of technology I feel like has evolved and then that moves faster um I've used versions of that like, you know, throughout the genesis of my research career up until now but So that's how it's kind of evolved and like relying on ai and such\n\n[Pukka Tackie] 09:13:45\nI think… how those tools have evolved too has been Especially when you're doing global research too. So then when you have to transcribe from a different language As well, getting the quotes.\n\n[Pukka Tackie] 09:13:59\nGetting the stories and such, getting like the, what's that thing called When you can like voice overlay to get like transcribed voices so you can listen to the interview and then like You can pull from there and such. I think AI is sort of like supported and helped throughout those pieces and\n\n[Dulaney, Stephen] 09:14:17\nHow have the deliverables changed? You mentioned that you used to do journey maps. Did you also do personas?\n\n[Pukka Tackie] 09:14:22\nYes, personas. Some people still kind of like personas. I think it depends.\n\n[Dulaney, Stephen] 09:14:23\nNow, what do you do today?\n\n[Pukka Tackie] 09:14:31\nI think right now when you have a persona Before people used to use personas as like specific targeting for like a product or marketing and such. I think it's evolved more to storytell, only storytell Or if people have personas it's like\n\n[Pukka Tackie] 09:14:49\nThey want to create the static version that you probably would get from qual and then they want to put it into their data source that they can continuously evolve from like data they learn about folks through different kinds of research methods. So whether it's like you have like social sensing or you have other kinds of\n\n[Pukka Tackie] 09:15:06\nTools where you get like an inflow of data that helps you kind of involve like how your personas are.\n\n[Dulaney, Stephen] 09:15:11\nYou're seeing an evolving persona that, because I look at personas, this gives you a focus They can't do it for everyone, so this presumably is a good focus and empathy.\n\n[Pukka Tackie] 09:15:12\nSo.\n\n[Pukka Tackie] 09:15:21\nYeah, yeah, yeah. So I think that's that's still the case. It's just You want to continuously get crisp about how you understand users and how you understand who you're targeting across whatever the goal is.\n\n[Pukka Tackie] 09:15:36\nSo it serves as a good starting point. That you can continue to see obviously the structure of the persona will stay the same.\n\n[Pukka Tackie] 09:15:46\nBut it's like, how do we continue to learn more about this particular audience or this particular user group and such?\n\n[Dulaney, Stephen] 09:15:52\nWhat about the role of the journey map in storytelling? Is it still used or not so much?\n\n[Pukka Tackie] 09:15:59\nI think in product roadmaps, it always has a always has a utility. But again, it's How I've seen it used recently like i've seen it recently is like probably more so like future state as opposed to current state. I think people are less interested in current state and more interested in future state. Or honestly, when we have clients who want future state journey maps, we're like, no, it's not going to be useful.\n\n[Pukka Tackie] 09:16:28\nSo do a future state one. So that helps to spark conversations amongst different stakeholders, which is always a challenge within any type of organization.\n\n[Pukka Tackie] 09:16:39\nSo then there's that piece. But then there's also again that context of can you kind of build your journey map in a way where you can create openings, even if there was a static document for like an influx of\n\n[Pukka Tackie] 09:16:55\nLike data. So what that means is, for example, if we build a journey map that says you're going to have a new feature that is like a ticketing profile to do something random um How are we, can you kind of like\n\n[Pukka Tackie] 09:17:12\nCome mess around with the journey map to say like, okay, if it's ticketing profile, but then this is how the feature comes to life for this particular archetype in your journey map.\n\n[Pukka Tackie] 09:17:21\nThat will be useful for products, will be useful for engineering, will be useful for like a UX person, like multiple different people. I think the goal right now is like some of these artifacts are relevant. It's just like, how do you sort of create them in a way that they can keep evolving?\n\n[Pukka Tackie] 09:17:37\nThat's always been the story of the story a lot of these artifacts, but I think it's become more incessantly relevant now to have like ways in which data can kind of evolve when it comes to\n\n[Dulaney, Stephen] 09:17:52\nWhat steps do you go from your insights and your artifacts to creating new software ideas.\n\n[Pukka Tackie] 09:18:01\nUm… I think it's, so you get the insights you synthesize them and storytell around them depending on what kind of story you're trying to tell.\n\n[Pukka Tackie] 09:18:15\nAnd then it's like I think that part is the big co-creation piece where you're always going to have some type of like workshop or working session with a client.\n\n[Pukka Tackie] 09:18:26\nAnd then figuring out what are the journey steps that make sense kind of from history for this type of client.\n\n[Pukka Tackie] 09:18:32\nHow do we kind of make that make sense? So it's like a think about it as like a workshop session. We'll come, we'll like play with different kinds of things.\n\n[Dulaney, Stephen] 09:18:39\nWhat is the output or the goal at the end of the workshop?\n\n[Pukka Tackie] 09:18:42\nThe output of the workshop is to get alignment usually on This is the insights that we have.\n\n[Pukka Tackie] 09:18:50\nIn terms of what we want to create for an artifact are these pieces beginning to make sense?\n\n[Pukka Tackie] 09:18:56\nAlso, like Stephen, this is like a series of conversations. So it's not like just one workshop you're usually having. You'll probably have one working session, which is like.\n\n[Pukka Tackie] 09:19:05\nHey, this is what we learned. And then you have people have additional insights from what's happened in the past.\n\n[Pukka Tackie] 09:19:12\nYou'll boost that up with your knowledge. Second conversation is okay. From what we've learned from these insights.\n\n[Pukka Tackie] 09:19:18\nIf we're going to make a journey map, let's call it that. These are the stages. This is how it's kind of coming to life.\n\n[Pukka Tackie] 09:19:24\nPeople will start to react with that. Then you evolve that piece.\n\n[Pukka Tackie] 09:19:28\nIf it's going to be like… Say that again.\n\n[Dulaney, Stephen] 09:19:28\nAnd how do you convert that into like design? How do you convert that into design?\n\n[Pukka Tackie] 09:19:35\nI think it's less of a science than a, it's more of an art than a science. So it's I think you pick usually it's anchored by like what are the design principles and that's kind of you pull that from insights.\n\n[Pukka Tackie] 09:19:48\nOn like what the patterns or themes are. It's like, okay, these are our design principles. So go build a screen or something like so based on these design principles. So that's usually the anchor.\n\n[Pukka Tackie] 09:20:01\nAnd I think we had work similar. Yeah, in our work, I think we had some of those\n\n[Dulaney, Stephen] 09:20:07\nWe did. I'm fascinated because I've seen the final deliverable and I see like the ambition statement, the design principles, the personas.\n\n[Dulaney, Stephen] 09:20:14\nThe journeyman the wireframes For me, I take the, in the old days, the journey maps and then that workshop we come up with opportunities And the opportunities become the opportunities become epics and user stories in Agile.\n\n[Pukka Tackie] 09:20:26\nYeah. I think that's still consistent it's just I think how the structure of the process really depends on multiple factors like time, all of those different pieces. Sometimes it's like we end up with how might we questions and we don't have clear like\n\n[Dulaney, Stephen] 09:20:27\nAnd then the designs follow. But that's just my process. But I'm learning.\n\n[Pukka Tackie] 09:20:47\nOpportunities, but then as you're you're building sort of like based on that anchor of like, these are how might we questions that we're kind of curious about so\n\n[Dulaney, Stephen] 09:20:55\nSo when you start with a research project or a discovery project, how do you come up with like the discovery plan of activities? Say it's an eight week project.\n\n[Dulaney, Stephen] 09:21:04\nWhat questions do you ask? What inputs are you looking for from the client from the pitch deck? Or what do you start with to create a discovery plan?\n\n[Pukka Tackie] 09:21:10\nYeah. Yeah. I want to know. I want to know what they know already. I want to know what kinds of questions they are interested in answering or sort of like what are the overarching sort of like business objectives that we have here\n\n[Pukka Tackie] 09:21:27\nThen it's like, what else do we know about this particular like target archetypes or groups what already exists, then it's like, okay, what are our hypothesis questions, which we will usually build or include and say like Okay, from all of the things that you've said, these are the kinds of hypotheses that we have. Then we structure research objectives. Then it's the\n\n[Pukka Tackie] 09:21:50\nScreener questions and so and so. But then there are other logistic pieces where it's like, okay, based on this particular user group, do we already have an existing group we can pull from data or are we kind of going into the wild? Do we need to work with a research vendor? Those are the kinds of like logistical questions.\n\n[Pukka Tackie] 09:22:07\nBut like foundationally, it's like, what do we already know? What are we trying to learn?\n\n[Pukka Tackie] 09:22:13\nAnd how do we just make that as crisp as possible so we can get outcomes that we're looking for?\n\n[Dulaney, Stephen] 09:22:19\nSo going into a project, you kind of know ahead of time from past projects your framework of what activities and when you're going to run them as far as the swim lanes in a Gantt chart.\n\n[Pukka Tackie] 09:22:31\nI do not use a Gantt chart. In terms of like process, but to the general question, you generally have a sense that this will follow a couple of processes where it's like.\n\n[Pukka Tackie] 09:22:43\nClient will already have this or not. I need to engage with the research vendor or not. Those are questions that you're going to ask.\n\n[Pukka Tackie] 09:22:50\nUsually we'll have like a a pre-week before like the project actually starts. And that's where you kind of like start to gather all of this information before you get into the project.\n\n[Dulaney, Stephen] 09:23:01\nNow, what do you do with all that information? How do you manage those assets? How do you store them? How much time does it take?\n\n[Pukka Tackie] 09:23:06\nIt takes a lot of time, honestly. So it's like, depending on who you're working with, usually it would be like teams.\n\n[Pukka Tackie] 09:23:14\nIf you're working on like a Google project, it will be, you know, because they use like google storage pieces, but gather a whole bunch Sometimes we work with client laptops. So then it's like they'll put all their information on there like\n\n[Pukka Tackie] 09:23:29\nDrive on the client, you know, it depends on who it is.\n\n[Pukka Tackie] 09:23:33\nI was introduced to this tool, I can't remember what it was, but it's like a tool as part of like psychic where you can put like a whole bunch of documents in. This was at the firm. I think it was in testing.\n\n[Pukka Tackie] 09:23:44\nAnd then like it will spit out summaries For you, we did not get it in time. So we had a very manual process of Let's put single files in Sidekick and then just see what the summaries are.\n\n[Dulaney, Stephen] 09:23:47\nOkay.\n\n[Pukka Tackie] 09:23:57\nSo that's kind of how we've been doing. I've been doing it right now.\n\n[Dulaney, Stephen] 09:23:58\nOkay. So let me ask you, are there any kind of activities that you know you're going to anchor your project around like beginning in the project with the client, end of the client, and then you have gaps in between that are\n\n[Dulaney, Stephen] 09:24:11\nEither going to be, you're going to talk to the customer somehow One of the ones you know about and then tell me about how you decide to fill in the gaps with what types of research activities.\n\n[Pukka Tackie] 09:24:14\nYeah, I think…\n\n[Pukka Tackie] 09:24:22\nOkay, I think I'm going to try to answer this question the way I understand it. So activities that would always be the case is You're always going to do some kind of like current state document synthesis, which is like\n\n[Pukka Tackie] 09:24:34\nWhat does the client already have? From in terms of like what we're trying to answer from this research study, we need to synthesize what that is.\n\n[Pukka Tackie] 09:24:43\nSo there's always going to be that. There's always going to be like some kind of synthesis document that would be come out of there would be like research plan that you're going to have to share with them to say, we're going to talk to this number of people. These are the questions that we're going to be asking. This is the time that we're going to amount of time that this research is going to take.\n\n[Pukka Tackie] 09:25:06\nBased on like individual or a lot, sorry, individual or like the entire group. We'll talk about if there's going to be like one-on-one sessions or it's going to be focus groups or intercepts. Like we'll talk about the versions of what research will look like\n\n[Pukka Tackie] 09:25:23\nAnd then, so those pieces are always going to be the case. There's always going to be some kind of synthesis process Both doing debriefs after each session, depending on like if clients really like engage with that piece.\n\n[Pukka Tackie] 09:25:37\nAnd also like big synthesis. We've got all the information. This is how we're synthesizing it into a document.\n\n[Pukka Tackie] 09:25:43\nThere's also going to be another workshop, which is kind of based on Okay, this is what we've learned. How do we make this relevant to to you. So whether it's products, whether it's like service design whatever it is, we'll have some conversation like that. Also usually with stakeholders and then just not that the immediate client group\n\n[Pukka Tackie] 09:26:04\nAnd then there's always going to be like some kind of readout. So then that would usually be the process.\n\n[Pukka Tackie] 09:26:10\nResearch plan. Debrief synthesis workshop and then read out. Those would always be like the anchoring pieces. And then the gaps you feel really is context like what's relevant here? How are we sharpening the question? How are we making the storytelling relevant to the people who need to see this?\n\n[Pukka Tackie] 09:26:29\nWhat are we finding that's new or different? Even if we don't find new things, how do we tell the story differently so then it connects, it helps.\n\n[Pukka Tackie] 09:26:39\nThe different stakeholder groups that need to kind of see this work. How do we make sure we have alignment from the right kinds of groups? So it's all context building and making it relevant. That's the piece that usually the project is about.\n\n[Dulaney, Stephen] 09:26:50\nSo in that process, are there any pain points or pitfalls that you can describe that need to be worked on.\n\n[Pukka Tackie] 09:27:03\nTrying to think about the way to respond to this. I think it's always… And I think this is specific to consulting or maybe like in an agency space as well. You're always kind of pressed for time.\n\n[Pukka Tackie] 09:27:21\nSo the ideal state of doing qualitative research is that you really get synthesis of research that is relevant, interesting, or creates the environment for you to have like sparks of\n\n[Pukka Tackie] 09:27:42\nCreates sparks of sparks like interesting relevant information to the client. That's usually hard to get to.\n\n[Pukka Tackie] 09:27:51\nLike there's always this running joke that you never get to insight level. It's always like research findings because it's like.\n\n[Pukka Tackie] 09:27:57\nTo look across a thing, find patterns, find what's new Right now, there's so much information all the time And so it's being pressed for time.\n\n[Dulaney, Stephen] 09:28:07\nOkay. So if you had a digital research and interview assistant, what are some of the features you might want to do?\n\n[Pukka Tackie] 09:28:08\nSo I think the key\n\n[Pukka Tackie] 09:28:13\nI think it would be like quicker synthesis of like current state quicker synthesis of research findings, so like qualitative research. And then it's like, I would be curious if there is an advanced way of like, how do I get prompts\n\n[Pukka Tackie] 09:28:33\nTo read or think differently about different kinds of questions or what we're seeing. So like, how do I see different kinds of patterns that we haven't considered before?\n\n[Pukka Tackie] 09:28:43\nThat would be what's interesting. So if I can put into it These are my research objectives. This is what we found from research.\n\n[Pukka Tackie] 09:28:52\nWhat kinds of insights are you learning that's not like just generic or like how do we think about this differently? I think that would be the interesting relevant way to think about that. And then also like help in creating and we have so many\n\n[Pukka Tackie] 09:29:11\nReferences and like templates of things. But then like, if I can just have like a template of the thing that I'm going to build built out that's like client context specific, that would be amazing.\n\n[Pukka Tackie] 09:29:24\nTo like make things move faster.\n\n[Dulaney, Stephen] 09:29:25\nI'm going to show you one screen in one minute because we're out of time. Usually we would go into And then hopefully it will intrigue you to come back for Where's my share button?\n\n[Dulaney, Stephen] 09:29:40\nI don't even see where the share is. How'd it go there to the green one?\n\n[Dulaney, Stephen] 09:29:47\nOkay, so are you seeing the screen? Okay, so this is an interview from Kinza, same type I did here. And I put in this Eureka opportunity mapper and I'm going to hit the button to go.\n\n[Pukka Tackie] 09:29:51\nYes.\n\n[Dulaney, Stephen] 09:30:00\nAnd it's going to read through. These are kind of AI tools we're working on.\n\n[Dulaney, Stephen] 09:30:04\nI'd like your help to kind of validate And… And would this be something that would speed up your research? I mean, also we got to check for hallucinations. So based on this team onboarding, planning, discovery, setup, participant recruiting, interviews.\n\n[Dulaney, Stephen] 09:30:26\nSo these are a suite of discovery tools that we would You're helping kind of validating.\n\n[Pukka Tackie] 09:30:29\nHmm.\n\n[Dulaney, Stephen] 09:30:31\nAt improving and enhancing, they need to have like documents, reference documents from Deloitte or whatever how to's as a basis And they go through and they go through And come up. So I've used all your time today. Thank you for joining me.\n\n[Pukka Tackie] 09:30:39\nMm-hmm.\n\n[Dulaney, Stephen] 09:30:48\nIn this interview, it was very helpful. I would love to show you more.\n\n[Pukka Tackie] 09:30:51\nYeah.\n\n[Dulaney, Stephen] 09:30:53\nBut that's what the 15 minutes we missed out on.\n\n[Pukka Tackie] 09:30:55\nOh, yeah. My week is wild, but maybe\n\n[Dulaney, Stephen] 09:30:59\nI know you're busy all the time, so I'm very grateful because, you know, I'll tell you one piece of insight. I'm in Ted's group, which is quantitative research.\n\n[Dulaney, Stephen] 09:31:07\nI've been doing this since 2000 with Hartman, industrial designer. And I really never have a research question in mind. I just have curiosity. Can we go?\n\n[Pukka Tackie] 09:31:08\nHmm.\n\n[Pukka Tackie] 09:31:13\nHmm.\n\n[Dulaney, Stephen] 09:31:18\nPeople, and we don't know what's going to find out. Whereas the researchers that I work with, like you have to have a research question. You start with a research question. And I'm just like.\n\n[Dulaney, Stephen] 09:31:28\nSo you guys start with a hypothesis, but it's more still open-ended Like I was taught.\n\n[Pukka Tackie] 09:31:34\nYeah, yeah.\n\n[Dulaney, Stephen] 09:31:35\nWhere you would just go into the wonder of discovery and your principles talk to real people, understand their needs.\n\n[Dulaney, Stephen] 09:31:40\nFigure out why. And so it's interesting in the difference of the type of Okay, sir.\n\n[Pukka Tackie] 09:31:41\nYeah. Yeah.\n\n[Pukka Tackie] 09:31:45\nYeah, but I think this is like what you just like what just got like spit out is interesting here. I think it would be, again, like with AI tools, which you probably already know this, but it's always like.\n\n[Dulaney, Stephen] 09:31:58\nYep, that's an accident. When you can actually come in here and do an ongoing edit session.\n\n[Pukka Tackie] 09:31:59\nSo much nuance can we get? How do I\n\n[Dulaney, Stephen] 09:32:07\nAnd say that.\n\n[Pukka Tackie] 09:32:11\nHmm.\n\n[Dulaney, Stephen] 09:32:13\nAnd it'll go through and drill in. So you can spend time talking to the, and you can put up to three transcripts. Now, I'm trying to build a tool that archives all of your interviews and it's like dovetail It takes this transcript. And then I think actually here's what I'm working on today. This is the\n\n[Pukka Tackie] 09:32:24\nThat would be…\n\n[Dulaney, Stephen] 09:32:28\nSemantic search for love. Quotes from an earlier interview. I don't have, you know, I've got bugs here because I don't have this showing up.\n\n[Pukka Tackie] 09:32:32\nHmm.\n\n[Dulaney, Stephen] 09:32:37\nBut this is the tool I'm working on. This is the DARIA, the research It has like all the different interviews chunked out.\n\n[Dulaney, Stephen] 09:32:46\nAnd that part it does, it'll generate based on a project, the UI's all breaks because every time I add a new feature, then you pick a model And it'll generate, well, it used to generate. And those are just kind of crude studies. And I don't know in the end if we're going to end up here and in\n\n[Pukka Tackie] 09:32:47\nHmm.\n\n[Dulaney, Stephen] 09:33:03\nAnd Sidekick with these where you can actually talk to Or if we're going to end up in a tool. Sidekick has a limitation of three interviews, whereas this would archive all of your interviews. And then it would also do the…\n\n[Pukka Tackie] 09:33:07\nHmm.\n\n[Dulaney, Stephen] 09:33:16\nThe semantic search where you could do, of course, I just broke it And that's the way you do the dovetail stuff. And I need to learn more about how you tag and what an interface would be like to take the Zoom transcript and how it would be useful to tag it and that kind of stuff. I need to drop too because that's Ted, my manager.\n\n[Dulaney, Stephen] 09:33:34\nWeekly meeting. But thank you so much. For participating and I'll reach out again. I hope I can get your help refining this these set of Okay, thanks so much.\n\n[Pukka Tackie] 09:33:36\nYeah, thank you too.\n\n[Pukka Tackie] 09:33:41\nYeah, please reach out. We'll try to make that happen. Thank you. Talk later.\n\n[Dulaney, Stephen] 09:34:01\nTad. Sorry, I was finishing up an interview.\n\n[Dulaney, Stephen] 09:34:07\nAll good. I was late because Steve Sektig and Nelson Kunkel are in the studio. Oh my goodness. Nelson, I haven't seen him in ages.\n\n[Dulaney, Stephen] 09:34:15\nHe got me started. I went into Nelson. I was in New York.\n\n[Dulaney, Stephen] 09:34:19\nLast November\n\n",
  "chunks": [
    {
      "text": " [Dulaney, Stephen] 08:58:48 Testing the transcript.  [Dulaney, Stephen] 09:03:19 Hello, how are you?  [Pukka Tackie] 09:03:22 Hello, I'm good. Sorry I'm late. She's jumping. Yeah, yeah.  [Dulaney, Stephen] 09:03:24 I'm going to turn off the washer real quick so that I don't have too much note.  [Dulaney, Stephen] 09:03:39 Hello, thank you for participating in my research study. I'm going to go kind of fast.  [Pukka Tackie] 09:03:42 Not a problem, yeah. We do 30, just a bunch of meetings popping up this week. So it's a little wild. Yeah.  [Dulaney, Stephen] 09:03:49 I understand. Anytime. I appreciate it. Do I have your permission to do a recording and keep a transcript?  [Pukka Tackie] 09:03:55 Yes, please do.  [Dulaney, Stephen] 09:03:56 Thank you. Starting. So will you please tell me a little bit about your background and what your current role is and how you ended up in user research?  [Pukka Tackie] 09:04:06 Okay. Current well My role is evolving at the firm, but I'll just kind of like speak to in the context of being a researcher. So within the applied design practice, I sort of started or my origin story has been an insights lead.  [Pukka Tackie] 09:04:23 So a lot of what that is is qualitative research using human-centered design sort of principles To have conversations with different kinds of users, pulling those kinds of insights.  [Pukka Tackie] 09:04:38 Where we kind of ask questions that get to the why. And then using that kind of shape either product, service, general strategy around how different clients are kind of like executing on those things. So that's the context of my role and sort of how I serve clients here at the firm.  [Dulaney, Stephen] 09:04:55 Okay, how did you get into this line of work? Did you have any mentors or influential Positions?  [Pukka Tackie] 09:05:03 Well, the origin story kind of came from college. I had a friend who was actually doing an internship program who came, who was telling me about human-centered design. And then so she had a bunch of books, a bunch of like courses, and then that sort of like created my, I just kind of followed that curiosity and that kind of landed me here.  [Pukka Tackie] 09:05:23 It was less of a purse. Well, I guess like, you know, it was from this friend, but it was less of like a mentor or someone who talked to me about it. It was more so I started to see the possibilities with having a human centered design lens. And I just wanted to be sort of plugged into that world. And so I was exploring the potential directions and options there. And that kind of landed me in the research um  [Pukka Tackie] 09:05:46 Realm of what that is. So that's kind of how I landed here.  [Dulaney, Stephen] 09:05:50 Sounds great. With respect to your role as Insights Lead, what is your primary goal?  [Pukka Tackie] 09:05:56 Hmm, primary goal is always through from… The research objectives that we have, we sort of agreed on it's digging into and asking the why. So getting into understanding motivations, needs, preferences.  [Pukka Tackie] 09:06:18 It's truly that why question, trying to understand the why behind reasoning for behaviors. And so regardless of what those objectives are, I think that's what that's that's what it serves in being a qualitative research. And then it's really advocating for that voice as we continue to shape  [Pukka Tackie] 09:06:39 What those insights are. So when it gets into the realm of product or the realm of service.  [Pukka Tackie] 09:06:45 Whether it's like a marketing sort of like initiative, it's really advocating for the voice of the user. So that's sort of like the goal that I'm usually thinking of when I'm talking to people.  [Dulaney, Stephen] 09:06:57 Are there any key frustrations that you encounter when pursuing your primary goal?  [Pukka Tackie] 09:07:03 Um… Yes, I guess like that's you know how we can talk about frustrations it's across I guess like different categories. So there's a process piece Where it's like, depending on the type of project, how long it's scoped out for and such.  [Pukka Tackie] 09:07:23 There are key parts of the process that can be challenging. So it's like, if you're going to be doing, if you have a very targeted sort of audience that you're getting into. Recruiting can be a very challenging process.  [Pukka Tackie] 09:07:35 And that usually is a piece like challenges from a research like a qualitative research project can start because it's getting the right folks and talking to the right folks, especially if it's finding customers in the wild. So if it's not like  [Pukka Tackie] 09:07:50 A specific group of people that are already sort of like existing that you can just kind of pull from from the data set or like focus group or something like so that already exists.  [Pukka Tackie] 09:08:00 So recruits are usually difficult. I think within having conversations with folks as well, it's sort of like figuring out the skill of like pivoting, expanding how you think about questions and such based on your objectives to make sure that you're actually pulling insights that are relevant or getting conversations that are relevant.  [Pukka Tackie] 09:08:22 And then there is like data processing, which is also like a process piece, which is like, I have all these quotes and all these different things.  [Pukka Tackie] 09:08:31 How do we kind of make sure that piece, you know, we're able to synthesize those into something that's useful. So I think process pieces are one. And then there's a second piece too, which is For qualitative research, you're always trying to advocate for the process.  [Pukka Tackie] 09:08:48 And so it's especially here at the firm where we work primarily with clients kind of doing these kinds of things, it's making sure everyone's kind of on the same page, the process makes sense when you have multiple stakeholders trying to get them through the process as well and not kind of tamper with like.  [Pukka Tackie] 09:09:05 Especially because it's generative research. It comes from grounded theory research where it's like, let's figure out what we're learning, then we'll figure out how it kind of lands with different kinds of perspectives that can be challenging for people to understand.  [Pukka Tackie] 09:09:20 There's a process piece which is like. Tools to kind of make everything move faster. And then there's a piece where it's like wrangling stakeholders to make sure that the process happens the way it should also.  [Pukka Tackie] 09:09:34 So I hope what I'm saying makes sense, but  [Dulaney, Stephen] 09:09:35 Yeah, it does. And everything you say makes sense because you know the kind of work I'm doing. So I'd like you to think back about your first type research activities. What kind of tools and what kind of process, how did you approach your research studies when you just got started?  [Pukka Tackie] 09:09:48 Oh, God. That is a while back.  [Pukka Tackie] 09:09:55 I was pretty… I would say it was like cobbling together different tools, but it was pretty manual, which there's always an element of that when it comes to qualitative research.  [Pukka Tackie] 09:10:10 But when I think back. I think we were trying to do like a traditional journey map so what happened was we used like a survey monkey to do the recruit So that was sort of like the tool for recruiting. Then we did  [Pukka Tackie] 09:10:33 What else? But we had a data set for like people to target and then that was helpful. So it's like we sent the the survey link for which is like a screener to a whole bunch of folks and then that, so that kind of helped with the targeting or the recruit. But it's sort of like the manual process of like.  [Pukka Tackie] 09:10:52 I need to see all the responses that are coming in. Then I have to kind of like use a checklist, look at the responses, tick off who I want to follow up with.  [Pukka Tackie] 09:11:03 Then send them an email. Hopefully get a response.  [Pukka Tackie] 09:11:09 So then the manual process there was like, you need to pay attention to like responses that are coming through. You need to sift through those responses. You need to reach out to people. You need to monitor for people to reach back out. I remember I started like texting people because we weren't getting responses through email.  [Pukka Tackie] 09:11:25 It was wild. But there was that piece. And then it's like you get the interviews.  [Pukka Tackie] 09:11:31 Then we just used Zoom for the interviews. Got the transcript from Zoom, if I remember correctly, but then it was the process of like, man, now we have to go back, which is like always a manual process.  [Pukka Tackie] 09:11:45 Go back, look at the quotes. Pull out relevant quotes to use to build this journey.  [Pukka Tackie] 09:11:54 Right now, I haven't done a journey map in a long time and to the point where my role is changing, how research is done right now, because I'm usually like managing people who are doing Yeah.  [Dulaney, Stephen] 09:12:01 So that's the next question I'm going to interrupt you. How do you do that same research project today?  [Pukka Tackie] 09:12:07 Oh, yeah. So now I think there are interesting tools that can be used.  [Pukka Tackie] 09:12:12 I'm blanking out on the tool that we use right now.  [Dulaney, Stephen] 09:12:16 That's okay. It'll come to you.  [Pukka Tackie] 09:12:19 Yeah, I'll just keep talking. It'll probably come. But we like dovetail. There we go. So then… dovetail or when we used to have this contract with like descout and such, sometimes you can do your research studies in there and what happens is like when you're done with the interview, you get the automatic transcript.  [Pukka Tackie] 09:12:38 Some of the research vendors that we use here as well have capabilities like so where it's like you do an interview within You do a certain kind of interview or an interview within a platform that's like homegrown for them or something, then you get the automatic  [Pukka Tackie] 09:12:56 Transcripts when you're going through, you can like snip, you can get the quotes like in there, like within their platform and then you pull out what you need.  [Pukka Tackie] 09:13:05 Right now, we still kind of depend on mural, mural, depending on like how you like to work. I've always used that tool. So in terms of evolution, I've always used a whiteboarding tool to kind of like put everything, like see everything, synthesize  [Pukka Tackie] 09:13:20 But how it's faster now is like transcription Trying to pull quotes and such.  [Pukka Tackie] 09:13:28 That kind of technology I feel like has evolved and then that moves faster um I've used versions of that like, you know, throughout the genesis of my research career up until now but So that's how it's kind of evolved and like relying on ai and such  [Pukka Tackie] 09:13:45 I think… how those tools have evolved too has been Especially when you're doing global research too. So then when you have to transcribe from a different language As well, getting the quotes.  [Pukka Tackie] 09:13:59 Getting the stories and such, getting like the, what's that thing called When you can like voice overlay to get like transcribed voices so you can listen to the interview and then like You can pull from there and such. I think AI is sort of like supported and helped throughout those pieces and  [Dulaney, Stephen] 09:14:17 How have the deliverables changed? You mentioned that you used to do journey maps. Did you also do personas?  [Pukka Tackie] 09:14:22 Yes, personas. Some people still kind of like personas. I think it depends.  [Dulaney, Stephen] 09:14:23 Now, what do you do today?  [Pukka Tackie] 09:14:31 I think right now when you have a persona Before people used to use personas as like specific targeting for like a product or marketing and such. I think it's evolved more to storytell, only storytell Or if people have personas it's like  [Pukka Tackie] 09:14:49 They want to create the static version that you probably would get from qual and then they want to put it into their data source that they can continuously evolve from like data they learn about folks through different kinds of research methods. So whether it's like you have like social sensing or you have other kinds of  [Pukka Tackie] 09:15:06 Tools where you get like an inflow of data that helps you kind of involve like how your personas are.  [Dulaney, Stephen] 09:15:11 You're seeing an evolving persona that, because I look at personas, this gives you a focus They can't do it for everyone, so this presumably is a good focus and empathy.  [Pukka Tackie] 09:15:12 So.  [Pukka Tackie] 09:15:21 Yeah, yeah, yeah. So I think that's that's still the case. It's just You want to continuously get crisp about how you understand users and how you understand who you're targeting across whatever the goal is.  [Pukka Tackie] 09:15:36 So it serves as a good starting point. That you can continue to see obviously the structure of the persona will stay the same.  [Pukka Tackie] 09:15:46 But it's like, how do we continue to learn more about this particular audience or this particular user group and such?  [Dulaney, Stephen] 09:15:52 What about the role of the journey map in storytelling? Is it still used or not so much?  [Pukka Tackie] 09:15:59 I think in product roadmaps, it always has a always has a utility. But again, it's How I've seen it used recently like i've seen it recently is like probably more so like future state as opposed to current state. I think people are less interested in current state and more interested in future state. Or honestly, when we have clients who want future state journey maps, we're like, no, it's not going to be useful.  [Pukka Tackie] 09:16:28 So do a future state one. So that helps to spark conversations amongst different stakeholders, which is always a challenge within any type of organization.  [Pukka Tackie] 09:16:39 So then there's that piece. But then there's also again that context of can you kind of build your journey map in a way where you can create openings, even if there was a static document for like an influx of  [Pukka Tackie] 09:16:55 Like data. So what that means is, for example, if we build a journey map that says you're going to have a new feature that is like a ticketing profile to do something random um How are we, can you kind of like  [Pukka Tackie] 09:17:12 Come mess around with the journey map to say like, okay, if it's ticketing profile, but then this is how the feature comes to life for this particular archetype in your journey map.  [Pukka Tackie] 09:17:21 That will be useful for products, will be useful for engineering, will be useful for like a UX person, like multiple different people. I think the goal right now is like some of these artifacts are relevant. It's just like, how do you sort of create them in a way that they can keep evolving?  [Pukka Tackie] 09:17:37 That's always been the story of the story a lot of these artifacts, but I think it's become more incessantly relevant now to have like ways in which data can kind of evolve when it comes to  [Dulaney, Stephen] 09:17:52 What steps do you go from your insights and your artifacts to creating new software ideas.  [Pukka Tackie] 09:18:01 Um… I think it's, so you get the insights you synthesize them and storytell around them depending on what kind of story you're trying to tell.  [Pukka Tackie] 09:18:15 And then it's like I think that part is the big co-creation piece where you're always going to have some type of like workshop or working session with a client.  [Pukka Tackie] 09:18:26 And then figuring out what are the journey steps that make sense kind of from history for this type of client.  [Pukka Tackie] 09:18:32 How do we kind of make that make sense? So it's like a think about it as like a workshop session. We'll come, we'll like play with different kinds of things.  [Dulaney, Stephen] 09:18:39 What is the output or the goal at the end of the workshop?  [Pukka Tackie] 09:18:42 The output of the workshop is to get alignment usually on This is the insights that we have.  [Pukka Tackie] 09:18:50 In terms of what we want to create for an artifact are these pieces beginning to make sense?  [Pukka Tackie] 09:18:56 Also, like Stephen, this is like a series of conversations. So it's not like just one workshop you're usually having. You'll probably have one working session, which is like.  [Pukka Tackie] 09:19:05 Hey, this is what we learned. And then you have people have additional insights from what's happened in the past.  [Pukka Tackie] 09:19:12 You'll boost that up with your knowledge. Second conversation is okay. From what we've learned from these insights.  [Pukka Tackie] 09:19:18 If we're going to make a journey map, let's call it that. These are the stages. This is how it's kind of coming to life.  [Pukka Tackie] 09:19:24 People will start to react with that. Then you evolve that piece.  [Pukka Tackie] 09:19:28 If it's going to be like… Say that again.  [Dulaney, Stephen] 09:19:28 And how do you convert that into like design? How do you convert that into design?  [Pukka Tackie] 09:19:35 I think it's less of a science than a, it's more of an art than a science. So it's I think you pick usually it's anchored by like what are the design principles and that's kind of you pull that from insights.  [Pukka Tackie] 09:19:48 On like what the patterns or themes are. It's like, okay, these are our design principles. So go build a screen or something like so based on these design principles. So that's usually the anchor.  [Pukka Tackie] 09:20:01 And I think we had work similar. Yeah, in our work, I think we had some of those  [Dulaney, Stephen] 09:20:07 We did. I'm fascinated because I've seen the final deliverable and I see like the ambition statement, the design principles, the personas.  [Dulaney, Stephen] 09:20:14 The journeyman the wireframes For me, I take the, in the old days, the journey maps and then that workshop we come up with opportunities And the opportunities become the opportunities become epics and user stories in Agile.  [Pukka Tackie] 09:20:26 Yeah. I think that's still consistent it's just I think how the structure of the process really depends on multiple factors like time, all of those different pieces. Sometimes it's like we end up with how might we questions and we don't have clear like  [Dulaney, Stephen] 09:20:27 And then the designs follow. But that's just my process. But I'm learning.  [Pukka Tackie] 09:20:47 Opportunities, but then as you're you're building sort of like based on that anchor of like, these are how might we questions that we're kind of curious about so  [Dulaney, Stephen] 09:20:55 So when you start with a research project or a discovery project, how do you come up with like the discovery plan of activities? Say it's an eight week project.  [Dulaney, Stephen] 09:21:04 What questions do you ask? What inputs are you looking for from the client from the pitch deck? Or what do you start with to create a discovery plan?  [Pukka Tackie] 09:21:10 Yeah. Yeah. I want to know. I want to know what they know already. I want to know what kinds of questions they are interested in answering or sort of like what are the overarching sort of like business objectives that we have here  [Pukka Tackie] 09:21:27 Then it's like, what else do we know about this particular like target archetypes or groups what already exists, then it's like, okay, what are our hypothesis questions, which we will usually build or include and say like Okay, from all of the things that you've said, these are the kinds of hypotheses that we have. Then we structure research objectives. Then it's the  [Pukka Tackie] 09:21:50 Screener questions and so and so. But then there are other logistic pieces where it's like, okay, based on this particular user group, do we already have an existing group we can pull from data or are we kind of going into the wild? Do we need to work with a research vendor? Those are the kinds of like logistical questions.  [Pukka Tackie] 09:22:07 But like foundationally, it's like, what do we already know? What are we trying to learn?  [Pukka Tackie] 09:22:13 And how do we just make that as crisp as possible so we can get outcomes that we're looking for?  [Dulaney, Stephen] 09:22:19 So going into a project, you kind of know ahead of time from past projects your framework of what activities and when you're going to run them as far as the swim lanes in a Gantt chart.  [Pukka Tackie] 09:22:31 I do not use a Gantt chart. In terms of like process, but to the general question, you generally have a sense that this will follow a couple of processes where it's like.  [Pukka Tackie] 09:22:43 Client will already have this or not. I need to engage with the research vendor or not. Those are questions that you're going to ask.  [Pukka Tackie] 09:22:50 Usually we'll have like a a pre-week before like the project actually starts. And that's where you kind of like start to gather all of this information before you get into the project.  [Dulaney, Stephen] 09:23:01 Now, what do you do with all that information? How do you manage those assets? How do you store them? How much time does it take?  [Pukka Tackie] 09:23:06 It takes a lot of time, honestly. So it's like, depending on who you're working with, usually it would be like teams.  [Pukka Tackie] 09:23:14 If you're working on like a Google project, it will be, you know, because they use like google storage pieces, but gather a whole bunch Sometimes we work with client laptops. So then it's like they'll put all their information on there like  [Pukka Tackie] 09:23:29 Drive on the client, you know, it depends on who it is.  [Pukka Tackie] 09:23:33 I was introduced to this tool, I can't remember what it was, but it's like a tool as part of like psychic where you can put like a whole bunch of documents in. This was at the firm. I think it was in testing.  [Pukka Tackie] 09:23:44 And then like it will spit out summaries For you, we did not get it in time. So we had a very manual process of Let's put single files in Sidekick and then just see what the summaries are.  [Dulaney, Stephen] 09:23:47 Okay.  [Pukka Tackie] 09:23:57 So that's kind of how we've been doing. I've been doing it right now.  [Dulaney, Stephen] 09:23:58 Okay. So let me ask you, are there any kind of activities that you know you're going to anchor your project around like beginning in the project with the client, end of the client, and then you have gaps in between that are  [Dulaney, Stephen] 09:24:11 Either going to be, you're going to talk to the customer somehow One of the ones you know about and then tell me about how you decide to fill in the gaps with what types of research activities.  [Pukka Tackie] 09:24:14 Yeah, I think…  [Pukka Tackie] 09:24:22 Okay, I think I'm going to try to answer this question the way I understand it. So activities that would always be the case is You're always going to do some kind of like current state document synthesis, which is like  [Pukka Tackie] 09:24:34 What does the client already have? From in terms of like what we're trying to answer from this research study, we need to synthesize what that is.  [Pukka Tackie] 09:24:43 So there's always going to be that. There's always going to be like some kind of synthesis document that would be come out of there would be like research plan that you're going to have to share with them to say, we're going to talk to this number of people. These are the questions that we're going to be asking. This is the time that we're going to amount of time that this research is going to take.  [Pukka Tackie] 09:25:06 Based on like individual or a lot, sorry, individual or like the entire group. We'll talk about if there's going to be like one-on-one sessions or it's going to be focus groups or intercepts. Like we'll talk about the versions of what research will look like  [Pukka Tackie] 09:25:23 And then, so those pieces are always going to be the case. There's always going to be some kind of synthesis process Both doing debriefs after each session, depending on like if clients really like engage with that piece.  [Pukka Tackie] 09:25:37 And also like big synthesis. We've got all the information. This is how we're synthesizing it into a document.  [Pukka Tackie] 09:25:43 There's also going to be another workshop, which is kind of based on Okay, this is what we've learned. How do we make this relevant to to you. So whether it's products, whether it's like service design whatever it is, we'll have some conversation like that. Also usually with stakeholders and then just not that the immediate client group  [Pukka Tackie] 09:26:04 And then there's always going to be like some kind of readout. So then that would usually be the process.  [Pukka Tackie] 09:26:10 Research plan. Debrief synthesis workshop and then read out. Those would always be like the anchoring pieces. And then the gaps you feel really is context like what's relevant here? How are we sharpening the question? How are we making the storytelling relevant to the people who need to see this?  [Pukka Tackie] 09:26:29 What are we finding that's new or different? Even if we don't find new things, how do we tell the story differently so then it connects, it helps.  [Pukka Tackie] 09:26:39 The different stakeholder groups that need to kind of see this work. How do we make sure we have alignment from the right kinds of groups? So it's all context building and making it relevant. That's the piece that usually the project is about.  [Dulaney, Stephen] 09:26:50 So in that process, are there any pain points or pitfalls that you can describe that need to be worked on.  [Pukka Tackie] 09:27:03 Trying to think about the way to respond to this. I think it's always… And I think this is specific to consulting or maybe like in an agency space as well. You're always kind of pressed for time.  [Pukka Tackie] 09:27:21 So the ideal state of doing qualitative research is that you really get synthesis of research that is relevant, interesting, or creates the environment for you to have like sparks of  [Pukka Tackie] 09:27:42 Creates sparks of sparks like interesting relevant information to the client. That's usually hard to get to.  [Pukka Tackie] 09:27:51 Like there's always this running joke that you never get to insight level. It's always like research findings because it's like.  [Pukka Tackie] 09:27:57 To look across a thing, find patterns, find what's new Right now, there's so much information all the time And so it's being pressed for time.  [Dulaney, Stephen] 09:28:07 Okay. So if you had a digital research and interview assistant, what are some of the features you might want to do?  [Pukka Tackie] 09:28:08 So I think the key  [Pukka Tackie] 09:28:13 I think it would be like quicker synthesis of like current state quicker synthesis of research findings, so like qualitative research. And then it's like, I would be curious if there is an advanced way of like, how do I get prompts  [Pukka Tackie] 09:28:33 To read or think differently about different kinds of questions or what we're seeing. So like, how do I see different kinds of patterns that we haven't considered before?  [Pukka Tackie] 09:28:43 That would be what's interesting. So if I can put into it These are my research objectives. This is what we found from research.  [Pukka Tackie] 09:28:52 What kinds of insights are you learning that's not like just generic or like how do we think about this differently? I think that would be the interesting relevant way to think about that. And then also like help in creating and we have so many  [Pukka Tackie] 09:29:11 References and like templates of things. But then like, if I can just have like a template of the thing that I'm going to build built out that's like client context specific, that would be amazing.  [Pukka Tackie] 09:29:24 To like make things move faster.  [Dulaney, Stephen] 09:29:25 I'm going to show you one screen in one minute because we're out of time. Usually we would go into And then hopefully it will intrigue you to come back for Where's my share button?  [Dulaney, Stephen] 09:29:40 I don't even see where the share is. How'd it go there to the green one?  [Dulaney, Stephen] 09:29:47 Okay, so are you seeing the screen? Okay, so this is an interview from Kinza, same type I did here. And I put in this Eureka opportunity mapper and I'm going to hit the button to go.  [Pukka Tackie] 09:29:51 Yes.  [Dulaney, Stephen] 09:30:00 And it's going to read through. These are kind of AI tools we're working on.  [Dulaney, Stephen] 09:30:04 I'd like your help to kind of validate And… And would this be something that would speed up your research? I mean, also we got to check for hallucinations. So based on this team onboarding, planning, discovery, setup, participant recruiting, interviews.  [Dulaney, Stephen] 09:30:26 So these are a suite of discovery tools that we would You're helping kind of validating.  [Pukka Tackie] 09:30:29 Hmm.  [Dulaney, Stephen] 09:30:31 At improving and enhancing, they need to have like documents, reference documents from Deloitte or whatever how to's as a basis And they go through and they go through And come up. So I've used all your time today. Thank you for joining me.  [Pukka Tackie] 09:30:39 Mm-hmm.  [Dulaney, Stephen] 09:30:48 In this interview, it was very helpful. I would love to show you more.  [Pukka Tackie] 09:30:51 Yeah.  [Dulaney, Stephen] 09:30:53 But that's what the 15 minutes we missed out on.  [Pukka Tackie] 09:30:55 Oh, yeah. My week is wild, but maybe  [Dulaney, Stephen] 09:30:59 I know you're busy all the time, so I'm very grateful because, you know, I'll tell you one piece of insight. I'm in Ted's group, which is quantitative research.  [Dulaney, Stephen] 09:31:07 I've been doing this since 2000 with Hartman, industrial designer. And I really never have a research question in mind. I just have curiosity. Can we go?  [Pukka Tackie] 09:31:08 Hmm.  [Pukka Tackie] 09:31:13 Hmm.  [Dulaney, Stephen] 09:31:18 People, and we don't know what's going to find out. Whereas the researchers that I work with, like you have to have a research question. You start with a research question. And I'm just like.  [Dulaney, Stephen] 09:31:28 So you guys start with a hypothesis, but it's more still open-ended Like I was taught.  [Pukka Tackie] 09:31:34 Yeah, yeah.  [Dulaney, Stephen] 09:31:35 Where you would just go into the wonder of discovery and your principles talk to real people, understand their needs.  [Dulaney, Stephen] 09:31:40 Figure out why. And so it's interesting in the difference of the type of Okay, sir.  [Pukka Tackie] 09:31:41 Yeah. Yeah.  [Pukka Tackie] 09:31:45 Yeah, but I think this is like what you just like what just got like spit out is interesting here. I think it would be, again, like with AI tools, which you probably already know this, but it's always like.  [Dulaney, Stephen] 09:31:58 Yep, that's an accident. When you can actually come in here and do an ongoing edit session.  [Pukka Tackie] 09:31:59 So much nuance can we get? How do I  [Dulaney, Stephen] 09:32:07 And say that.  [Pukka Tackie] 09:32:11 Hmm.  [Dulaney, Stephen] 09:32:13 And it'll go through and drill in. So you can spend time talking to the, and you can put up to three transcripts. Now, I'm trying to build a tool that archives all of your interviews and it's like dovetail It takes this transcript. And then I think actually here's what I'm working on today. This is the  [Pukka Tackie] 09:32:24 That would be…  [Dulaney, Stephen] 09:32:28 Semantic search for love. Quotes from an earlier interview. I don't have, you know, I've got bugs here because I don't have this showing up.  [Pukka Tackie] 09:32:32 Hmm.  [Dulaney, Stephen] 09:32:37 But this is the tool I'm working on. This is the DARIA, the research It has like all the different interviews chunked out.  [Dulaney, Stephen] 09:32:46 And that part it does, it'll generate based on a project, the UI's all breaks because every time I add a new feature, then you pick a model And it'll generate, well, it used to generate. And those are just kind of crude studies. And I don't know in the end if we're going to end up here and in  [Pukka Tackie] 09:32:47 Hmm.  [Dulaney, Stephen] 09:33:03 And Sidekick with these where you can actually talk to Or if we're going to end up in a tool. Sidekick has a limitation of three interviews, whereas this would archive all of your interviews. And then it would also do the…  [Pukka Tackie] 09:33:07 Hmm.  [Dulaney, Stephen] 09:33:16 The semantic search where you could do, of course, I just broke it And that's the way you do the dovetail stuff. And I need to learn more about how you tag and what an interface would be like to take the Zoom transcript and how it would be useful to tag it and that kind of stuff. I need to drop too because that's Ted, my manager.  [Dulaney, Stephen] 09:33:34 Weekly meeting. But thank you so much. For participating and I'll reach out again. I hope I can get your help refining this these set of Okay, thanks so much.  [Pukka Tackie] 09:33:36 Yeah, thank you too.  [Pukka Tackie] 09:33:41 Yeah, please reach out. We'll try to make that happen. Thank you. Talk later.  [Dulaney, Stephen] 09:34:01 Tad. Sorry, I was finishing up an interview.  [Dulaney, Stephen] 09:34:07 All good. I was late because Steve Sektig and Nelson Kunkel are in the studio. Oh my goodness. Nelson, I haven't seen him in ages.  [Dulaney, Stephen] 09:34:15 He got me started. I went into Nelson. I was in New York.  [Dulaney, Stephen] 09:34:19 Last November  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Pukka Tackie",
      "age": "25-34",
      "gender": "female",
      "location": "Chicago",
      "occupation": "Researcher",
      "industry": "Consulting",
      "experience": "9",
      "education": "masters"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  }
}