{
  "id": "7e25fc84-82c6-4d95-9e7d-204482a28927",
  "transcript_name": "Ted's UXR Interview",
  "project_name": "Daria Research of Researchers",
  "interview_type": "Persona Interview",
  "project_description": "We are researching how user researchers conduct discovery activities and plan for user research, from awareness and identifying research questions to research design, execution, analysis, and delivery.",
  "date": "2025-04-23T10:20:20.717417",
  "transcript": "[Dulaney, Stephen] 08:00:56\nTesting the transcript.\n\n[Stark, Theodore (Ted)] 08:02:04\nMorning, Stephen. How are you?\n\n[Dulaney, Stephen] 08:02:05\nMorning, how are you? Good, good. Thank you for joining today. Do I have your permission to do a transcript and a recording?\n\n[Dulaney, Stephen] 08:02:14\nSounds great. And I'm fine.\n\n[Stark, Theodore (Ted)] 08:02:14\nYep.\n\n[Dulaney, Stephen] 08:02:20\nThat's no problem. So Ted, tell me a little bit about your background as a user researcher. How did you get into this line of work?\n\n[Stark, Theodore (Ted)] 08:02:33\nThat started in school. I hung out with more professors than I did with kids my own age.\n\n[Stark, Theodore (Ted)] 08:02:41\nAnd so because I hung around the professors i kind of got dragged into helping them out with studies.\n\n[Stark, Theodore (Ted)] 08:02:51\nAnd that kind of began the journey of me really focused more on research than on design.\n\n[Stark, Theodore (Ted)] 08:03:02\nSo I don't know that I ever kind of made a pivot. I've always been on the research and the science side of the spectrum.\n\n[Dulaney, Stephen] 08:03:09\nNow, what school was this and there were any specific mentors that formed your research behavior today?\n\n[Stark, Theodore (Ted)] 08:03:15\nI mean, it's the University of Arizona. There's a handful of them.\n\n[Stark, Theodore (Ted)] 08:03:21\nBut I don't know how that's necessarily germane to this conversation.\n\n[Dulaney, Stephen] 08:03:26\nOkay. Tell me with respect to your current role, what is your primary goal?\n\n[Stark, Theodore (Ted)] 08:03:35\nContinuing to build out a research offering here at Deloitte.\n\n[Dulaney, Stephen] 08:03:41\nAnd with respect to the primary goal, what are some key frustrations that you encounter?\n\n[Stark, Theodore (Ted)] 08:03:47\nA lot of it is just lack of awareness that our research practice exists.\n\n[Stark, Theodore (Ted)] 08:03:56\nA lack of… people who aren't as far along on their path in either doing research or exploring research um just it's just it looks easier than it actually is.\n\n[Stark, Theodore (Ted)] 08:04:13\nUm so you know the trying to strike that balance both with projects as well as with practitioners in terms of knowing when they need to actually bring in an expert.\n\n[Stark, Theodore (Ted)] 08:04:28\nAnd far too often it's too late in the process. And it, you know, that's more just in terms of will get brought in or get asked to kind of help or take a look at something after data collection is already done.\n\n[Stark, Theodore (Ted)] 08:04:45\nAnd they're in the middle of doing analysis or reporting out their findings and You know, just trying to find a way to help them out as well as to give them a little bit of education in terms of If you're going to do this again next time, here's some\n\n[Stark, Theodore (Ted)] 08:05:02\nSome suggestions and a lot of that just comes with you know the the 20 years plus of experience that I have.\n\n[Dulaney, Stephen] 08:05:08\nOkay, that sounds great. So I want you to think back. When did you first arrive at Deloitte and what kind of, what was the state of the research and what were the activities that you performed during a discovery cycle?\n\n[Stark, Theodore (Ted)] 08:05:21\nAlmost 11 years ago, June 1st. And there really wasn't a research practice then.\n\n[Stark, Theodore (Ted)] 08:05:29\nThere was a bunch of bunch of designers that think that they can do research and some of them could for sure but A lot of when we're doing research really badly.\n\n[Stark, Theodore (Ted)] 08:05:42\nFrom an approach standpoint, from a policy standpoint, from a methodology standpoint, from a data collection standpoint.\n\n[Stark, Theodore (Ted)] 08:05:51\nAnd yeah, you know, so just slowly but surely trying to trying to change the way that you know we did research initially here in Denver.\n\n[Stark, Theodore (Ted)] 08:06:03\nUm you know now nationally and internationally. So I don't know if that really answers your question.\n\n[Dulaney, Stephen] 08:06:09\nOkay, so how is the state of the research today? How has it changed and what are your methods and tools that you have available that you didn't back then.\n\n[Stark, Theodore (Ted)] 08:06:21\nI mean, the methods are all the same. The tools change just based on change based on what's out there.\n\n[Stark, Theodore (Ted)] 08:06:31\nThe market has seen a considerable consolidation of online platforms and tools.\n\n[Stark, Theodore (Ted)] 08:06:38\nWith the 800 pound gorilla in the market being users and user testing.\n\n[Stark, Theodore (Ted)] 08:06:46\nUm but you know the the tools that we use will come and go.\n\n[Stark, Theodore (Ted)] 08:06:54\nBut the tool isn't the definition of doing research. It is a you know it is a mechanism to enable a researcher to actually collect data. That's all it is.\n\n[Stark, Theodore (Ted)] 08:07:07\nSo… you know the the state today is we are getting better at research we are putting We're trying to strike that balance between rigor and practicality, which you have to do in any type of industry research setting and even in academia.\n\n[Stark, Theodore (Ted)] 08:07:25\nAnd we're getting there. We're making some headway. But, you know, we've got a ways to go and The big thing for me in the last, I'd say, five years is really pushing to include even in heavily qualitative research.\n\n[Stark, Theodore (Ted)] 08:07:44\nYou still got to use statistics. You still got to use, you know, you can still bring in some quant.\n\n[Stark, Theodore (Ted)] 08:07:51\nAnd not just cherry pick whole quotes that maybe align with your, you know, with a researcher's bias.\n\n[Stark, Theodore (Ted)] 08:07:57\nConsciously or subconsciously. I hope.\n\n[Dulaney, Stephen] 08:07:59\nOkay, so what would you like to see in the next three years of how you're going to move and evolve the research efforts at Deloitte?\n\n[Stark, Theodore (Ted)] 08:08:08\nMore promotion, more operationalization, more scale.\n\n[Dulaney, Stephen] 08:08:14\nCan you tell me a story like that one you talked about?\n\n[Dulaney, Stephen] 08:08:18\nWhere you had a project that looked promising and then no matter how hard you tried, it became frustrating and just had more trouble than it should have.\n\n[Stark, Theodore (Ted)] 08:08:26\nI mean, all projects have challenges, right? Any research project is going to have curveballs thrown at you.\n\n[Stark, Theodore (Ted)] 08:08:33\nYou know, a researcher job is to adapt to the situation.\n\n[Stark, Theodore (Ted)] 08:08:41\nAnd given the constraints, find a way to still deliver you know insights, still deliver findings despite the curveballs.\n\n[Stark, Theodore (Ted)] 08:08:54\nUm and you know, I think a lot of that just comes with time You're going to have participants that cancel or you're going to have, you know, a prototype that doesn't work on a particular day. You're going to have\n\n[Stark, Theodore (Ted)] 08:09:07\nA slew of challenges. It's that adaptability. It's that you know realizing what that end goal is.\n\n[Stark, Theodore (Ted)] 08:09:19\nIn terms of what we're doing research to or we're doing a study to explore these research questions.\n\n[Stark, Theodore (Ted)] 08:09:27\nGiven some of the constraints that have been put in front of us, how do we still achieve that goal?\n\n[Dulaney, Stephen] 08:09:32\nI want you to think of a story that you tell to help spread a message about a past research project.\n\n[Stark, Theodore (Ted)] 08:09:38\nYeah, I don't use stories for that, Stephen.\n\n[Dulaney, Stephen] 08:09:40\nOkay, that sounds good. That's as good as the answers I needed. Okay, we're going to change task a little bit and I want to talk about like creating a discovery cycle and creating a research effort.\n\n[Dulaney, Stephen] 08:09:52\nHow do you go about what's when you have a new project in your awareness and it's maybe just in the, you know, just you just heard about it phase What are some of the activities you do to formalize that and convert it into a discovery project?\n\n[Stark, Theodore (Ted)] 08:10:05\nI mean, does it have to be discovery? Okay. I mean, step one is develop a research plan And the step one of that effort is working with project team to identify what the research questions are. Sometimes projects will come with a method that they want to use, but they don't actually know what the research questions are.\n\n[Dulaney, Stephen] 08:10:08\nNo, whatever you like.\n\n[Stark, Theodore (Ted)] 08:10:31\nAnd it's putting the cart before the horse.\n\n[Dulaney, Stephen] 08:10:34\nSo what techniques do you do to identify and solidify the research questions?\n\n[Stark, Theodore (Ted)] 08:10:39\nA lot of it is conversations with the account team. A lot of it is, you know, if we have access to them, the stakeholders.\n\n[Stark, Theodore (Ted)] 08:10:45\nAnd I don't expect either one of those archetypes to actually say, here's our research questions, go.\n\n[Stark, Theodore (Ted)] 08:10:53\nIt's more listening to the areas of whatever whatever ecosystem we're in.\n\n[Stark, Theodore (Ted)] 08:11:03\nWhat are they curious about what you know Are we trying to investigate or explore why we're seeing a drop off in the sales funnel? Whatever it is.\n\n[Stark, Theodore (Ted)] 08:11:16\nAnd based on those conversations, and it doesn't have to be long. You just have a quick conversation with some folks.\n\n[Stark, Theodore (Ted)] 08:11:24\nBegin to actually begin to actually formulate research questions.\n\n[Stark, Theodore (Ted)] 08:11:29\nAnd put those back in front of the accounting, put them back in front of the stakeholders.\n\n[Stark, Theodore (Ted)] 08:11:36\nBut you know, but a lot of people will try to do research without actually kind of having those questions in mind and it's just you know it's it's really hard to do good research without kind of that structure in place.\n\n[Dulaney, Stephen] 08:11:53\nOnce you have your research questions solidified, what is the next step to activating or planning the research initiative?\n\n[Stark, Theodore (Ted)] 08:11:59\nYeah, I mean, then you begin experimental design. So now that you have your research questions in place.\n\n[Stark, Theodore (Ted)] 08:12:08\nYou begin to formulate an approach as a researcher in terms of what what method or methods are you going to use? What metrics are you going to use?\n\n[Stark, Theodore (Ted)] 08:12:23\nWhat participant recruitment strategies are you going to use? And in that discussion, you know, further on down the road is what tools might we leverage in order to do this?\n\n[Stark, Theodore (Ted)] 08:12:36\nSo if we're doing remote unmoderated we'll need to think about what tools or platforms do we have access to.\n\n[Stark, Theodore (Ted)] 08:12:47\nWhat does the participant recruitment uh look like for that target population.\n\n[Stark, Theodore (Ted)] 08:12:54\nWhat does the stimuli look like? So the stimuli being a prototype.\n\n[Stark, Theodore (Ted)] 08:12:59\nOr a design or a design a navigational schema um and you know this this is where researchers actually do design. It's just not doing wireframes.\n\n[Stark, Theodore (Ted)] 08:13:15\nSo… You go through that process and the planning process, generally speaking, should probably twice as long as it's going to take as long as it's going for the time that you're actually doing data collection or you're in the field. So let's say if it's a week.\n\n[Stark, Theodore (Ted)] 08:13:31\nIn the field, you should probably plan two weeks for experimental design.\n\n[Stark, Theodore (Ted)] 08:13:36\nThe reason for that is you got to make sure that everything is in place. You got to make sure that your data collection methods are correct.\n\n[Stark, Theodore (Ted)] 08:13:43\nYou got to make sure that you know people are inherently unpredictable. So you've got to pilot during that phase as well.\n\n[Stark, Theodore (Ted)] 08:13:52\nWe've been able to compress the planning down in some cases.\n\n[Stark, Theodore (Ted)] 08:13:57\nBut you need time to actually plan a study. And most studies that are executed well are a direct result or a direct correlation to proper planning.\n\n[Dulaney, Stephen] 08:14:11\nOkay, that sounds great. So what… What is the next challenge after you have your research plan and you're ready to go to the field? What's your next challenge? Are there any between there?\n\n[Stark, Theodore (Ted)] 08:14:23\nI mean, recruitment is always going to be, I don't know that it's a challenge. It's just, it's something you got to deal with.\n\n[Stark, Theodore (Ted)] 08:14:30\nSo, you know, making sure that whatever recruitment partner you're working with.\n\n[Stark, Theodore (Ted)] 08:14:37\nMaking sure that you're getting quality participants coming through.\n\n[Stark, Theodore (Ted)] 08:14:44\nSo user testing, for example, has a well-deserved reputation of having a really.\n\n[Stark, Theodore (Ted)] 08:14:53\nPoorly cultivated pool of research participants. And it's because a lot of people are in their pool solely because they they're looking to earn some money.\n\n[Stark, Theodore (Ted)] 08:15:07\nThere's nothing wrong with that You know, one of the things that experienced researchers learn to do as part of their planning phase.\n\n[Stark, Theodore (Ted)] 08:15:18\nSpecifically around recruitment. Is a really, really solid screener.\n\n[Stark, Theodore (Ted)] 08:15:24\nAnd the approach that you take to writing a screener is going to vary based on how you're sourcing participants. For example.\n\n[Stark, Theodore (Ted)] 08:15:32\nAnd we don't do it at all here at Deloitte, but some companies use Amazon's Mechanical Turk.\n\n[Stark, Theodore (Ted)] 08:15:39\nIt's also really, really popular in academia. And you can get a lot of responses really, really quickly. But you got to have a really, really solid screener in place to ensure that the responses you're getting are of quality and also the people that you're getting are\n\n[Stark, Theodore (Ted)] 08:16:00\nFitting into some sort of recruit criteria so that the data that you collect is actually something that can be generalized to the overall user population.\n\n[Stark, Theodore (Ted)] 08:16:11\nIf you're doing a website redesign or app redesign for a senior living community.\n\n[Stark, Theodore (Ted)] 08:16:20\nDoing evaluative research with a bunch of 20-somethings. It's going to get you some data.\n\n[Stark, Theodore (Ted)] 08:16:26\nBut how representative that data is to the overall population comes into question.\n\n[Stark, Theodore (Ted)] 08:16:32\nSo, um. Always kind of making sure that you're keeping an eye at least, or you have somebody on your team that's keeping an eye on the responses that are coming in.\n\n[Stark, Theodore (Ted)] 08:16:44\nWhile the study is in flight. A lot of people who aren't as far along on their path with research will try to start doing synthesis and analysis of the recordings as they're coming in.\n\n[Stark, Theodore (Ted)] 08:16:59\nAnd, you know. There's a reason why we normally wait until we're done.\n\n[Stark, Theodore (Ted)] 08:17:07\nAnd some of that is you got to wait for your recruiting partner to make sure that you actually have enough responses that are representative.\n\n[Stark, Theodore (Ted)] 08:17:17\nAnd the reason that I always caution people not to do that is because, you know, kind of doing the analysis in flight is A lot can change.\n\n[Stark, Theodore (Ted)] 08:17:28\nAnd your percentages can change significantly. If you're, you know, depending on how many participants and how many quality responses are in that in your set of data that you're collecting. So if you're doing a study with 10 participants.\n\n[Stark, Theodore (Ted)] 08:17:46\nAnd you start off strong with two participants that just absolutely love the app.\n\n[Stark, Theodore (Ted)] 08:17:50\nAnd then you have three participants that don't love the app, your numbers change very, very quickly.\n\n[Stark, Theodore (Ted)] 08:17:58\nSo, you know, that's always a challenge. There's always like when you're in field, there's just things happen.\n\n[Stark, Theodore (Ted)] 08:18:07\nPeople not showing up, people not having enough time, or it's an hour long session, they join 30 minutes in.\n\n[Stark, Theodore (Ted)] 08:18:15\nAnd still trying to get the most data that you can You know, given that a lot of it is a lot of it is researchers ability to kind of adapt to to what participants are saying. Not to sound robotic as they're kind of going through a list of questions and make it more conversational than\n\n[Stark, Theodore (Ted)] 08:18:39\nThen, you know, an Inquisition Does that help?\n\n[Dulaney, Stephen] 08:18:42\nYes, that helps. What types of research activities do you have you found to be most useful? And I also want to explore like How much data does it generate as you're collecting that data?\n\n[Stark, Theodore (Ted)] 08:18:55\nI mean, it's all going to depend.\n\n[Dulaney, Stephen] 08:18:57\nOkay, so let's talk about surveys. How do you feel about surveys?\n\n[Stark, Theodore (Ted)] 08:19:01\nSurveys have a place. I think they are one of the most widely overused, misused.\n\n[Stark, Theodore (Ted)] 08:19:10\nYou know tools or quasi methodologies that are out there.\n\n[Dulaney, Stephen] 08:19:15\nOkay.\n\n[Stark, Theodore (Ted)] 08:19:16\nAnd largely just because largely just because there is a art and a science to having good survey questions.\n\n[Stark, Theodore (Ted)] 08:19:24\nThere's an art and a science to having an idea, an approach, a strategy to take the qual and the quant data that you're going to collect from those surveys and turn it into something that can be an insight.\n\n[Dulaney, Stephen] 08:19:40\nWhat types of entries, video interviews or in-person interviews do you like to conduct?\n\n[Stark, Theodore (Ted)] 08:19:47\nI mean, these are all going to depend on what the research questions are.\n\n[Stark, Theodore (Ted)] 08:19:51\nSo, you know, it's It… trying to figure out if you have a car and you are maybe you're a gearhead. So you're underneath the hood and you're playing around with the engine.\n\n[Stark, Theodore (Ted)] 08:20:07\nAnd you make a decision to use one type of coupling over another type of coupling.\n\n[Stark, Theodore (Ted)] 08:20:13\nThat's you know that's what coupling you use as a gearhead really makes a lot, it's important, right? And maybe you can squeeze performance out of that.\n\n[Stark, Theodore (Ted)] 08:20:22\nBut the end result is less about what coupling you used and more about what is that experience? What is the performance of the car?\n\n[Stark, Theodore (Ted)] 08:20:33\nWhat is the driving experience for the person behind the wheel? What is the experience for the people that are riding in the car?\n\n[Stark, Theodore (Ted)] 08:20:41\nAnd, you know, so it's like having a debate over what brand of pencil you want to use.\n\n[Dulaney, Stephen] 08:20:47\nOkay, so can you give me two different specific examples of research questions that result in two different research techniques.\n\n[Stark, Theodore (Ted)] 08:20:56\nNo, because you get… You put researchers in a room and ask them to plan a study.\n\n[Stark, Theodore (Ted)] 08:21:05\nAnd if you're nice enough, you're going to give them the research questions.\n\n[Stark, Theodore (Ted)] 08:21:10\nBut they're going to come up with at least 10 different approaches.\n\n[Stark, Theodore (Ted)] 08:21:14\nSo it's not this direct correlation that your question is implying.\n\n[Dulaney, Stephen] 08:21:19\nOkay, so… How do you decide?\n\n[Stark, Theodore (Ted)] 08:21:24\nYou decide based on time, based on budget. Based on the constraints that are given to you for that particular project.\n\n[Dulaney, Stephen] 08:21:32\nOkay, so let's move along to collection. How much time do you spend during the actual data collection phase and how much of a burden is that or how much of a pain point is that overall in the research activities?\n\n[Stark, Theodore (Ted)] 08:21:45\nSay that again.\n\n[Dulaney, Stephen] 08:21:46\nI just want to talk about data collection. How much effort do you spend conducting the research?\n\n[Dulaney, Stephen] 08:21:52\nAnd managing the assets that you generate.\n\n[Stark, Theodore (Ted)] 08:21:56\nI mean… If you think about this in terms of percentages.\n\n[Stark, Theodore (Ted)] 08:22:02\nOkay. You would spend 50% doing your planning.\n\n[Stark, Theodore (Ted)] 08:22:09\n25% in the field, which is when data collection would be.\n\n[Stark, Theodore (Ted)] 08:22:14\nAnd the other 25% would be analysis, synthesis, and reporting.\n\n[Stark, Theodore (Ted)] 08:22:23\nThe managing of assets is a really, really interesting point. And it's one that we as an overall organization do not do a good job of.\n\n[Stark, Theodore (Ted)] 08:22:34\nAnd what I mean by that is we don't have any sort of centralized repository.\n\n[Stark, Theodore (Ted)] 08:22:40\nWithin a particular project. You know, there are techniques and approaches that we employ here Even as something as simple as giving people a folder structure.\n\n[Stark, Theodore (Ted)] 08:22:56\nSo, you know, this is where you put your plan. This is where you put your data. This is where you do your analysis.\n\n[Stark, Theodore (Ted)] 08:23:01\nAnd at least that way it makes it easier to find crap.\n\n[Stark, Theodore (Ted)] 08:23:06\nBut you know, but Generally, I would say 25% of your overall time is when you're in the field and you're collecting the data.\n\n[Stark, Theodore (Ted)] 08:23:16\nNormally, the management of that data gets a little messy when you're doing analysis.\n\n[Stark, Theodore (Ted)] 08:23:24\nAnd after you've delivered your findings, you then have time to make sure that you clean up the folder that has all of your data in it or clean up the data store that has all of your data in it.\n\n[Stark, Theodore (Ted)] 08:23:40\nAt least one of the techniques that we really try to push here is you have a deliverables folder.\n\n[Stark, Theodore (Ted)] 08:23:46\nAnd in the deliverables for folder, you actually supply the client with the final analysis, the final Excel spreadsheets, the final whatever\n\n[Stark, Theodore (Ted)] 08:23:59\nThat practice, even if you don't necessarily deliver that data, even though you should.\n\n[Stark, Theodore (Ted)] 08:24:06\nYou know, kind of helps researchers in kind of culling through and finding finding what can be put in archive, what is actually necessary.\n\n[Stark, Theodore (Ted)] 08:24:16\nBut we as an organization at Deloitte level, we as an organization within AMNC, DP&I, we don't have a good strategy in place In order to kind of hold on to that and manage that data you know once those projects over.\n\n[Dulaney, Stephen] 08:24:35\nOkay, so we've gone through the process from start to finish, and you've mentioned some, but do you want to have any call out any specific pitfalls or struggles in the process that that you'd like to see worked out.\n\n[Stark, Theodore (Ted)] 08:24:50\nI don't know that they're necessarily pitfalls.\n\n[Stark, Theodore (Ted)] 08:24:57\nThere's a lot to be said when you're in the field balancing adaptability with some level of standardization.\n\n[Stark, Theodore (Ted)] 08:25:10\nAnd what I mean by that is It's important, especially with the type of research we do.\n\n[Stark, Theodore (Ted)] 08:25:19\nTo have the, you know, the interview session feel more conversational as opposed to people rattling off questions.\n\n[Stark, Theodore (Ted)] 08:25:29\nAnd… That said.\n\n[Stark, Theodore (Ted)] 08:25:34\nYou still need to have some level of rigor to ensure that the way that you conducted an interview session a And the way that you conducted an interview session B, you're still getting you know similar levels of data quality\n\n[Stark, Theodore (Ted)] 08:25:54\nBecause, you know, when you look at that data in aggregate if you don't have some standardization across the board.\n\n[Stark, Theodore (Ted)] 08:26:04\nIt can really call into question the validity of your data.\n\n[Stark, Theodore (Ted)] 08:26:09\nSo generally speaking, Stephen, the biggest pitfalls are we don't get enough time to do any of our research.\n\n[Stark, Theodore (Ted)] 08:26:18\nUm and usually the areas that get compressed the most are either in the planning or in the reporting and you know there are examples and stories out there. It's like, okay, well, sweet. You just finished usability testing.\n\n[Stark, Theodore (Ted)] 08:26:34\nYou know, an hour later, the stakeholder from the client says, okay, so when can I see the report?\n\n[Stark, Theodore (Ted)] 08:26:40\nLike, well, dude, you just finished data collection of two weeks worth of sessions.\n\n[Stark, Theodore (Ted)] 08:26:44\nYou know so And there are definitely ways to counterbalance that or at least manage those expectations but Generally speaking, we don't get enough time to do research.\n\n[Dulaney, Stephen] 08:27:01\nOkay, so I'm going to switch to a new direction right now. This section is a little faster.\n\n[Dulaney, Stephen] 08:27:05\nCan you tell me who on research projects do you work with? Who are your collaborators?\n\n[Stark, Theodore (Ted)] 08:27:13\nNormally for me, it would be PPMDs.\n\n[Dulaney, Stephen] 08:27:17\nAnd who do you work for?\n\n[Stark, Theodore (Ted)] 08:27:25\nIn terms of like Deloitte world, it would be the PPMD or the senior manager that, you know, kind of I interact with but Our work is being done on behalf of the client.\n\n[Stark, Theodore (Ted)] 08:27:38\nAnd that's So I consider that I'm working for them, but through the lens of Deloitte Digital.\n\n[Dulaney, Stephen] 08:27:45\nOkay, and who benefits most from your work?\n\n[Stark, Theodore (Ted)] 08:27:49\nIt depends on the study. Sometimes it can be our internal design team. Sometimes it can be stakeholders. Sometimes it can be both. Sometimes it can be product managers. Sometimes it can be C-suite executives.\n\n[Stark, Theodore (Ted)] 08:28:04\nSo, you know. It really is going to depend a lot based on the study, based on the research questions and the research objectives.\n\n[Dulaney, Stephen] 08:28:12\nOkay, so between those three, your collaborators and your clients and your customers.\n\n[Dulaney, Stephen] 08:28:16\nWhich one would you rank as most important and which one would you rank next and which one would you rank next?\n\n[Stark, Theodore (Ted)] 08:28:23\nIt depends. I can't give you a blanket answer on that one.\n\n[Dulaney, Stephen] 08:28:26\nOkay, what do you consider the victory event?\n\n[Stark, Theodore (Ted)] 08:28:30\nThe victory then is presenting quality insights that can help in defining a direction or validating or invalidating designs or an approach or you know Basically.\n\n[Stark, Theodore (Ted)] 08:28:49\nBeing able to come back to a group of people, be it them Deloitte employees or be them employees of the company that we're doing work for.\n\n[Stark, Theodore (Ted)] 08:28:58\nAnd delivering and delivering insights to help them better understand how they need to adapt or tweak their product.\n\n[Stark, Theodore (Ted)] 08:29:08\nTheir experience, their strategy. In order to fulfill the idea that technology is there to make people's lives easier, not more difficult.\n\n[Dulaney, Stephen] 08:29:17\nOkay, very good. We're going to switch gears again. And this is part of… And in our role as user experience practitioners and user research, we have to educate and we have to evangelize.\n\n[Dulaney, Stephen] 08:29:27\nAnd as part of that process. It's important for us to know how to communicate what we do. So I'd like to start with how you communicate the value of your work to when you're educating and evangelizing.\n\n[Stark, Theodore (Ted)] 08:29:42\nYeah, and we don't do a very good job of it right now.\n\n[Stark, Theodore (Ted)] 08:29:47\nA lot of the evangelizing within Deloitte is based on qual.\n\n[Stark, Theodore (Ted)] 08:29:52\nSo we did this. We got these results. These results may or may not have had some direct or indirect correlation to an overall sales target.\n\n[Stark, Theodore (Ted)] 08:30:06\nAnd the reason why we struggle at doing that.\n\n[Stark, Theodore (Ted)] 08:30:12\nIs due in large part because Research is not normally on the project.\n\n[Stark, Theodore (Ted)] 08:30:20\nForts and tired. We get brought on to do generative research. We get brought on to consult. We get brought on to advise a project team.\n\n[Stark, Theodore (Ted)] 08:30:30\nAnd then we roll off. And we may get brought back to do evaluative research, which is great.\n\n[Stark, Theodore (Ted)] 08:30:40\nWith the exception of longer term engagements or things like AORs, agency of records.\n\n[Stark, Theodore (Ted)] 08:30:47\nWe aren't always there to see the product actually go all the way through the design and development lifecycle.\n\n[Stark, Theodore (Ted)] 08:30:55\nWe're not there to see it when it launches. We're not necessarily there to see it post launch.\n\n[Stark, Theodore (Ted)] 08:31:03\nAnd so trying to speak with a partner that maybe doesn't know us that well.\n\n[Stark, Theodore (Ted)] 08:31:11\nThat becomes a challenge. One of the ways that we try to counterbalance that is in is trying to talk more about the impact to the design.\n\n[Stark, Theodore (Ted)] 08:31:27\nAnd the challenge with that approach is it doesn't always translate easily into dollars and cents.\n\n[Stark, Theodore (Ted)] 08:31:35\nBut um you know a lot of researchers are uncomfortable with this notion of kind of being shameless self-promoters, but especially in a large company Especially within a consultancy we have to be able to shout from the rooftops when we finish a study. We need to be able to\n\n[Stark, Theodore (Ted)] 08:31:57\nAdapt our research, adapt our reporting. To meet the users where they are. And what I mean by that is we may work on an academic paper or an academic style paper.\n\n[Stark, Theodore (Ted)] 08:32:10\nWe then have to translate that to make sure that that paper and the insights and the impact of those insights is understandable and relatable to the audience in which we are trying to evangelize to.\n\n[Stark, Theodore (Ted)] 08:32:25\nSo some audiences really like slide decks. Some audiences want a TLDR summary in an email.\n\n[Stark, Theodore (Ted)] 08:32:33\nSome people just want it in a teams. Some people like to consume it via a video.\n\n[Stark, Theodore (Ted)] 08:32:39\nSome people want to hear about it in terms of a podcast and being able to adapt your story, being able to adapt your the implications of the research that you finished.\n\n[Stark, Theodore (Ted)] 08:32:56\nTo those audiences is one of the approaches that slowly but surely is starting to chip away at some of these preconceived notions, at least here at Deloitte, in terms of what research is and more importantly, what it is not.\n\n[Dulaney, Stephen] 08:33:10\nOkay, so with respect to education and evangelizing, how do you describe what problem you repeatedly solve?\n\n[Stark, Theodore (Ted)] 08:33:21\nI mean, we are trying to make sure that technology is easier to use at its core.\n\n[Stark, Theodore (Ted)] 08:33:28\nThat's what all of our research is done for. Be it generative or evaluative or some variation of You know, both of those.\n\n[Stark, Theodore (Ted)] 08:33:39\nSo… trying to dig in to specific areas of the experience or specific challenges a company is facing.\n\n[Stark, Theodore (Ted)] 08:33:51\nAnd deliver insights as well as sometimes strategies or recommendations on remediation or how to actually fix the experience or optimize the experience or optimize the strategy.\n\n[Stark, Theodore (Ted)] 08:34:04\nThat's really at its core what we're doing.\n\n[Dulaney, Stephen] 08:34:07\nOkay, so how do you educate educational people, we kind of talked about that one, but anything specific around educating, what are some of the struggles\n\n[Stark, Theodore (Ted)] 08:34:18\nI mean, attention is always a struggle. Um and trying to figure out that balance between how much information for the audience that you're presenting to is the right fit.\n\n[Stark, Theodore (Ted)] 08:34:33\nYou don't want to necessarily go super deep into statistics and the analyses that you may have used in a study if If that's not going to necessarily land for the audience.\n\n[Stark, Theodore (Ted)] 08:34:49\nAnd it's not an easy endeavor to do. Researchers really like to go super deep um but You got to be able to think about what does that look like for a partner? What does that look like for a chief experience officer. What does that look like for a designer?\n\n[Stark, Theodore (Ted)] 08:35:07\nAnd how can you basically translate the super technical, the super deep into language and into a story will have the most impact and value for the audience of what you're trying to evangelize to.\n\n[Dulaney, Stephen] 08:35:25\nOkay, what role does the look and feel of your outputs play in your evangelizing and educating?\n\n[Stark, Theodore (Ted)] 08:35:33\nThat's a hard question for a researcher to answer. But I would say, you know.\n\n[Stark, Theodore (Ted)] 08:35:42\nSome projects, some partners, some stakeholders put a higher degree of value on a higher value the physical presentation.\n\n[Stark, Theodore (Ted)] 08:35:53\nThose are those typically are stakeholders or projects where they are not as mature in terms of their understanding and use of research.\n\n[Stark, Theodore (Ted)] 08:36:06\nBut, you know, but Sometimes if your research has uncovered some interesting things.\n\n[Stark, Theodore (Ted)] 08:36:13\nYou might get asked to put together a deck that's going to go to a board of directors and just again trying to find what that balance is in terms of what all the cool things that you did in your approach and how it was so cool and this and that and the other.\n\n[Stark, Theodore (Ted)] 08:36:32\nBut, you know, just Sometimes the visual or the appearance has more gravitas than others.\n\n[Stark, Theodore (Ted)] 08:36:41\nSometimes researchers get to set that direction. It's rare, but sometimes we get to do that.\n\n[Stark, Theodore (Ted)] 08:36:46\nA lot of times it is more just how how much how much of that aesthetic do you actually need to focus time on? And in most cases where it's you need a really, really strong visual aesthetic.\n\n[Stark, Theodore (Ted)] 08:37:01\nThat's usually when researchers will reach out to a designer and see if they can help.\n\n[Dulaney, Stephen] 08:37:06\nOkay, and the last category for this evangelizing education about user research is what role do the tools that you use and have available play?\n\n[Stark, Theodore (Ted)] 08:37:18\nPeople that are on the sidelines love to talk about tools.\n\n[Stark, Theodore (Ted)] 08:37:23\nAnd they love to talk about the intricacies of one tool versus another tool.\n\n[Stark, Theodore (Ted)] 08:37:29\nAt the end of the day. The tools are a facilitation engine.\n\n[Stark, Theodore (Ted)] 08:37:36\nThe role that it plays with experienced researchers is less emphasized than people who are brand new.\n\n[Stark, Theodore (Ted)] 08:37:47\nAnd what I mean by that is like you may use, you know, you may use Qualtrics, you might use users and you might use MUIT, you might use something else but Unless you're trying to evangelize to the stakeholder group.\n\n[Stark, Theodore (Ted)] 08:38:03\nThe value of a particular platform. The value that it was able to deliver.\n\n[Stark, Theodore (Ted)] 08:38:12\nThe the tool that you use or going back to the car, you know, the coupling that you elect to use in your engine.\n\n[Stark, Theodore (Ted)] 08:38:23\nIs largely something that is reserved for happy hours at research conferences.\n\n[Stark, Theodore (Ted)] 08:38:30\nYou know. One brand of tire or over another or one one version of a washer that you use or a lug nut So, um.\n\n[Stark, Theodore (Ted)] 08:38:41\nIf you're trying to emphasize, especially internally here at Deloitte, sometimes we have to index heavily on one tool over the other. And largely that's being done Because we are trying to continue to spread the word about either the availability of the tool\n\n[Stark, Theodore (Ted)] 08:39:00\nOr how we as researchers and experienced researchers were able to leverage that tool In order to get to deeper and richer insights in less time.\n\n[Dulaney, Stephen] 08:39:11\nOkay, very good. So in the last section, I just had some kind of wandering questions. If you had a magic wand, what one thing would you change about the user research activities and processes that you used.\n\n[Stark, Theodore (Ted)] 08:39:25\nIt's that we would get brought in earlier in the in the planning and the pursuit.\n\n[Stark, Theodore (Ted)] 08:39:34\nPhases.\n\n[Dulaney, Stephen] 08:39:35\nOkay, sounds good and um Are there any thanks during a project that research initiative that keep you up at night?\n\n[Stark, Theodore (Ted)] 08:39:45\nNot really. I mean, you know.\n\n[Stark, Theodore (Ted)] 08:39:49\nThere is no study that goes perfectly. And the longer you've been doing this, the more you realize that.\n\n[Stark, Theodore (Ted)] 08:39:56\nSo, you know. Given the constraints, given the curveballs that you get thrown at you.\n\n[Stark, Theodore (Ted)] 08:40:02\nHow are you going to adapt? So I don't necessarily know that it keeps me up at night, but you have to be able to embrace and accept that it's never going to go exactly as planned.\n\n[Dulaney, Stephen] 08:40:18\nOkay, and the last question, if I talk to one of your collaborators and I say, please describe Ted to me in one word.\n\n[Dulaney, Stephen] 08:40:25\nWhich one word would you want them to tell me?\n\n[Stark, Theodore (Ted)] 08:40:30\nLord. Methodical.\n\n[Dulaney, Stephen] 08:40:33\nSounds good. Are there any questions that you expected me to ask that I haven't asked so far?\n\n[Stark, Theodore (Ted)] 08:40:38\nNo.\n\n[Dulaney, Stephen] 08:40:39\nOkay, that sounds good. That's kind of the end of the question part of the interview. We can either do a little evaluative research, but I actually ended up breaking my tool because after these research questions, I've learned so much\n\n[Dulaney, Stephen] 08:40:51\nI threw everything away and i'm starting to from scratch.\n\n[Dulaney, Stephen] 08:40:56\nI don't know if you want to do that. I can kind of show you two different things we're working on the Sidekick tools, which you upload transcripts to and then it does various forms of animal analysis.\n\n[Dulaney, Stephen] 08:41:06\nAnd then most recently, I've started to break down interviews into semantic tagging so that it'll go through and kind of take a paragraph of what you say.\n\n[Dulaney, Stephen] 08:41:16\nAnd add a frustration and add maybe a feature, what you talk about.\n\n[Dulaney, Stephen] 08:41:20\nAnd so I'm kind of reorganizing the way we analyze transcripts.\n\n[Dulaney, Stephen] 08:41:24\nAnd that is what broke everything. But it is pretty promising.\n\n[Stark, Theodore (Ted)] 08:41:28\nSo how is this different from what Dovetail offers?\n\n[Dulaney, Stephen] 08:41:28\nAny of that?\n\n[Dulaney, Stephen] 08:41:32\nYou know. I haven't studied dovetail and I haven't studied uh That's set on purpose because I'm trying not to be influenced, but I do plan with Kinsha to drop all of our interviews videos into Dovetail and go through that phase.\n\n[Dulaney, Stephen] 08:41:46\nThis research effort goes through the end of May. And so I'm basically collecting up to 20 interviews with different researchers at this phase. And then I'm kind of building out the tool based on If the question is if you had a digital assistant, a digital research and interview assistant, what would it be?\n\n[Stark, Theodore (Ted)] 08:42:07\nOkay.\n\n[Dulaney, Stephen] 08:42:08\nAnd so that's kind of where we're… where we're focusing our time.\n\n[Dulaney, Stephen] 08:42:14\nAnd then the other initiative that's actually funding this that I kind of need to keep aware of is the The Sidekick Tools team.\n\n[Stark, Theodore (Ted)] 08:42:25\nYep.\n\n[Dulaney, Stephen] 08:42:26\nBecause they're gracious enough to allow me to work with them.\n\n[Dulaney, Stephen] 08:42:31\nAnd so we're creating a series of Sidekick side.\n\n[Dulaney, Stephen] 08:42:37\nAre based off Daria where you would actually upload a transcript And then that's one. Are you seeing the screen?\n\n[Stark, Theodore (Ted)] 08:42:46\nYeah. I mean, the one of these quote unquote tools that A lot of people don't necessarily know about a lot of people don't necessarily know about I have found it to be found to be mildly useful is the research assistant.\n\n[Dulaney, Stephen] 08:42:47\nOkay.\n\n[Stark, Theodore (Ted)] 08:43:04\nI don't like I don't like how I can't tell it what areas to go or what types of areas of the web.\n\n[Dulaney, Stephen] 08:43:05\nI used the research assistant. I used it last night.\n\n[Stark, Theodore (Ted)] 08:43:17\nSo like if I'm doing UX research, I don't give a shit about Dow Jones.\n\n[Stark, Theodore (Ted)] 08:43:22\nI wanted to hit Google Scholar. I wanted to hit some of the open repos.\n\n[Stark, Theodore (Ted)] 08:43:29\nAnd, you know. It's nice. It's great that it kind of puts together, you know, it looks really pretty.\n\n[Stark, Theodore (Ted)] 08:43:39\nI like that it gives the references. I wish I could tell it what type of reference or what reference models I want.\n\n[Stark, Theodore (Ted)] 08:43:47\nSo do I want this? Formatted for APA? Do I want this formatted for ACM. Do I want this formatted for You know, some of the other common ways But, you know, the The insights are, they're okay.\n\n[Stark, Theodore (Ted)] 08:44:09\nI think that it's a little reaching at times but You know, there's a reason why it's hidden over there on the left-hand side.\n\n[Stark, Theodore (Ted)] 08:44:20\nThere are definitely some other tools that are out there outside of Deloitte that are much better at that stuff.\n\n[Dulaney, Stephen] 08:44:24\nDo you use the deep research tool? In OpenAI?\n\n[Stark, Theodore (Ted)] 08:44:29\nYeah, I think that one's pretty good. Notebook LM in terms of doing some of the more qual heavy analysis I think is… is on par or better than like Dovetail um Dovetail is interesting because it's really a question when people tell me that they're using Dovetail, I always ask them in what capacity? Are they using it for qual analysis? Because it's really good at that.\n\n[Stark, Theodore (Ted)] 08:44:58\nOr are they using it for more of that research repo? And sometimes it's both, but The research repo is kind of, it's a really, really strong suit of dovetail.\n\n[Stark, Theodore (Ted)] 08:45:11\nAnd as you're talking about tagging and all this other stuff, Dovetail has all of that stuff baked into its qual analysis, which is why I was asking about it.\n\n[Dulaney, Stephen] 08:45:19\nYeah. So this basically takes his interview.\n\n[Stark, Theodore (Ted)] 08:45:22\nBut you know.\n\n[Dulaney, Stephen] 08:45:25\nAnd then it takes each little snippet at the beginning and the end. That's what Dovetail does, and then captures that snippet. And then it does its price, it's conviction, and then we kind of fill in these tags as you go.\n\n[Dulaney, Stephen] 08:45:36\nAnd so, and this is a model I'm playing with because you end up like initially I end up with this kind of transcript out of, and this is straight out of like.\n\n[Stark, Theodore (Ted)] 08:45:37\nMm-hmm.\n\n[Dulaney, Stephen] 08:45:44\nWhat we're doing today. So I'll get this from from and then you do basically some sentiment analysis. There are various models I'm learning huggy face, blah, blah, blah. And they have like this one is super atomic.\n\n[Stark, Theodore (Ted)] 08:45:46\nYou know\n\n[Dulaney, Stephen] 08:45:57\nThis is a question that kind of built Workday that was great and then it breaks that in and starts to give it neutral. So this one is a little too atomic.\n\n[Dulaney, Stephen] 08:46:08\nAnd then also I lost the speaker. This should say Suzette Whereas the Jesse one is… It'll take some big paragraphs. If I had this wrapping, it would be, and then it gives you neutral stakeholder planning, research planning type stuff.\n\n[Dulaney, Stephen] 08:46:22\nSo this is like having the machine go through and kind of break it up in what it thinks is important. They call it chunking.\n\n[Stark, Theodore (Ted)] 08:46:28\nMm-hmm.\n\n[Dulaney, Stephen] 08:46:28\nAnd so I think there's some promise in there. I think in general, the sweet spot is to try to manage the archive and manage the assets And where I am right now is I broke everything. So this is the tool that basically has the archived cards. And these are the five interviews that I have. I took all the green eggs and ham and stuff out because they're done. I passed that phase.\n\n[Dulaney, Stephen] 08:46:52\nSo these are actually hour-long interviews similar to what we did today.\n\n[Dulaney, Stephen] 08:46:56\nAnd then I'm trying to… This is like your transcript, the raw one. And the raw one's good if you want to throw it to an AI to get like a a persona and there's probably other types of analysis that I'd need to pull.\n\n[Dulaney, Stephen] 08:47:12\nIn specific, what type of analysis, you say statistical what kind of statistical report would you like to see out of a group of interviews?\n\n[Stark, Theodore (Ted)] 08:47:27\nInteresting.\n\n[Dulaney, Stephen] 08:47:29\nBecause that's all based on the prompting and I need to kind of do best practices and then go through and play with the prompting and then I'll feed it like 10 or 12 interviews and then generate a statistical report and then see if we like it.\n\n[Dulaney, Stephen] 08:47:40\nSo the first two that were easy are personas and journey maps. The others are possible. So these little cards, you have the metadata.\n\n[Dulaney, Stephen] 08:47:47\nI probably need to start thinking about the types of demographic data that I want to collect.\n\n[Dulaney, Stephen] 08:47:54\nMore seriously. And then you have the analysis. This is the one where you can actually go through. This is the statement from Suzette and I could hit the edit button.\n\n[Dulaney, Stephen] 08:48:03\nAnd then edit and add the tags. But you can see how long this is because it broke her super tiny, whereas Jesse's, it only gave me nine chunks in an hour interview. And I was like, there's clearly more than nine important things Jesse said in an hour-long interview. So that's where I am. That's the state of the\n\n[Dulaney, Stephen] 08:48:22\nThe research right now. But basically, I threw out the homepage because people don't in the The forms are just not, I think of this creating a research study one way. Everyone does their own thing.\n\n[Dulaney, Stephen] 08:48:34\nSo I'm leaning right now going to an interview style for setting up a project to let the person Whether it's a discovery project or a research program.\n\n[Dulaney, Stephen] 08:48:45\nAnd just do a quick interview and capture their thoughts. And then go from there and then focus on capturing transcripts and analyzing transcripts and and storing as a repository transcripts. I think that's one thing Dovetail does nice is you can actually search Dovetail and you can sneak into all the videos from other Deloitte people.\n\n[Dulaney, Stephen] 08:49:05\nI don't know if it's intentional. But I do see, you know, I was able to find pretty good results on financial analyst from interviews I didn't conduct, but were related to financial analysts.\n\n[Dulaney, Stephen] 08:49:18\nThat's a bug or a feature, but… It's an observation right now.\n\n[Stark, Theodore (Ted)] 08:49:21\nI mean, it's because we're all using the same repo instance.\n\n[Dulaney, Stephen] 08:49:26\nYeah. So I don't really have, you know, I've kind of ended up realizing that the needs are different.\n\n[Dulaney, Stephen] 08:49:36\nAnd so I'm trying to, like you say, wait till I get some more But I have really found fascinating results.\n\n[Stark, Theodore (Ted)] 08:49:44\nYeah.\n\n[Dulaney, Stephen] 08:49:44\nAnd I'll read those out to you. Everyone has a, like we do rely on the art more than we put potentially think. And there's these deep reservoirs of experience that is different and distinct in each researcher.\n\n[Dulaney, Stephen] 08:49:56\nThat is the secret to how they've succeeded and been here so long at Deloitte.\n\n[Dulaney, Stephen] 08:50:01\nAnd you don't know what it is, but you know it when it starts to pop up during the interview. And that's when I try to get quiet and listen.\n\n[Stark, Theodore (Ted)] 08:50:03\nYeah.\n\n[Stark, Theodore (Ted)] 08:50:10\nNice. All right, man. I hope this was helpful.\n\n[Dulaney, Stephen] 08:50:15\nSuper helpful.\n\n[Stark, Theodore (Ted)] 08:50:18\nYeah. And please let me know if there's anything else I can do to help. Otherwise, I'm going to hop.\n\n[Stark, Theodore (Ted)] 08:50:24\nYou go splash some water on my face before my 8 a.m.\n\n[Dulaney, Stephen] 08:50:27\nOkay, thanks for taking the time to share your story with me. I enjoyed it very much.\n\n[Stark, Theodore (Ted)] 08:50:31\nYeah, man. All right. Take care, my friend.\n\n[Dulaney, Stephen] 08:50:32\nI'll keep you posted on our progress. Thank you.\n\n",
  "chunks": [
    {
      "text": " [Dulaney, Stephen] 08:00:56 Testing the transcript.  [Stark, Theodore (Ted)] 08:02:04 Morning, Stephen. How are you?  [Dulaney, Stephen] 08:02:05 Morning, how are you? Good, good. Thank you for joining today. Do I have your permission to do a transcript and a recording?  [Dulaney, Stephen] 08:02:14 Sounds great. And I'm fine.  [Stark, Theodore (Ted)] 08:02:14 Yep.  [Dulaney, Stephen] 08:02:20 That's no problem. So Ted, tell me a little bit about your background as a user researcher. How did you get into this line of work?  [Stark, Theodore (Ted)] 08:02:33 That started in school. I hung out with more professors than I did with kids my own age.  [Stark, Theodore (Ted)] 08:02:41 And so because I hung around the professors i kind of got dragged into helping them out with studies.  [Stark, Theodore (Ted)] 08:02:51 And that kind of began the journey of me really focused more on research than on design.  [Stark, Theodore (Ted)] 08:03:02 So I don't know that I ever kind of made a pivot. I've always been on the research and the science side of the spectrum.  [Dulaney, Stephen] 08:03:09 Now, what school was this and there were any specific mentors that formed your research behavior today?  [Stark, Theodore (Ted)] 08:03:15 I mean, it's the University of Arizona. There's a handful of them.  [Stark, Theodore (Ted)] 08:03:21 But I don't know how that's necessarily germane to this conversation.  [Dulaney, Stephen] 08:03:26 Okay. Tell me with respect to your current role, what is your primary goal?  [Stark, Theodore (Ted)] 08:03:35 Continuing to build out a research offering here at Deloitte.  [Dulaney, Stephen] 08:03:41 And with respect to the primary goal, what are some key frustrations that you encounter?  [Stark, Theodore (Ted)] 08:03:47 A lot of it is just lack of awareness that our research practice exists.  [Stark, Theodore (Ted)] 08:03:56 A lack of… people who aren't as far along on their path in either doing research or exploring research um just it's just it looks easier than it actually is.  [Stark, Theodore (Ted)] 08:04:13 Um so you know the trying to strike that balance both with projects as well as with practitioners in terms of knowing when they need to actually bring in an expert.  [Stark, Theodore (Ted)] 08:04:28 And far too often it's too late in the process. And it, you know, that's more just in terms of will get brought in or get asked to kind of help or take a look at something after data collection is already done.  [Stark, Theodore (Ted)] 08:04:45 And they're in the middle of doing analysis or reporting out their findings and You know, just trying to find a way to help them out as well as to give them a little bit of education in terms of If you're going to do this again next time, here's some  [Stark, Theodore (Ted)] 08:05:02 Some suggestions and a lot of that just comes with you know the the 20 years plus of experience that I have.  [Dulaney, Stephen] 08:05:08 Okay, that sounds great. So I want you to think back. When did you first arrive at Deloitte and what kind of, what was the state of the research and what were the activities that you performed during a discovery cycle?  [Stark, Theodore (Ted)] 08:05:21 Almost 11 years ago, June 1st. And there really wasn't a research practice then.  [Stark, Theodore (Ted)] 08:05:29 There was a bunch of bunch of designers that think that they can do research and some of them could for sure but A lot of when we're doing research really badly.  [Stark, Theodore (Ted)] 08:05:42 From an approach standpoint, from a policy standpoint, from a methodology standpoint, from a data collection standpoint.  [Stark, Theodore (Ted)] 08:05:51 And yeah, you know, so just slowly but surely trying to trying to change the way that you know we did research initially here in Denver.  [Stark, Theodore (Ted)] 08:06:03 Um you know now nationally and internationally. So I don't know if that really answers your question.  [Dulaney, Stephen] 08:06:09 Okay, so how is the state of the research today? How has it changed and what are your methods and tools that you have available that you didn't back then.  [Stark, Theodore (Ted)] 08:06:21 I mean, the methods are all the same. The tools change just based on change based on what's out there.  [Stark, Theodore (Ted)] 08:06:31 The market has seen a considerable consolidation of online platforms and tools.  [Stark, Theodore (Ted)] 08:06:38 With the 800 pound gorilla in the market being users and user testing.  [Stark, Theodore (Ted)] 08:06:46 Um but you know the the tools that we use will come and go.  [Stark, Theodore (Ted)] 08:06:54 But the tool isn't the definition of doing research. It is a you know it is a mechanism to enable a researcher to actually collect data. That's all it is.  [Stark, Theodore (Ted)] 08:07:07 So… you know the the state today is we are getting better at research we are putting We're trying to strike that balance between rigor and practicality, which you have to do in any type of industry research setting and even in academia.  [Stark, Theodore (Ted)] 08:07:25 And we're getting there. We're making some headway. But, you know, we've got a ways to go and The big thing for me in the last, I'd say, five years is really pushing to include even in heavily qualitative research.  [Stark, Theodore (Ted)] 08:07:44 You still got to use statistics. You still got to use, you know, you can still bring in some quant.  [Stark, Theodore (Ted)] 08:07:51 And not just cherry pick whole quotes that maybe align with your, you know, with a researcher's bias.  [Stark, Theodore (Ted)] 08:07:57 Consciously or subconsciously. I hope.  [Dulaney, Stephen] 08:07:59 Okay, so what would you like to see in the next three years of how you're going to move and evolve the research efforts at Deloitte?  [Stark, Theodore (Ted)] 08:08:08 More promotion, more operationalization, more scale.  [Dulaney, Stephen] 08:08:14 Can you tell me a story like that one you talked about?  [Dulaney, Stephen] 08:08:18 Where you had a project that looked promising and then no matter how hard you tried, it became frustrating and just had more trouble than it should have.  [Stark, Theodore (Ted)] 08:08:26 I mean, all projects have challenges, right? Any research project is going to have curveballs thrown at you.  [Stark, Theodore (Ted)] 08:08:33 You know, a researcher job is to adapt to the situation.  [Stark, Theodore (Ted)] 08:08:41 And given the constraints, find a way to still deliver you know insights, still deliver findings despite the curveballs.  [Stark, Theodore (Ted)] 08:08:54 Um and you know, I think a lot of that just comes with time You're going to have participants that cancel or you're going to have, you know, a prototype that doesn't work on a particular day. You're going to have  [Stark, Theodore (Ted)] 08:09:07 A slew of challenges. It's that adaptability. It's that you know realizing what that end goal is.  [Stark, Theodore (Ted)] 08:09:19 In terms of what we're doing research to or we're doing a study to explore these research questions.  [Stark, Theodore (Ted)] 08:09:27 Given some of the constraints that have been put in front of us, how do we still achieve that goal?  [Dulaney, Stephen] 08:09:32 I want you to think of a story that you tell to help spread a message about a past research project.  [Stark, Theodore (Ted)] 08:09:38 Yeah, I don't use stories for that, Stephen.  [Dulaney, Stephen] 08:09:40 Okay, that sounds good. That's as good as the answers I needed. Okay, we're going to change task a little bit and I want to talk about like creating a discovery cycle and creating a research effort.  [Dulaney, Stephen] 08:09:52 How do you go about what's when you have a new project in your awareness and it's maybe just in the, you know, just you just heard about it phase What are some of the activities you do to formalize that and convert it into a discovery project?  [Stark, Theodore (Ted)] 08:10:05 I mean, does it have to be discovery? Okay. I mean, step one is develop a research plan And the step one of that effort is working with project team to identify what the research questions are. Sometimes projects will come with a method that they want to use, but they don't actually know what the research questions are.  [Dulaney, Stephen] 08:10:08 No, whatever you like.  [Stark, Theodore (Ted)] 08:10:31 And it's putting the cart before the horse.  [Dulaney, Stephen] 08:10:34 So what techniques do you do to identify and solidify the research questions?  [Stark, Theodore (Ted)] 08:10:39 A lot of it is conversations with the account team. A lot of it is, you know, if we have access to them, the stakeholders.  [Stark, Theodore (Ted)] 08:10:45 And I don't expect either one of those archetypes to actually say, here's our research questions, go.  [Stark, Theodore (Ted)] 08:10:53 It's more listening to the areas of whatever whatever ecosystem we're in.  [Stark, Theodore (Ted)] 08:11:03 What are they curious about what you know Are we trying to investigate or explore why we're seeing a drop off in the sales funnel? Whatever it is.  [Stark, Theodore (Ted)] 08:11:16 And based on those conversations, and it doesn't have to be long. You just have a quick conversation with some folks.  [Stark, Theodore (Ted)] 08:11:24 Begin to actually begin to actually formulate research questions.  [Stark, Theodore (Ted)] 08:11:29 And put those back in front of the accounting, put them back in front of the stakeholders.  [Stark, Theodore (Ted)] 08:11:36 But you know, but a lot of people will try to do research without actually kind of having those questions in mind and it's just you know it's it's really hard to do good research without kind of that structure in place.  [Dulaney, Stephen] 08:11:53 Once you have your research questions solidified, what is the next step to activating or planning the research initiative?  [Stark, Theodore (Ted)] 08:11:59 Yeah, I mean, then you begin experimental design. So now that you have your research questions in place.  [Stark, Theodore (Ted)] 08:12:08 You begin to formulate an approach as a researcher in terms of what what method or methods are you going to use? What metrics are you going to use?  [Stark, Theodore (Ted)] 08:12:23 What participant recruitment strategies are you going to use? And in that discussion, you know, further on down the road is what tools might we leverage in order to do this?  [Stark, Theodore (Ted)] 08:12:36 So if we're doing remote unmoderated we'll need to think about what tools or platforms do we have access to.  [Stark, Theodore (Ted)] 08:12:47 What does the participant recruitment uh look like for that target population.  [Stark, Theodore (Ted)] 08:12:54 What does the stimuli look like? So the stimuli being a prototype.  [Stark, Theodore (Ted)] 08:12:59 Or a design or a design a navigational schema um and you know this this is where researchers actually do design. It's just not doing wireframes.  [Stark, Theodore (Ted)] 08:13:15 So… You go through that process and the planning process, generally speaking, should probably twice as long as it's going to take as long as it's going for the time that you're actually doing data collection or you're in the field. So let's say if it's a week.  [Stark, Theodore (Ted)] 08:13:31 In the field, you should probably plan two weeks for experimental design.  [Stark, Theodore (Ted)] 08:13:36 The reason for that is you got to make sure that everything is in place. You got to make sure that your data collection methods are correct.  [Stark, Theodore (Ted)] 08:13:43 You got to make sure that you know people are inherently unpredictable. So you've got to pilot during that phase as well.  [Stark, Theodore (Ted)] 08:13:52 We've been able to compress the planning down in some cases.  [Stark, Theodore (Ted)] 08:13:57 But you need time to actually plan a study. And most studies that are executed well are a direct result or a direct correlation to proper planning.  [Dulaney, Stephen] 08:14:11 Okay, that sounds great. So what… What is the next challenge after you have your research plan and you're ready to go to the field? What's your next challenge? Are there any between there?  [Stark, Theodore (Ted)] 08:14:23 I mean, recruitment is always going to be, I don't know that it's a challenge. It's just, it's something you got to deal with.  [Stark, Theodore (Ted)] 08:14:30 So, you know, making sure that whatever recruitment partner you're working with.  [Stark, Theodore (Ted)] 08:14:37 Making sure that you're getting quality participants coming through.  [Stark, Theodore (Ted)] 08:14:44 So user testing, for example, has a well-deserved reputation of having a really.  [Stark, Theodore (Ted)] 08:14:53 Poorly cultivated pool of research participants. And it's because a lot of people are in their pool solely because they they're looking to earn some money.  [Stark, Theodore (Ted)] 08:15:07 There's nothing wrong with that You know, one of the things that experienced researchers learn to do as part of their planning phase.  [Stark, Theodore (Ted)] 08:15:18 Specifically around recruitment. Is a really, really solid screener.  [Stark, Theodore (Ted)] 08:15:24 And the approach that you take to writing a screener is going to vary based on how you're sourcing participants. For example.  [Stark, Theodore (Ted)] 08:15:32 And we don't do it at all here at Deloitte, but some companies use Amazon's Mechanical Turk.  [Stark, Theodore (Ted)] 08:15:39 It's also really, really popular in academia. And you can get a lot of responses really, really quickly. But you got to have a really, really solid screener in place to ensure that the responses you're getting are of quality and also the people that you're getting are  [Stark, Theodore (Ted)] 08:16:00 Fitting into some sort of recruit criteria so that the data that you collect is actually something that can be generalized to the overall user population.  [Stark, Theodore (Ted)] 08:16:11 If you're doing a website redesign or app redesign for a senior living community.  [Stark, Theodore (Ted)] 08:16:20 Doing evaluative research with a bunch of 20-somethings. It's going to get you some data.  [Stark, Theodore (Ted)] 08:16:26 But how representative that data is to the overall population comes into question.  [Stark, Theodore (Ted)] 08:16:32 So, um. Always kind of making sure that you're keeping an eye at least, or you have somebody on your team that's keeping an eye on the responses that are coming in.  [Stark, Theodore (Ted)] 08:16:44 While the study is in flight. A lot of people who aren't as far along on their path with research will try to start doing synthesis and analysis of the recordings as they're coming in.  [Stark, Theodore (Ted)] 08:16:59 And, you know. There's a reason why we normally wait until we're done.  [Stark, Theodore (Ted)] 08:17:07 And some of that is you got to wait for your recruiting partner to make sure that you actually have enough responses that are representative.  [Stark, Theodore (Ted)] 08:17:17 And the reason that I always caution people not to do that is because, you know, kind of doing the analysis in flight is A lot can change.  [Stark, Theodore (Ted)] 08:17:28 And your percentages can change significantly. If you're, you know, depending on how many participants and how many quality responses are in that in your set of data that you're collecting. So if you're doing a study with 10 participants.  [Stark, Theodore (Ted)] 08:17:46 And you start off strong with two participants that just absolutely love the app.  [Stark, Theodore (Ted)] 08:17:50 And then you have three participants that don't love the app, your numbers change very, very quickly.  [Stark, Theodore (Ted)] 08:17:58 So, you know, that's always a challenge. There's always like when you're in field, there's just things happen.  [Stark, Theodore (Ted)] 08:18:07 People not showing up, people not having enough time, or it's an hour long session, they join 30 minutes in.  [Stark, Theodore (Ted)] 08:18:15 And still trying to get the most data that you can You know, given that a lot of it is a lot of it is researchers ability to kind of adapt to to what participants are saying. Not to sound robotic as they're kind of going through a list of questions and make it more conversational than  [Stark, Theodore (Ted)] 08:18:39 Then, you know, an Inquisition Does that help?  [Dulaney, Stephen] 08:18:42 Yes, that helps. What types of research activities do you have you found to be most useful? And I also want to explore like How much data does it generate as you're collecting that data?  [Stark, Theodore (Ted)] 08:18:55 I mean, it's all going to depend.  [Dulaney, Stephen] 08:18:57 Okay, so let's talk about surveys. How do you feel about surveys?  [Stark, Theodore (Ted)] 08:19:01 Surveys have a place. I think they are one of the most widely overused, misused.  [Stark, Theodore (Ted)] 08:19:10 You know tools or quasi methodologies that are out there.  [Dulaney, Stephen] 08:19:15 Okay.  [Stark, Theodore (Ted)] 08:19:16 And largely just because largely just because there is a art and a science to having good survey questions.  [Stark, Theodore (Ted)] 08:19:24 There's an art and a science to having an idea, an approach, a strategy to take the qual and the quant data that you're going to collect from those surveys and turn it into something that can be an insight.  [Dulaney, Stephen] 08:19:40 What types of entries, video interviews or in-person interviews do you like to conduct?  [Stark, Theodore (Ted)] 08:19:47 I mean, these are all going to depend on what the research questions are.  [Stark, Theodore (Ted)] 08:19:51 So, you know, it's It… trying to figure out if you have a car and you are maybe you're a gearhead. So you're underneath the hood and you're playing around with the engine.  [Stark, Theodore (Ted)] 08:20:07 And you make a decision to use one type of coupling over another type of coupling.  [Stark, Theodore (Ted)] 08:20:13 That's you know that's what coupling you use as a gearhead really makes a lot, it's important, right? And maybe you can squeeze performance out of that.  [Stark, Theodore (Ted)] 08:20:22 But the end result is less about what coupling you used and more about what is that experience? What is the performance of the car?  [Stark, Theodore (Ted)] 08:20:33 What is the driving experience for the person behind the wheel? What is the experience for the people that are riding in the car?  [Stark, Theodore (Ted)] 08:20:41 And, you know, so it's like having a debate over what brand of pencil you want to use.  [Dulaney, Stephen] 08:20:47 Okay, so can you give me two different specific examples of research questions that result in two different research techniques.  [Stark, Theodore (Ted)] 08:20:56 No, because you get… You put researchers in a room and ask them to plan a study.  [Stark, Theodore (Ted)] 08:21:05 And if you're nice enough, you're going to give them the research questions.  [Stark, Theodore (Ted)] 08:21:10 But they're going to come up with at least 10 different approaches.  [Stark, Theodore (Ted)] 08:21:14 So it's not this direct correlation that your question is implying.  [Dulaney, Stephen] 08:21:19 Okay, so… How do you decide?  [Stark, Theodore (Ted)] 08:21:24 You decide based on time, based on budget. Based on the constraints that are given to you for that particular project.  [Dulaney, Stephen] 08:21:32 Okay, so let's move along to collection. How much time do you spend during the actual data collection phase and how much of a burden is that or how much of a pain point is that overall in the research activities?  [Stark, Theodore (Ted)] 08:21:45 Say that again.  [Dulaney, Stephen] 08:21:46 I just want to talk about data collection. How much effort do you spend conducting the research?  [Dulaney, Stephen] 08:21:52 And managing the assets that you generate.  [Stark, Theodore (Ted)] 08:21:56 I mean… If you think about this in terms of percentages.  [Stark, Theodore (Ted)] 08:22:02 Okay. You would spend 50% doing your planning.  [Stark, Theodore (Ted)] 08:22:09 25% in the field, which is when data collection would be.  [Stark, Theodore (Ted)] 08:22:14 And the other 25% would be analysis, synthesis, and reporting.  [Stark, Theodore (Ted)] 08:22:23 The managing of assets is a really, really interesting point. And it's one that we as an overall organization do not do a good job of.  [Stark, Theodore (Ted)] 08:22:34 And what I mean by that is we don't have any sort of centralized repository.  [Stark, Theodore (Ted)] 08:22:40 Within a particular project. You know, there are techniques and approaches that we employ here Even as something as simple as giving people a folder structure.  [Stark, Theodore (Ted)] 08:22:56 So, you know, this is where you put your plan. This is where you put your data. This is where you do your analysis.  [Stark, Theodore (Ted)] 08:23:01 And at least that way it makes it easier to find crap.  [Stark, Theodore (Ted)] 08:23:06 But you know, but Generally, I would say 25% of your overall time is when you're in the field and you're collecting the data.  [Stark, Theodore (Ted)] 08:23:16 Normally, the management of that data gets a little messy when you're doing analysis.  [Stark, Theodore (Ted)] 08:23:24 And after you've delivered your findings, you then have time to make sure that you clean up the folder that has all of your data in it or clean up the data store that has all of your data in it.  [Stark, Theodore (Ted)] 08:23:40 At least one of the techniques that we really try to push here is you have a deliverables folder.  [Stark, Theodore (Ted)] 08:23:46 And in the deliverables for folder, you actually supply the client with the final analysis, the final Excel spreadsheets, the final whatever  [Stark, Theodore (Ted)] 08:23:59 That practice, even if you don't necessarily deliver that data, even though you should.  [Stark, Theodore (Ted)] 08:24:06 You know, kind of helps researchers in kind of culling through and finding finding what can be put in archive, what is actually necessary.  [Stark, Theodore (Ted)] 08:24:16 But we as an organization at Deloitte level, we as an organization within AMNC, DP&I, we don't have a good strategy in place In order to kind of hold on to that and manage that data you know once those projects over.  [Dulaney, Stephen] 08:24:35 Okay, so we've gone through the process from start to finish, and you've mentioned some, but do you want to have any call out any specific pitfalls or struggles in the process that that you'd like to see worked out.  [Stark, Theodore (Ted)] 08:24:50 I don't know that they're necessarily pitfalls.  [Stark, Theodore (Ted)] 08:24:57 There's a lot to be said when you're in the field balancing adaptability with some level of standardization.  [Stark, Theodore (Ted)] 08:25:10 And what I mean by that is It's important, especially with the type of research we do.  [Stark, Theodore (Ted)] 08:25:19 To have the, you know, the interview session feel more conversational as opposed to people rattling off questions.  [Stark, Theodore (Ted)] 08:25:29 And… That said.  [Stark, Theodore (Ted)] 08:25:34 You still need to have some level of rigor to ensure that the way that you conducted an interview session a And the way that you conducted an interview session B, you're still getting you know similar levels of data quality  [Stark, Theodore (Ted)] 08:25:54 Because, you know, when you look at that data in aggregate if you don't have some standardization across the board.  [Stark, Theodore (Ted)] 08:26:04 It can really call into question the validity of your data.  [Stark, Theodore (Ted)] 08:26:09 So generally speaking, Stephen, the biggest pitfalls are we don't get enough time to do any of our research.  [Stark, Theodore (Ted)] 08:26:18 Um and usually the areas that get compressed the most are either in the planning or in the reporting and you know there are examples and stories out there. It's like, okay, well, sweet. You just finished usability testing.  [Stark, Theodore (Ted)] 08:26:34 You know, an hour later, the stakeholder from the client says, okay, so when can I see the report?  [Stark, Theodore (Ted)] 08:26:40 Like, well, dude, you just finished data collection of two weeks worth of sessions.  [Stark, Theodore (Ted)] 08:26:44 You know so And there are definitely ways to counterbalance that or at least manage those expectations but Generally speaking, we don't get enough time to do research.  [Dulaney, Stephen] 08:27:01 Okay, so I'm going to switch to a new direction right now. This section is a little faster.  [Dulaney, Stephen] 08:27:05 Can you tell me who on research projects do you work with? Who are your collaborators?  [Stark, Theodore (Ted)] 08:27:13 Normally for me, it would be PPMDs.  [Dulaney, Stephen] 08:27:17 And who do you work for?  [Stark, Theodore (Ted)] 08:27:25 In terms of like Deloitte world, it would be the PPMD or the senior manager that, you know, kind of I interact with but Our work is being done on behalf of the client.  [Stark, Theodore (Ted)] 08:27:38 And that's So I consider that I'm working for them, but through the lens of Deloitte Digital.  [Dulaney, Stephen] 08:27:45 Okay, and who benefits most from your work?  [Stark, Theodore (Ted)] 08:27:49 It depends on the study. Sometimes it can be our internal design team. Sometimes it can be stakeholders. Sometimes it can be both. Sometimes it can be product managers. Sometimes it can be C-suite executives.  [Stark, Theodore (Ted)] 08:28:04 So, you know. It really is going to depend a lot based on the study, based on the research questions and the research objectives.  [Dulaney, Stephen] 08:28:12 Okay, so between those three, your collaborators and your clients and your customers.  [Dulaney, Stephen] 08:28:16 Which one would you rank as most important and which one would you rank next and which one would you rank next?  [Stark, Theodore (Ted)] 08:28:23 It depends. I can't give you a blanket answer on that one.  [Dulaney, Stephen] 08:28:26 Okay, what do you consider the victory event?  [Stark, Theodore (Ted)] 08:28:30 The victory then is presenting quality insights that can help in defining a direction or validating or invalidating designs or an approach or you know Basically.  [Stark, Theodore (Ted)] 08:28:49 Being able to come back to a group of people, be it them Deloitte employees or be them employees of the company that we're doing work for.  [Stark, Theodore (Ted)] 08:28:58 And delivering and delivering insights to help them better understand how they need to adapt or tweak their product.  [Stark, Theodore (Ted)] 08:29:08 Their experience, their strategy. In order to fulfill the idea that technology is there to make people's lives easier, not more difficult.  [Dulaney, Stephen] 08:29:17 Okay, very good. We're going to switch gears again. And this is part of… And in our role as user experience practitioners and user research, we have to educate and we have to evangelize.  [Dulaney, Stephen] 08:29:27 And as part of that process. It's important for us to know how to communicate what we do. So I'd like to start with how you communicate the value of your work to when you're educating and evangelizing.  [Stark, Theodore (Ted)] 08:29:42 Yeah, and we don't do a very good job of it right now.  [Stark, Theodore (Ted)] 08:29:47 A lot of the evangelizing within Deloitte is based on qual.  [Stark, Theodore (Ted)] 08:29:52 So we did this. We got these results. These results may or may not have had some direct or indirect correlation to an overall sales target.  [Stark, Theodore (Ted)] 08:30:06 And the reason why we struggle at doing that.  [Stark, Theodore (Ted)] 08:30:12 Is due in large part because Research is not normally on the project.  [Stark, Theodore (Ted)] 08:30:20 Forts and tired. We get brought on to do generative research. We get brought on to consult. We get brought on to advise a project team.  [Stark, Theodore (Ted)] 08:30:30 And then we roll off. And we may get brought back to do evaluative research, which is great.  [Stark, Theodore (Ted)] 08:30:40 With the exception of longer term engagements or things like AORs, agency of records.  [Stark, Theodore (Ted)] 08:30:47 We aren't always there to see the product actually go all the way through the design and development lifecycle.  [Stark, Theodore (Ted)] 08:30:55 We're not there to see it when it launches. We're not necessarily there to see it post launch.  [Stark, Theodore (Ted)] 08:31:03 And so trying to speak with a partner that maybe doesn't know us that well.  [Stark, Theodore (Ted)] 08:31:11 That becomes a challenge. One of the ways that we try to counterbalance that is in is trying to talk more about the impact to the design.  [Stark, Theodore (Ted)] 08:31:27 And the challenge with that approach is it doesn't always translate easily into dollars and cents.  [Stark, Theodore (Ted)] 08:31:35 But um you know a lot of researchers are uncomfortable with this notion of kind of being shameless self-promoters, but especially in a large company Especially within a consultancy we have to be able to shout from the rooftops when we finish a study. We need to be able to  [Stark, Theodore (Ted)] 08:31:57 Adapt our research, adapt our reporting. To meet the users where they are. And what I mean by that is we may work on an academic paper or an academic style paper.  [Stark, Theodore (Ted)] 08:32:10 We then have to translate that to make sure that that paper and the insights and the impact of those insights is understandable and relatable to the audience in which we are trying to evangelize to.  [Stark, Theodore (Ted)] 08:32:25 So some audiences really like slide decks. Some audiences want a TLDR summary in an email.  [Stark, Theodore (Ted)] 08:32:33 Some people just want it in a teams. Some people like to consume it via a video.  [Stark, Theodore (Ted)] 08:32:39 Some people want to hear about it in terms of a podcast and being able to adapt your story, being able to adapt your the implications of the research that you finished.  [Stark, Theodore (Ted)] 08:32:56 To those audiences is one of the approaches that slowly but surely is starting to chip away at some of these preconceived notions, at least here at Deloitte, in terms of what research is and more importantly, what it is not.  [Dulaney, Stephen] 08:33:10 Okay, so with respect to education and evangelizing, how do you describe what problem you repeatedly solve?  [Stark, Theodore (Ted)] 08:33:21 I mean, we are trying to make sure that technology is easier to use at its core.  [Stark, Theodore (Ted)] 08:33:28 That's what all of our research is done for. Be it generative or evaluative or some variation of You know, both of those.  [Stark, Theodore (Ted)] 08:33:39 So… trying to dig in to specific areas of the experience or specific challenges a company is facing.  [Stark, Theodore (Ted)] 08:33:51 And deliver insights as well as sometimes strategies or recommendations on remediation or how to actually fix the experience or optimize the experience or optimize the strategy.  [Stark, Theodore (Ted)] 08:34:04 That's really at its core what we're doing.  [Dulaney, Stephen] 08:34:07 Okay, so how do you educate educational people, we kind of talked about that one, but anything specific around educating, what are some of the struggles  [Stark, Theodore (Ted)] 08:34:18 I mean, attention is always a struggle. Um and trying to figure out that balance between how much information for the audience that you're presenting to is the right fit.  [Stark, Theodore (Ted)] 08:34:33 You don't want to necessarily go super deep into statistics and the analyses that you may have used in a study if If that's not going to necessarily land for the audience.  [Stark, Theodore (Ted)] 08:34:49 And it's not an easy endeavor to do. Researchers really like to go super deep um but You got to be able to think about what does that look like for a partner? What does that look like for a chief experience officer. What does that look like for a designer?  [Stark, Theodore (Ted)] 08:35:07 And how can you basically translate the super technical, the super deep into language and into a story will have the most impact and value for the audience of what you're trying to evangelize to.  [Dulaney, Stephen] 08:35:25 Okay, what role does the look and feel of your outputs play in your evangelizing and educating?  [Stark, Theodore (Ted)] 08:35:33 That's a hard question for a researcher to answer. But I would say, you know.  [Stark, Theodore (Ted)] 08:35:42 Some projects, some partners, some stakeholders put a higher degree of value on a higher value the physical presentation.  [Stark, Theodore (Ted)] 08:35:53 Those are those typically are stakeholders or projects where they are not as mature in terms of their understanding and use of research.  [Stark, Theodore (Ted)] 08:36:06 But, you know, but Sometimes if your research has uncovered some interesting things.  [Stark, Theodore (Ted)] 08:36:13 You might get asked to put together a deck that's going to go to a board of directors and just again trying to find what that balance is in terms of what all the cool things that you did in your approach and how it was so cool and this and that and the other.  [Stark, Theodore (Ted)] 08:36:32 But, you know, just Sometimes the visual or the appearance has more gravitas than others.  [Stark, Theodore (Ted)] 08:36:41 Sometimes researchers get to set that direction. It's rare, but sometimes we get to do that.  [Stark, Theodore (Ted)] 08:36:46 A lot of times it is more just how how much how much of that aesthetic do you actually need to focus time on? And in most cases where it's you need a really, really strong visual aesthetic.  [Stark, Theodore (Ted)] 08:37:01 That's usually when researchers will reach out to a designer and see if they can help.  [Dulaney, Stephen] 08:37:06 Okay, and the last category for this evangelizing education about user research is what role do the tools that you use and have available play?  [Stark, Theodore (Ted)] 08:37:18 People that are on the sidelines love to talk about tools.  [Stark, Theodore (Ted)] 08:37:23 And they love to talk about the intricacies of one tool versus another tool.  [Stark, Theodore (Ted)] 08:37:29 At the end of the day. The tools are a facilitation engine.  [Stark, Theodore (Ted)] 08:37:36 The role that it plays with experienced researchers is less emphasized than people who are brand new.  [Stark, Theodore (Ted)] 08:37:47 And what I mean by that is like you may use, you know, you may use Qualtrics, you might use users and you might use MUIT, you might use something else but Unless you're trying to evangelize to the stakeholder group.  [Stark, Theodore (Ted)] 08:38:03 The value of a particular platform. The value that it was able to deliver.  [Stark, Theodore (Ted)] 08:38:12 The the tool that you use or going back to the car, you know, the coupling that you elect to use in your engine.  [Stark, Theodore (Ted)] 08:38:23 Is largely something that is reserved for happy hours at research conferences.  [Stark, Theodore (Ted)] 08:38:30 You know. One brand of tire or over another or one one version of a washer that you use or a lug nut So, um.  [Stark, Theodore (Ted)] 08:38:41 If you're trying to emphasize, especially internally here at Deloitte, sometimes we have to index heavily on one tool over the other. And largely that's being done Because we are trying to continue to spread the word about either the availability of the tool  [Stark, Theodore (Ted)] 08:39:00 Or how we as researchers and experienced researchers were able to leverage that tool In order to get to deeper and richer insights in less time.  [Dulaney, Stephen] 08:39:11 Okay, very good. So in the last section, I just had some kind of wandering questions. If you had a magic wand, what one thing would you change about the user research activities and processes that you used.  [Stark, Theodore (Ted)] 08:39:25 It's that we would get brought in earlier in the in the planning and the pursuit.  [Stark, Theodore (Ted)] 08:39:34 Phases.  [Dulaney, Stephen] 08:39:35 Okay, sounds good and um Are there any thanks during a project that research initiative that keep you up at night?  [Stark, Theodore (Ted)] 08:39:45 Not really. I mean, you know.  [Stark, Theodore (Ted)] 08:39:49 There is no study that goes perfectly. And the longer you've been doing this, the more you realize that.  [Stark, Theodore (Ted)] 08:39:56 So, you know. Given the constraints, given the curveballs that you get thrown at you.  [Stark, Theodore (Ted)] 08:40:02 How are you going to adapt? So I don't necessarily know that it keeps me up at night, but you have to be able to embrace and accept that it's never going to go exactly as planned.  [Dulaney, Stephen] 08:40:18 Okay, and the last question, if I talk to one of your collaborators and I say, please describe Ted to me in one word.  [Dulaney, Stephen] 08:40:25 Which one word would you want them to tell me?  [Stark, Theodore (Ted)] 08:40:30 Lord. Methodical.  [Dulaney, Stephen] 08:40:33 Sounds good. Are there any questions that you expected me to ask that I haven't asked so far?  [Stark, Theodore (Ted)] 08:40:38 No.  [Dulaney, Stephen] 08:40:39 Okay, that sounds good. That's kind of the end of the question part of the interview. We can either do a little evaluative research, but I actually ended up breaking my tool because after these research questions, I've learned so much  [Dulaney, Stephen] 08:40:51 I threw everything away and i'm starting to from scratch.  [Dulaney, Stephen] 08:40:56 I don't know if you want to do that. I can kind of show you two different things we're working on the Sidekick tools, which you upload transcripts to and then it does various forms of animal analysis.  [Dulaney, Stephen] 08:41:06 And then most recently, I've started to break down interviews into semantic tagging so that it'll go through and kind of take a paragraph of what you say.  [Dulaney, Stephen] 08:41:16 And add a frustration and add maybe a feature, what you talk about.  [Dulaney, Stephen] 08:41:20 And so I'm kind of reorganizing the way we analyze transcripts.  [Dulaney, Stephen] 08:41:24 And that is what broke everything. But it is pretty promising.  [Stark, Theodore (Ted)] 08:41:28 So how is this different from what Dovetail offers?  [Dulaney, Stephen] 08:41:28 Any of that?  [Dulaney, Stephen] 08:41:32 You know. I haven't studied dovetail and I haven't studied uh That's set on purpose because I'm trying not to be influenced, but I do plan with Kinsha to drop all of our interviews videos into Dovetail and go through that phase.  [Dulaney, Stephen] 08:41:46 This research effort goes through the end of May. And so I'm basically collecting up to 20 interviews with different researchers at this phase. And then I'm kind of building out the tool based on If the question is if you had a digital assistant, a digital research and interview assistant, what would it be?  [Stark, Theodore (Ted)] 08:42:07 Okay.  [Dulaney, Stephen] 08:42:08 And so that's kind of where we're… where we're focusing our time.  [Dulaney, Stephen] 08:42:14 And then the other initiative that's actually funding this that I kind of need to keep aware of is the The Sidekick Tools team.  [Stark, Theodore (Ted)] 08:42:25 Yep.  [Dulaney, Stephen] 08:42:26 Because they're gracious enough to allow me to work with them.  [Dulaney, Stephen] 08:42:31 And so we're creating a series of Sidekick side.  [Dulaney, Stephen] 08:42:37 Are based off Daria where you would actually upload a transcript And then that's one. Are you seeing the screen?  [Stark, Theodore (Ted)] 08:42:46 Yeah. I mean, the one of these quote unquote tools that A lot of people don't necessarily know about a lot of people don't necessarily know about I have found it to be found to be mildly useful is the research assistant.  [Dulaney, Stephen] 08:42:47 Okay.  [Stark, Theodore (Ted)] 08:43:04 I don't like I don't like how I can't tell it what areas to go or what types of areas of the web.  [Dulaney, Stephen] 08:43:05 I used the research assistant. I used it last night.  [Stark, Theodore (Ted)] 08:43:17 So like if I'm doing UX research, I don't give a shit about Dow Jones.  [Stark, Theodore (Ted)] 08:43:22 I wanted to hit Google Scholar. I wanted to hit some of the open repos.  [Stark, Theodore (Ted)] 08:43:29 And, you know. It's nice. It's great that it kind of puts together, you know, it looks really pretty.  [Stark, Theodore (Ted)] 08:43:39 I like that it gives the references. I wish I could tell it what type of reference or what reference models I want.  [Stark, Theodore (Ted)] 08:43:47 So do I want this? Formatted for APA? Do I want this formatted for ACM. Do I want this formatted for You know, some of the other common ways But, you know, the The insights are, they're okay.  [Stark, Theodore (Ted)] 08:44:09 I think that it's a little reaching at times but You know, there's a reason why it's hidden over there on the left-hand side.  [Stark, Theodore (Ted)] 08:44:20 There are definitely some other tools that are out there outside of Deloitte that are much better at that stuff.  [Dulaney, Stephen] 08:44:24 Do you use the deep research tool? In OpenAI?  [Stark, Theodore (Ted)] 08:44:29 Yeah, I think that one's pretty good. Notebook LM in terms of doing some of the more qual heavy analysis I think is… is on par or better than like Dovetail um Dovetail is interesting because it's really a question when people tell me that they're using Dovetail, I always ask them in what capacity? Are they using it for qual analysis? Because it's really good at that.  [Stark, Theodore (Ted)] 08:44:58 Or are they using it for more of that research repo? And sometimes it's both, but The research repo is kind of, it's a really, really strong suit of dovetail.  [Stark, Theodore (Ted)] 08:45:11 And as you're talking about tagging and all this other stuff, Dovetail has all of that stuff baked into its qual analysis, which is why I was asking about it.  [Dulaney, Stephen] 08:45:19 Yeah. So this basically takes his interview.  [Stark, Theodore (Ted)] 08:45:22 But you know.  [Dulaney, Stephen] 08:45:25 And then it takes each little snippet at the beginning and the end. That's what Dovetail does, and then captures that snippet. And then it does its price, it's conviction, and then we kind of fill in these tags as you go.  [Dulaney, Stephen] 08:45:36 And so, and this is a model I'm playing with because you end up like initially I end up with this kind of transcript out of, and this is straight out of like.  [Stark, Theodore (Ted)] 08:45:37 Mm-hmm.  [Dulaney, Stephen] 08:45:44 What we're doing today. So I'll get this from from and then you do basically some sentiment analysis. There are various models I'm learning huggy face, blah, blah, blah. And they have like this one is super atomic.  [Stark, Theodore (Ted)] 08:45:46 You know  [Dulaney, Stephen] 08:45:57 This is a question that kind of built Workday that was great and then it breaks that in and starts to give it neutral. So this one is a little too atomic.  [Dulaney, Stephen] 08:46:08 And then also I lost the speaker. This should say Suzette Whereas the Jesse one is… It'll take some big paragraphs. If I had this wrapping, it would be, and then it gives you neutral stakeholder planning, research planning type stuff.  [Dulaney, Stephen] 08:46:22 So this is like having the machine go through and kind of break it up in what it thinks is important. They call it chunking.  [Stark, Theodore (Ted)] 08:46:28 Mm-hmm.  [Dulaney, Stephen] 08:46:28 And so I think there's some promise in there. I think in general, the sweet spot is to try to manage the archive and manage the assets And where I am right now is I broke everything. So this is the tool that basically has the archived cards. And these are the five interviews that I have. I took all the green eggs and ham and stuff out because they're done. I passed that phase.  [Dulaney, Stephen] 08:46:52 So these are actually hour-long interviews similar to what we did today.  [Dulaney, Stephen] 08:46:56 And then I'm trying to… This is like your transcript, the raw one. And the raw one's good if you want to throw it to an AI to get like a a persona and there's probably other types of analysis that I'd need to pull.  [Dulaney, Stephen] 08:47:12 In specific, what type of analysis, you say statistical what kind of statistical report would you like to see out of a group of interviews?  [Stark, Theodore (Ted)] 08:47:27 Interesting.  [Dulaney, Stephen] 08:47:29 Because that's all based on the prompting and I need to kind of do best practices and then go through and play with the prompting and then I'll feed it like 10 or 12 interviews and then generate a statistical report and then see if we like it.  [Dulaney, Stephen] 08:47:40 So the first two that were easy are personas and journey maps. The others are possible. So these little cards, you have the metadata.  [Dulaney, Stephen] 08:47:47 I probably need to start thinking about the types of demographic data that I want to collect.  [Dulaney, Stephen] 08:47:54 More seriously. And then you have the analysis. This is the one where you can actually go through. This is the statement from Suzette and I could hit the edit button.  [Dulaney, Stephen] 08:48:03 And then edit and add the tags. But you can see how long this is because it broke her super tiny, whereas Jesse's, it only gave me nine chunks in an hour interview. And I was like, there's clearly more than nine important things Jesse said in an hour-long interview. So that's where I am. That's the state of the  [Dulaney, Stephen] 08:48:22 The research right now. But basically, I threw out the homepage because people don't in the The forms are just not, I think of this creating a research study one way. Everyone does their own thing.  [Dulaney, Stephen] 08:48:34 So I'm leaning right now going to an interview style for setting up a project to let the person Whether it's a discovery project or a research program.  [Dulaney, Stephen] 08:48:45 And just do a quick interview and capture their thoughts. And then go from there and then focus on capturing transcripts and analyzing transcripts and and storing as a repository transcripts. I think that's one thing Dovetail does nice is you can actually search Dovetail and you can sneak into all the videos from other Deloitte people.  [Dulaney, Stephen] 08:49:05 I don't know if it's intentional. But I do see, you know, I was able to find pretty good results on financial analyst from interviews I didn't conduct, but were related to financial analysts.  [Dulaney, Stephen] 08:49:18 That's a bug or a feature, but… It's an observation right now.  [Stark, Theodore (Ted)] 08:49:21 I mean, it's because we're all using the same repo instance.  [Dulaney, Stephen] 08:49:26 Yeah. So I don't really have, you know, I've kind of ended up realizing that the needs are different.  [Dulaney, Stephen] 08:49:36 And so I'm trying to, like you say, wait till I get some more But I have really found fascinating results.  [Stark, Theodore (Ted)] 08:49:44 Yeah.  [Dulaney, Stephen] 08:49:44 And I'll read those out to you. Everyone has a, like we do rely on the art more than we put potentially think. And there's these deep reservoirs of experience that is different and distinct in each researcher.  [Dulaney, Stephen] 08:49:56 That is the secret to how they've succeeded and been here so long at Deloitte.  [Dulaney, Stephen] 08:50:01 And you don't know what it is, but you know it when it starts to pop up during the interview. And that's when I try to get quiet and listen.  [Stark, Theodore (Ted)] 08:50:03 Yeah.  [Stark, Theodore (Ted)] 08:50:10 Nice. All right, man. I hope this was helpful.  [Dulaney, Stephen] 08:50:15 Super helpful.  [Stark, Theodore (Ted)] 08:50:18 Yeah. And please let me know if there's anything else I can do to help. Otherwise, I'm going to hop.  [Stark, Theodore (Ted)] 08:50:24 You go splash some water on my face before my 8 a.m.  [Dulaney, Stephen] 08:50:27 Okay, thanks for taking the time to share your story with me. I enjoyed it very much.  [Stark, Theodore (Ted)] 08:50:31 Yeah, man. All right. Take care, my friend.  [Dulaney, Stephen] 08:50:32 I'll keep you posted on our progress. Thank you.  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Ted Stark",
      "age": "55-64",
      "gender": "male",
      "location": "Denver, CO",
      "occupation": "Researcher",
      "industry": "Consulting",
      "experience": "23",
      "education": "masters"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  },
  "created_at": "2025-04-23T10:20:20.718017"
}