{
  "id": "814215bf-7d7d-4fb5-a915-87022085ea94",
  "transcript_name": "Suzette's UXR Interview",
  "project_name": "Daria Research of Researchers",
  "interview_type": "Persona Interview",
  "project_description": "We are researching how user researchers conduct discovery activities and plan for user research, from awareness and identifying research questions to research design, execution, analysis, and delivery.",
  "date": "2025-04-23T10:17:47.781302",
  "transcript": "[Dulaney, Stephen] 13:43:31\nTesting the transcript. Is the transcript working? Yes.\n\n[Dulaney, Stephen] 13:43:37\nThis interview will be with Suzette Ballet. She is a researcher.\n\n[Dulaney, Stephen] 13:43:44\nThe date is Friday, April 18th, 2025.\n\n[Dulaney, Stephen] 13:46:17\nHello. You don't have to go scream on if you don't want to. I just put it on.\n\n[Dulaney, Stephen] 13:46:22\nYes. That's fine. We can go screen off.\n\n[Ballew, Suzette] 13:46:23\nI look terrible.\n\n[Dulaney, Stephen] 13:46:28\nI may. I have a transcript. I might go ahead and video if that's okay. Do I have your permission to keep a transcript of this testing session?\n\n[Ballew, Suzette] 13:46:36\nSure.\n\n[Dulaney, Stephen] 13:46:37\nAnd then I may go ahead and record because I may play with dovetail later.\n\n[Dulaney, Stephen] 13:46:43\nOkay, thank you for participating in the user research about researchers.\n\n[Dulaney, Stephen] 13:46:49\nYou're hoping to learn a lot about how you plan organize and activate your research activities. We want to learn about some of your pain points and some of your frustrations.\n\n[Dulaney, Stephen] 13:46:59\nBut let us start by saying, what is your name and what is your current role?\n\n[Ballew, Suzette] 13:47:04\nSuzette Ballou, a senior ux designer researcher Product discovery specialist.\n\n[Ballew, Suzette] 13:47:12\nAt Deloitte.\n\n[Dulaney, Stephen] 13:47:12\nCan you tell me about a few of your past positions that you've had that helped you prepare and be successful at your current role as a researcher.\n\n[Ballew, Suzette] 13:47:21\nHow do you mean?\n\n[Dulaney, Stephen] 13:47:23\nWhat got you ready for the work you do today so well?\n\n[Ballew, Suzette] 13:47:28\nI don't know. My curiosity of how things work and trying to make them better.\n\n[Dulaney, Stephen] 13:47:35\nOkay, that's good. So with respect to your role as a researcher, what is your primary goal?\n\n[Ballew, Suzette] 13:47:44\nTo design products that actually work for humans and that are not controlled by bias of stakeholders, of developers, and of researchers.\n\n[Dulaney, Stephen] 13:47:57\nOkay, very good. When you're trying to pursue your primary goal, are there some key frustrations that you encounter?\n\n[Ballew, Suzette] 13:48:04\nYes. Stakeholders and developers are always my key frustrations.\n\n[Dulaney, Stephen] 13:48:10\nThat sounds great. So we're going to move on to a little bit Can you tell me a little bit about how your role works today As a user researcher, do you have the tools that you need and what tools might you want?\n\n[Dulaney, Stephen] 13:48:22\nThat you don't have.\n\n[Ballew, Suzette] 13:48:26\nI feel like I could have some more AI tools to do um synthesis and synthesis and research, better research, more accurate research, usable research instead of you know like this might or might not be right when you check it out on AI\n\n[Ballew, Suzette] 13:48:50\nBecause they're always like with the AI these days, there's a There's a trust but verify kind of a deal like it might not be correct. So it'd be nice if it was trustworthy.\n\n[Dulaney, Stephen] 13:49:06\nOkay, that sounds good. So in the next, what are your vision for the next year with tools to help you do this? What do you think that you would see or what would What would you like to be added to your suite? And that's a good one as far as like hallucination validation.\n\n[Ballew, Suzette] 13:49:07\nAnd you didn't have to verify it.\n\n[Dulaney, Stephen] 13:49:21\nAny others?\n\n[Ballew, Suzette] 13:49:24\nUm…\n\n[Ballew, Suzette] 13:49:29\nI don't know. The biggest tool that I have right now is my brain.\n\n[Dulaney, Stephen] 13:49:33\nOkay, well, that's going to be the biggest story even in the future. So tell me a story about a user research project that you thought was going to be swimmingly and easy.\n\n[Dulaney, Stephen] 13:49:41\nBut ended up being frustrated no matter how hard you tried, it just became a burden at every step.\n\n[Ballew, Suzette] 13:49:50\nUm… I would have to say Eli Lilly.\n\n[Ballew, Suzette] 13:49:57\nJust because… I have a specific method of you know doing workshops and gathering data And it generally works great, but the people on your team have to be on board with it.\n\n[Ballew, Suzette] 13:50:15\nYou know, like the product manager and the product manager that i had was just a total hardcore dev person and couldn't think outside of that box.\n\n[Ballew, Suzette] 13:50:28\nAnd that was very frustrating. But everybody else on the team did great but You know, if people can't open up their minds a little bit to see what the art of the possible.\n\n[Ballew, Suzette] 13:50:43\nIs then that that's very frustrating.\n\n[Dulaney, Stephen] 13:50:46\nOkay, that's a very good story. Can you think of another story that you thought it was going to be hard to get research done and it turned out to just have a happy ending and everybody was very appreciative of your contribution?\n\n[Ballew, Suzette] 13:50:57\nYeah, Graybar. Great Bar Electric.\n\n[Ballew, Suzette] 13:51:02\nThat one went swimmingly well. Everybody understood my methods. They did the work that I asked them to. We came up with some really great wireframes for the employee portal and an excellent recommendation for the team.\n\n[Ballew, Suzette] 13:51:21\nWe were chosen to be chosen explore options of a very customized, personalized employee portal.\n\n[Dulaney, Stephen] 13:51:21\nHow?\n\n[Ballew, Suzette] 13:51:29\nKind of built off of Workday. That was great.\n\n[Dulaney, Stephen] 13:51:34\nLet's think about that project and um When you were first asked to do the project, what are the steps that you went through? What was your process to plan and design your experimental Research.\n\n[Ballew, Suzette] 13:51:48\nFirst, I gathered as much information from the client as we could about their system. It was for the Graybar Connect and Graybar.\n\n[Ballew, Suzette] 13:51:57\nYou know what they currently use and what system it was going to be integrated with and all the technical feasibility and stuff.\n\n[Ballew, Suzette] 13:52:09\nAnd they were working with a certain certain product, I can't remember the name of now and transferring from workday But gathered all the technical feasibility that the product could do layout wise and functionality wise and widget wise and then\n\n[Ballew, Suzette] 13:52:33\nPut all of those down on cards, every single piece of functionality that it could do.\n\n[Ballew, Suzette] 13:52:38\nAnd then thought of thought workshopped with tara on extra things that it couldn't do that could be customized.\n\n[Ballew, Suzette] 13:52:47\nAnd then created a huge card sort activity and interviewed 20 of their employees through the card sort And then prioritize the cards as an order of priority of what would help them through their workday.\n\n[Ballew, Suzette] 13:53:04\nAnd that's basically what we did for The activity that we did for that. We only have one month to do this project. So it was very short and quick.\n\n[Ballew, Suzette] 13:53:17\nIt was me and those me her and we did a great job And that particular activity would agree.\n\n[Dulaney, Stephen] 13:53:21\nNow, do you have a list of ask when you start for the part where you want to kind of do background How do you organize your requests or how long does it take to kind of put together what you're needing and how much time do you spend on kind of gathering and analyzing\n\n[Dulaney, Stephen] 13:53:35\nWhatever you receive from the client.\n\n[Ballew, Suzette] 13:53:39\nIt depends on how big my team is and if I have to do it by myself, of course, it takes longer. But if you have a team, you can delegate and things go quicker. But I generally fast track everything as much as possible.\n\n[Ballew, Suzette] 13:53:51\nAnd try to utilize the team and delegate to where towards people's strengths. If somebody is particularly fond of design, I will let them do that and I will do more of the grant work if they like doing the interviews, I will let them do that.\n\n[Ballew, Suzette] 13:54:07\nDo the stuff that they don't like to do from a leadership perspective i always pick the stuff that my team doesn't like to do because I can actually do all of it, right?\n\n[Dulaney, Stephen] 13:54:17\nOkay.\n\n[Ballew, Suzette] 13:54:18\nThat's how I expedite projects.\n\n[Dulaney, Stephen] 13:54:21\nAnd did you do formal stakeholder interviews or were you just kind of collecting along the way?\n\n[Ballew, Suzette] 13:54:26\nWell, could you repeat that? You bleeped out a little.\n\n[Dulaney, Stephen] 13:54:29\nDid you do formal interviews with stakeholders or did you just kind of collect and listen as you're having your kickoff week?\n\n[Ballew, Suzette] 13:54:37\nNo, we did live interviews and walked them through the card sorts and You know?\n\n[Dulaney, Stephen] 13:54:43\nNow, are those different from the user interviews or those? I mean, I'm considered stakeholders\n\n[Ballew, Suzette] 13:54:49\nWell, there are all kinds of stakeholders because they're employees of the company.\n\n[Dulaney, Stephen] 13:54:53\nOkay, interesting.\n\n[Ballew, Suzette] 13:54:54\nSo it's kind of… a see a B2E, business to employee.\n\n[Ballew, Suzette] 13:55:02\nRight. So, but we've had 20 different employees.\n\n[Ballew, Suzette] 13:55:06\nAnd we went through card sorts with him via video And in like figma jam And walk them through the activity, ask them a bunch of questions, took notes, synthesized the data, and came up with our recommendations.\n\n[Dulaney, Stephen] 13:55:21\nSo how soon did you realize that a card sort would be one of the activities you would require?\n\n[Ballew, Suzette] 13:55:27\nPretty much right away because it was a feature based thing And a lot of what was out of the box, but then there was some room for customization and You know, picking and choosing the features that are most important\n\n[Ballew, Suzette] 13:55:45\nIs easily done in a card sort and then a tree test of the prioritization of them.\n\n[Ballew, Suzette] 13:55:52\nMore than like a user interview when you're asking questions of a different type of nature to come up with completely 100% customized features or solutions.\n\n[Dulaney, Stephen] 13:56:05\nOkay. What kind of artifacts or what kind of reports did you generate based on the card sort?\n\n[Ballew, Suzette] 13:56:05\nSo…\n\n[Ballew, Suzette] 13:56:13\nWe did user personas we did different prototypes for um target state and then, you know, a future state like a pared down state that they could probably achieve pretty easily than a really advanced state that would make everybody that we interviewed super happy because they would all get what they want.\n\n[Ballew, Suzette] 13:56:37\nBasically just used Figma. And our brains.\n\n[Dulaney, Stephen] 13:56:42\nOkay, so how much time did you spend collecting versus analyzing? Just a rough guess.\n\n[Ballew, Suzette] 13:56:50\nUm… Probably about 70 30\n\n[Dulaney, Stephen] 13:56:57\nOkay, 70 collecting 30 analyzing. And you jump straight to Figma, so you're also kind of kind of building final deliverables at the same time as you're like analyzing.\n\n[Ballew, Suzette] 13:57:00\nYeah.\n\n[Ballew, Suzette] 13:57:08\nYeah, so we would do our workshops in Figma jam do our actual wire framing and other stuff in Figma, but Figma Jam is a great tool to where you can literally create anything you want. It's a lot like marrow so\n\n[Dulaney, Stephen] 13:57:23\nOkay. Are there any pitfalls in your process that you see that you might like smoothed out?\n\n[Ballew, Suzette] 13:57:29\nUm… Just as the ones I mentioned before.\n\n[Dulaney, Stephen] 13:57:33\nOkay, did you consider any actuals to participate or compare your card sort with against the humans?\n\n[Ballew, Suzette] 13:57:41\nNot at that time.\n\n[Dulaney, Stephen] 13:57:42\nOkay, too early. So we'll move on to another selection. I want to ask you about on a typical project, who do you consider your collaborators?\n\n[Dulaney, Stephen] 13:57:52\nWho do you consider your client? That's who you work for and who do you consider who benefits most from what you do? So we'll start with collaborators. Who do you work with?\n\n[Ballew, Suzette] 13:58:00\nRepeat that whole statement.\n\n[Dulaney, Stephen] 13:58:02\nOkay, so we're just kind of talk about people and try to build a little model. Who are the people that you work with, your collaborators? And just kind of roles in a typical project.\n\n[Ballew, Suzette] 13:58:13\nAnd my squad model approach, it would be a product owner or manager and a tech lead and UX people.\n\n[Dulaney, Stephen] 13:58:24\nWho do you work for?\n\n[Ballew, Suzette] 13:58:31\nI don't understand the question. I work for Deloitte.\n\n[Dulaney, Stephen] 13:58:33\nOkay, okay. So is any particular person that you kind of would consider that you report up to or needs to keep track of your work.\n\n[Ballew, Suzette] 13:58:46\nNot really. And the project delivery model, every time we change project, we change our coach\n\n[Dulaney, Stephen] 13:58:47\nAnd then we have rate matrix experiments. And then who do you think benefits most Exactly. Who do you think benefits most from from the work you do.\n\n[Ballew, Suzette] 13:58:59\nUsers.\n\n[Dulaney, Stephen] 13:59:00\nOkay. So of those three, we only have two with you. Basically, your product team, which is your product owner, your tech lead and your UX person, and then the users.\n\n[Dulaney, Stephen] 13:59:08\nHow would you, who was first in that rating most important to you?\n\n[Ballew, Suzette] 13:59:13\nUsers.\n\n[Dulaney, Stephen] 13:59:14\nYou would be surprised how many people have used our research and they missed the answer to that question.\n\n[Ballew, Suzette] 13:59:22\nI'm probably one of the most user centric. You add people you offer me.\n\n[Dulaney, Stephen] 13:59:25\nYes. And I just have to bite my time when I'm staying.\n\n[Dulaney, Stephen] 13:59:30\nOkay, so we're going to go through a few parts of the process when you kick off a project. When you get a new project, how much time or what kind of tools to use to analyze the intake of the of the discovery process, which in an ideal world\n\n[Ballew, Suzette] 13:59:44\nI use Figma and Sidekick a lot.\n\n[Dulaney, Stephen] 13:59:48\nOkay.\n\n[Ballew, Suzette] 13:59:50\nEspecially if it's like products that I don't understand the full breadth of, like maybe out of my depth in a financial nature Or, you know.\n\n[Dulaney, Stephen] 14:00:01\nAnd when in the cycle do you start to identify with what kind of identify what kind user interviews you're going to do. And then how do you go about planning your script\n\n[Ballew, Suzette] 14:00:01\nI will…\n\n[Ballew, Suzette] 14:00:12\nIt depends, again, like on the product. And what the goal is for the product, what kind of user research you're going to do if it's, you know.\n\n[Ballew, Suzette] 14:00:23\nUsability testing that's one thing or if it's a brand new concept where you're coming up with features and trying to solve problems to create like an application like kp for instance we did all kinds of Different types of user interviews over there\n\n[Ballew, Suzette] 14:00:45\nWith patients trying to figure out how might we help them with things like care plan gaps or medication adherence or you know how we might help them take control over their chronic diseases, which is much different than How might we help somebody improve their workday, right?\n\n[Ballew, Suzette] 14:01:09\nSo in those interviews it was very, you know, very personal type questions that we would ask about their life And, you know.\n\n[Ballew, Suzette] 14:01:22\nTheir habits and stuff like that because we were trying to affect behavior change but on gray bar We were just trying to figure out what the priorities were for them in their job to help them do their job better and\n\n[Dulaney, Stephen] 14:01:27\nOkay.\n\n[Ballew, Suzette] 14:01:37\nAn employee portal can offer to do that.\n\n[Dulaney, Stephen] 14:01:42\nSince my dad's phone. So when you're conducting your interviews What kind of tools do you have to kind of ask the questions, record the answers?\n\n[Dulaney, Stephen] 14:01:52\nOther tools that you need, tools that you like.\n\n[Ballew, Suzette] 14:01:55\nI prefer Zoom for user interviews and I just take straight notes on the Figma Jamboard.\n\n[Dulaney, Stephen] 14:02:02\nOkay.\n\n[Ballew, Suzette] 14:02:03\nAnd I generally read my script out of Microsoft Word.\n\n[Dulaney, Stephen] 14:02:06\nOkay, sounds good. And then how many files do you generate and how do you organize your files?\n\n[Ballew, Suzette] 14:02:13\nWhat do you mean files?\n\n[Dulaney, Stephen] 14:02:15\nLike transcripts, videos, post-interview notes or\n\n[Ballew, Suzette] 14:02:20\nWell, like I said, I just take notes on a Figma Jam board and Then… Sometimes I will feed those notes into like sidekick or something to find commonalities or stuff like that. Or you can do it mentally even by hand, like old school\n\n[Dulaney, Stephen] 14:02:39\nOkay, that sounds good. So which of those um Are there pain points or frustrations or opportunities to make that better?\n\n[Ballew, Suzette] 14:02:48\nYeah, one pain point would be it's kind of hard to like get that information into an AI.\n\n[Ballew, Suzette] 14:02:56\nI didn't use the transcripts that would have been a better idea\n\n[Dulaney, Stephen] 14:03:00\nOkay, and then if you had them, is there like if you could do a lot of stuff in AI, are you able to get it into Figma in a usable form or is it manual?\n\n[Dulaney, Stephen] 14:03:09\nCheers. It's a leading question.\n\n[Ballew, Suzette] 14:03:09\nI don't know. I haven't tried it yet.\n\n[Dulaney, Stephen] 14:03:15\nSo what about recruiting? Who takes care of your recruiting? Are there any pain points around and how much time do you invest in recruiting?\n\n[Ballew, Suzette] 14:03:22\nWell, generally the clients are Generally, the clients are, you know, setting up if it's like BDE, they already have the employee, so they would pick the employees and like at kp we had they had a research department where they would\n\n[Dulaney, Stephen] 14:03:23\nAwesome. Yeah, we've got that.\n\n[Dulaney, Stephen] 14:03:31\nHow are you going?\n\n[Ballew, Suzette] 14:03:41\nYou know um recruit from their members list.\n\n[Ballew, Suzette] 14:03:45\nGenerally, it's the client. That gives you access to who you're interviewing.\n\n[Dulaney, Stephen] 14:03:51\nWell, I know. Okay. I know we've been kind of remote lately, but can you remember field work and what are your feelings about field work as a researcher?\n\n[Ballew, Suzette] 14:04:01\nWhen I was at HMH, which is Hufton, Mifflin, Harcourt. We were designing or redesigning textbooks into digital learning objects And for the younger kids, it's really hard to interview them because they're, you know, they're kids. So we had to do a lot of ethnographical research with them and\n\n[Dulaney, Stephen] 14:04:12\nOkay.\n\n[Dulaney, Stephen] 14:04:18\nYeah.\n\n[Ballew, Suzette] 14:04:23\nEye trace studies and i trace stuff like that those are amazingly fun to me.\n\n[Dulaney, Stephen] 14:04:28\nI'm going to stop. Is there any kind of digital equivalent to that today that is kind of similar to field work?\n\n[Ballew, Suzette] 14:04:38\nI don't think so. Not for ethanographical, who's literally… it's an observational study, right?\n\n[Dulaney, Stephen] 14:04:45\nYep, yep. Just checking, just checking. What about… Do you use the same kind of research design? Do you have like one type of questionnaire that you modify?\n\n[Dulaney, Stephen] 14:04:56\nOr do you kind of redesigned based on, or do you have a set number that you pull one up right away in your head. How do you design the actual kind of research part?\n\n[Ballew, Suzette] 14:05:06\nWell, I have a kind of a cadence as a framework that I use like you know, getting the subject kind of acclimated to what they're about to do.\n\n[Ballew, Suzette] 14:05:21\nAsking him a few questions to get them in the mindset. But as far as the actual questions, it is 100% solely debased on the product and what you're trying to achieve.\n\n[Ballew, Suzette] 14:05:34\nThat part is always custom. The framework is kind of the same\n\n[Dulaney, Stephen] 14:05:36\nAnd so you kind of, do you have any kind of um do you have any kind of files or assets You can be able to share their like interview guides, tips, or is it all just instinctual\n\n[Ballew, Suzette] 14:05:50\nInstinctual. I've been doing it, so I don't really…\n\n[Dulaney, Stephen] 14:05:51\nSo I had that for you. Okay, so if you had a magic wand What one thing would you change about your user research activities from when you were asked to do it all the way through planning and enacting analysis and deliverables.\n\n[Ballew, Suzette] 14:06:11\nAsk me that one more time.\n\n[Dulaney, Stephen] 14:06:12\nIf you had a magic wand, what one thing would you change?\n\n[Ballew, Suzette] 14:06:25\nI would have… the user research be prioritized over user stories and sold into the projects up front instead of an afterthought when we are brought in too late to be effective.\n\n[Dulaney, Stephen] 14:06:43\nVery good one. If I go to your customers. Which are your users. And I say, can you please describe Suzette to me in one word? What one word would you want them to tell me?\n\n[Ballew, Suzette] 14:06:54\nEmpathetic.\n\n[Dulaney, Stephen] 14:06:55\nOkay, that's a good one. So that's the end of kind of the question. Are there any questions that you expected me to ask that I haven't asked so far?\n\n[Ballew, Suzette] 14:07:02\nNope, I really had no idea what we were doing today so\n\n[Dulaney, Stephen] 14:07:05\nOkay. Do you want to get into the evaluative part and see where I am and just kind of give some feedback to what… what screens are today and what screens? I know there's some errors in them, but maybe you'll point them out and maybe it would be the same or different.\n\n[Ballew, Suzette] 14:07:21\nSure. You're running the show.\n\n[Dulaney, Stephen] 14:07:24\nI'm not used to that. Okay, are you seeing the screen?\n\n[Dulaney, Stephen] 14:07:31\nNo, that's the wrong screen, right?\n\n[Dulaney, Stephen] 14:07:38\nYou'd think we learn how to get desktops, too. I don't see the ring. It should be showing. Oh, that's showing it there.\n\n[Ballew, Suzette] 14:07:38\nI'm going to mute because I have to sneeze.\n\n[Dulaney, Stephen] 14:07:44\nSo yeah, that's showing. Are you seeing my mouse over here?\n\n[Dulaney, Stephen] 14:07:48\nWhat are you looking at?\n\n[Dulaney, Stephen] 14:07:56\nAre you there?\n\n[Ballew, Suzette] 14:08:01\nOne second.\n\n[Ballew, Suzette] 14:08:11\nSorry, I had a sneezing fit. I had to\n\n[Dulaney, Stephen] 14:08:12\nSo I guess the question here is if you had a digital assistant, it was like your research and interview assistant.\n\n[Dulaney, Stephen] 14:08:18\nWhat would you like to see on your homepage?\n\n[Ballew, Suzette] 14:08:34\nI don't understand what I'm looking at here.\n\n[Dulaney, Stephen] 14:08:36\nWell, this is the homepage of a research assistant in um Probably not designed that well right now. So you're looking at the recent interviews.\n\n[Dulaney, Stephen] 14:08:44\nThat we conducted. This is… from yesterday. This is T's user research interview.\n\n[Dulaney, Stephen] 14:08:51\nThen you have the analysis and the metadata. That you can look at from From there, these are the um Oh, I got him.\n\n[Dulaney, Stephen] 14:09:05\nThese are the recent personas that we created. So it's just kind of like what you did.\n\n[Dulaney, Stephen] 14:09:10\nThese are the journey maps. That you created. So it's like your research assistant homepage.\n\n[Ballew, Suzette] 14:09:17\nAre all of these cards a different project?\n\n[Dulaney, Stephen] 14:09:20\nYes, they just have the same name because I'm doing I've resorted to reading green eggs and ham into the interview guide.\n\n[Dulaney, Stephen] 14:09:27\nBecause I don't have things to say.\n\n[Dulaney, Stephen] 14:09:32\nSo this is all your research. Yours will go here next.\n\n[Dulaney, Stephen] 14:09:35\nAnd then I'll start to have real This is the research this is the Goals, streamline research possibilities to enhance to maintain relevance and compete. So this is the one from yesterday.\n\n[Dulaney, Stephen] 14:09:50\nOne interview. So just in general, she had a research assistant\n\n[Ballew, Suzette] 14:09:55\nI'm thinking. So.\n\n[Ballew, Suzette] 14:10:01\nI would like, you know, where are we defining in solving the problem statement and the hypothesis.\n\n[Dulaney, Stephen] 14:10:09\nOkay, good, good. So specifically like maybe a actual project question page.\n\n[Dulaney, Stephen] 14:10:17\nLike, what am I actually here for?\n\n[Ballew, Suzette] 14:10:21\nYeah, so… I wouldn't break it down by recent interviews, personas, or journey months. I would break it down.\n\n[Ballew, Suzette] 14:10:29\nBut just projects projects only on the dashboard. And then drill down into a product and then have your workshops your problem statement you're a problem statement user journeys, your synthesis you know everything contained under that one project\n\n[Dulaney, Stephen] 14:10:49\nOkay, very good. I need the notion of a project kind of background page because I don't really have that yet.\n\n[Dulaney, Stephen] 14:10:55\nThat's enough on that one because… What you're looking at?\n\n[Ballew, Suzette] 14:10:56\nThere may be a title Here are all your projects.\n\n[Dulaney, Stephen] 14:11:00\nOkay, so this is the new interview page. This is me thinking.\n\n[Dulaney, Stephen] 14:11:07\nI always, even though I ask the same script every time I do think about a persona or a journey map or what I'm trying to do.\n\n[Dulaney, Stephen] 14:11:15\nA lot of researchers do that, it turns out so um what kind of information would you like to, like now you're going to do like seven interviews under one project what kind of form elements do we need to capture when you're organizing?\n\n[Dulaney, Stephen] 14:11:29\nAnd what would like Oh, and a new interview type.\n\n[Ballew, Suzette] 14:11:34\nWell, again, you want to know what problem you're trying to solve with this interview.\n\n[Ballew, Suzette] 14:11:39\nRight. And what you're… what mental model of the person you're going to interview is or how to get the mental model from them so\n\n[Dulaney, Stephen] 14:11:39\nOkay.\n\n[Dulaney, Stephen] 14:11:52\nCan you elaborate on that a little bit?\n\n[Ballew, Suzette] 14:11:59\nThat generally goes into the type of questions you ask. And the problem you're trying to solve.\n\n[Ballew, Suzette] 14:12:05\nBut like you want to\n\n[Ballew, Suzette] 14:12:10\nCreate, you know. You have an event, right?\n\n[Ballew, Suzette] 14:12:17\nWhat thought processes does that person use to get that event done or why it happened say perchance that Somebody doesn't go shopping because they find… everything is too expensive.\n\n[Ballew, Suzette] 14:12:41\nWhat is the thought model by thinking something is too expensive? That's a mental model.\n\n[Dulaney, Stephen] 14:12:46\nNow, in your mind, you have a set number of names for the mental models that you're looking for?\n\n[Ballew, Suzette] 14:12:52\nLet me see. I can bring them up real quick.\n\n[Ballew, Suzette] 14:13:00\nWell… There are all kinds of mental models like Let me find it real quick for you.\n\n[Ballew, Suzette] 14:13:15\nThat's not it.\n\n[Ballew, Suzette] 14:13:26\nAll right. So… on an event. The event is I don't go shopping because everything's too expensive. What are the pattern structures and mental models behind that?\n\n[Ballew, Suzette] 14:13:39\nIs what you want to know. So the event is what happened The patterns are what trends are observable over time And the structure is what have influenced these patterns like organizations physical artifacts, policies, processes.\n\n[Ballew, Suzette] 14:13:57\nAnd the mental models are what beliefs keep the system in place, beliefs, values, assumptions.\n\n[Ballew, Suzette] 14:14:04\nAnd then you derive questions from all those. What do we need to know to address that event.\n\n[Ballew, Suzette] 14:14:13\nAnd in mental models. Some of the possible answers are decision fatigue, perceived benefits, perceived susceptibility, perceived severity perceived behavioral control, perceived barriers, cues to action, self-advocacy.\n\n[Ballew, Suzette] 14:14:35\nAttitudes, behavioral intention, subjective norms, social norms, perceived power, and cognitive dissonance.\n\n[Ballew, Suzette] 14:14:44\nThere you go.\n\n[Dulaney, Stephen] 14:14:45\nOkay, can you share that with me later? Because that's very fascinating to me and I might roll that in.\n\n[Ballew, Suzette] 14:14:49\nSure.\n\n[Dulaney, Stephen] 14:14:50\nTo continue on here. So that's the project name. I need to redo that section. Are there any like demographic? I call this post interview, but what kind of demographic information do you use typically?\n\n[Dulaney, Stephen] 14:15:02\nIf any.\n\n[Ballew, Suzette] 14:15:06\nTypically. Just the ones that matter as related to the product\n\n[Dulaney, Stephen] 14:15:13\nIt's a good design principle, just the ones that matter. I agree.\n\n[Dulaney, Stephen] 14:15:19\nDo you ever need to use technology usage? Is that ever, I mean, I guess if it matters, it matters. If it doesn't, it doesn't.\n\n[Ballew, Suzette] 14:15:25\nSay again?\n\n[Dulaney, Stephen] 14:15:27\nTechnology uses is that ever? Come into projects as something that matters?\n\n[Ballew, Suzette] 14:15:35\nIt depends on if you're, you know. Creating a project that's technical into advanced like if you're creating a mobile app for people to use that does matter But if you're… creating the perfect you know maybe litter box maybe it wouldn't matter as much\n\n[Dulaney, Stephen] 14:15:45\nYeah.\n\n[Dulaney, Stephen] 14:15:56\nNow, you'd probably do that almost in your head. When in the project do you kind of start to um form ideas of form ideas what matters and what doesn't matter. Is there a formal process or is this just kind of going on as you're taking in information?\n\n[Ballew, Suzette] 14:16:07\nYou…\n\n[Ballew, Suzette] 14:16:14\nJust organically.\n\n[Dulaney, Stephen] 14:16:15\nI think so too. Because I'm dealing with like 25 years of experience and I'm trying to capture it into stuff. But that's interesting.\n\n[Dulaney, Stephen] 14:16:20\nSo I'm going to move along. You've seen the actual interview where it asks questions. I'm not going to go back to that.\n\n[Dulaney, Stephen] 14:16:29\nWould as a research assistant, would you want to have a way to view all of your past transcripts, uploaded transcripts artifacts, what would you want it to be in an archive?\n\n[Ballew, Suzette] 14:16:43\nI… Well, sometimes you want excerpts right for stakeholder presentations and maybe video clips Those are great but as far as for synthesizing data, I would really only care about a summary.\n\n[Dulaney, Stephen] 14:17:02\nOkay. Anything that you would use with a search.\n\n[Dulaney, Stephen] 14:17:06\nMy search may be broken. Yep, it is broken too.\n\n[Ballew, Suzette] 14:17:11\nYeah, so if you could search transcripts for like maybe you made a note, like, I liked what this user said about this\n\n[Ballew, Suzette] 14:17:21\nSpecific phrase. And maybe if you could search transcripts to go back and say what exactly part of the video that was in so you could get that video clip without having to sit there and watch the whole thing.\n\n[Dulaney, Stephen] 14:17:23\nOkay.\n\n[Dulaney, Stephen] 14:17:36\nOkay, I'll dovetail. They do that with mine. We don't have that feature yet, but we might.\n\n[Ballew, Suzette] 14:17:38\n30 times 30 times\n\n[Dulaney, Stephen] 14:17:41\nOkay, so would you ever find a semantic search interesting when you could search for either mood or mood Positive and positive.\n\n[Dulaney, Stephen] 14:17:54\nPart of it. Okay.\n\n[Ballew, Suzette] 14:17:54\nAbsolutely.\n\n[Dulaney, Stephen] 14:17:59\nGood.\n\n[Dulaney, Stephen] 14:18:03\nAlso not really working. It's getting there.\n\n[Dulaney, Stephen] 14:18:08\nEmotions. Right now that emotions it picks up is the interviewer saying That's very interesting. Okay.\n\n[Dulaney, Stephen] 14:18:18\nAnything else on it? So this advanced search, I'll work on that. Okay, persona generation. What would you expect to see on a page that generates personas? How would you want to use it?\n\n[Dulaney, Stephen] 14:18:26\nAnd do you generate personas every time? You care.\n\n[Ballew, Suzette] 14:18:34\nI would want to… have it help generate it.\n\n[Ballew, Suzette] 14:18:40\nLike if you took a sample group of 10 cohorts and knew all these things about them.\n\n[Ballew, Suzette] 14:18:46\nTo create a generic persona that would encompass them all you would want to know their strengths, their weaknesses, their motivations, their pain points um you know that's kind of the things that matter to them Those kinds.\n\n[Dulaney, Stephen] 14:19:05\nOkay, I don't really have very good data in here yet.\n\n[Dulaney, Stephen] 14:19:07\nBecause it's like, but basically the idea is you select them And then this is new. You pick the model.\n\n[Dulaney, Stephen] 14:19:15\nI just added Sonnet today. But it's super slow. Okay, anything about like a persona would, I mean, this organized by project So once I pick a project, I get all the interviews related to that project.\n\n[Dulaney, Stephen] 14:19:27\nWould you ever need to grab an interview from a different project and edit in?\n\n[Ballew, Suzette] 14:19:32\nOf course.\n\n[Dulaney, Stephen] 14:19:34\nOkay, so it needs to be a little flexible. Anything else? Any other kind of features in this now basically just picking your transcripts and then running a script.\n\n[Dulaney, Stephen] 14:19:41\nGenerating a starting point.\n\n[Ballew, Suzette] 14:19:44\nWell, I would like to be able to like interview a cohort of 10 people and ask them you know some specific questions on like your motivations your like I just said a while ago, and then have a while ago\n\n[Ballew, Suzette] 14:20:01\nThe AI generate an amalgamated persona of all of those people for me.\n\n[Dulaney, Stephen] 14:20:10\nOkay, now then once you got that information, how would you work with it in your regular flow?\n\n[Ballew, Suzette] 14:20:20\nWell, I always lean to the pain points the most.\n\n[Dulaney, Stephen] 14:20:26\nOkay, so…\n\n[Ballew, Suzette] 14:20:28\nAnd what they would like to achieve.\n\n[Dulaney, Stephen] 14:20:33\nOkay. I mean, obviously we can tweak this.\n\n[Ballew, Suzette] 14:20:37\nThose are pretty good.\n\n[Dulaney, Stephen] 14:20:39\nThank you. This is my favorite one here. You take this job right here.\n\n[Dulaney, Stephen] 14:20:44\nCan you copy it. And then you take it over to Microsoft Edge.\n\n[Dulaney, Stephen] 14:20:51\nI had to move over here. Let me go to my mouse?\n\n[Dulaney, Stephen] 14:21:00\nThen you put it in here.\n\n[Dulaney, Stephen] 14:21:05\nAnd then you… These are my favorite.\n\n[Dulaney, Stephen] 14:21:09\nAspects of this new crazy toy So.\n\n[Dulaney, Stephen] 14:21:15\nCreation A. Okay, so that's basically the persona.\n\n[Dulaney, Stephen] 14:21:20\nWould it be useful to save this or download this persona?\n\n[Ballew, Suzette] 14:21:25\nYes, and a nicely, beautifully formatted\n\n[Ballew, Suzette] 14:21:32\nPdf or Figma file Or… Or you could like… customize the colors and fonts and stuff as related to maybe your client's branding\n\n[Dulaney, Stephen] 14:21:36\nHow about a JSON? That's all I have right now. But I'm working on that. I'm working on that because I'm\n\n[Dulaney, Stephen] 14:21:50\nYeah, the idea is to have that so that you could… You could download, drag and drop it into Figma.\n\n[Dulaney, Stephen] 14:21:57\nSame thing. I don't have, I mean, this basically does a journey map\n\n[Ballew, Suzette] 14:22:02\nOne thing that I see there that I just don't understand and what the importance of is the metadata.\n\n[Dulaney, Stephen] 14:22:08\nOh. That's all the stuff about the location, the age.\n\n[Dulaney, Stephen] 14:22:14\nIf you wanted to go through and figure out, I want only 25 year olds or I want say if you wanted to pick by a certain age, that's where that shows up. That's an analysis and there's a transcript.\n\n[Dulaney, Stephen] 14:22:27\nAnd what's happening, and these are all getting thrown into the vector database And then from the vector database, you get all that semantic search that I'm basically just being vectorized and then you can search and stuff Metadata is like the demographics.\n\n[Ballew, Suzette] 14:22:38\nWho?\n\n[Dulaney, Stephen] 14:22:45\nWould you not use that at all?\n\n[Ballew, Suzette] 14:22:48\nWell, if it was called demographics, I would, but metadata to me is is more of a coder thing.\n\n[Dulaney, Stephen] 14:22:52\nIt's a terrible name.\n\n[Dulaney, Stephen] 14:22:57\nYes, it is. Good catch. Good catch. Okay, would have totally missed that. And then the last feature is what I'll do with yours is if you have files that you took some other way.\n\n[Dulaney, Stephen] 14:23:09\nWhere you can upload them. And then add them to them.\n\n[Ballew, Suzette] 14:23:12\nFocal.\n\n[Ballew, Suzette] 14:23:16\nThis is pretty cool.\n\n[Dulaney, Stephen] 14:23:16\nTo the collection. Okay, homepage, you gave me some good thoughts there.\n\n[Dulaney, Stephen] 14:23:23\nThis page just needs to be rethought from scratch. I definitely need probably a new project start page or something to configure like the actual research study. What's the question? What's the project?\n\n[Dulaney, Stephen] 14:23:33\nAnything else you can think of that I could focus on?\n\n[Ballew, Suzette] 14:23:39\nYeah, from home, start a new project add a new, you know.\n\n[Ballew, Suzette] 14:23:46\nMake it customizable a little bit, not so much canned if you could.\n\n[Dulaney, Stephen] 14:23:51\nOkay.\n\n[Ballew, Suzette] 14:23:52\nBecause you won't either for different projects you'll want to be able to do things in different ways.\n\n[Dulaney, Stephen] 14:23:58\nOkay, new study.\n\n[Ballew, Suzette] 14:24:00\nAnd maybe by describing the product or project or product that you're trying to create.\n\n[Ballew, Suzette] 14:24:07\nIf it could… let you know what some good workshop activities to do to solve your problems would be nice. Like you asked me How?\n\n[Dulaney, Stephen] 14:24:20\nOkay, so like a discovery planner.\n\n[Ballew, Suzette] 14:24:23\nYeah, so like you asked me about the card sort activity. I've been doing this long enough to know what I need to do but like if there was a research methodology suggestion based on, you know, certain information that you feed it like what is the goal of your project or what type of project is it you know\n\n[Ballew, Suzette] 14:24:41\nWhat is it that you're trying to build? Who are you building it for? What problem are you trying to solve? And then it would say.\n\n[Ballew, Suzette] 14:24:49\nI think that this, this, and this would be really good activities to do with your users to help solve their problems.\n\n[Dulaney, Stephen] 14:24:56\nThat is amazing. Would you later be willing to help me with workshops if I get further along?\n\n[Ballew, Suzette] 14:25:01\nAbsolutely.\n\n[Dulaney, Stephen] 14:25:03\nThe biggest insight that I had as far as kind of doing it, sharing it with you, sharing it with Ilya, sharing it with Maya.\n\n[Dulaney, Stephen] 14:25:08\nAnd then Amaya, somehow I came to the conclusion. I was just kind of sharing it, not really asking questions. But somehow I came to the awareness that I needed to do a research study.\n\n[Ballew, Suzette] 14:25:10\nI'm saying what?\n\n[Dulaney, Stephen] 14:25:19\nAnd talk to real ears. And it's really been amazing how much progress we've made with just two interviews.\n\n[Ballew, Suzette] 14:25:20\nWhat was it?\n\n[Dulaney, Stephen] 14:25:27\nIt's kind of funny how you forget. I mean, that's what we do. And then I'm totally, I've been doing this like four weeks now.\n\n[Ballew, Suzette] 14:25:27\nYeah.\n\n[Dulaney, Stephen] 14:25:33\nAnd just now I realized, yeah, wouldn't it be nice to be a user research study and see what researchers want?\n\n[Ballew, Suzette] 14:25:40\nIt's a pretty good idea.\n\n[Dulaney, Stephen] 14:25:41\nYeah, that's a good idea. Just took me six weeks to figure it out.\n\n[Ballew, Suzette] 14:25:46\nOh.\n\n[Dulaney, Stephen] 14:25:46\nBut I had to the end of May. So, and I have a lot of people. And the other thing I've noticed about this so far is when you invite a user researcher to take a user research interview.\n\n[Dulaney, Stephen] 14:25:55\nThey're amazingly accommodating. And excited to participate.\n\n[Ballew, Suzette] 14:26:01\nYeah, I was. Even though I didn't really have the time to do this today.\n\n[Dulaney, Stephen] 14:26:03\nSo that's been fun. Any last comments?\n\n[Dulaney, Stephen] 14:26:08\nI want to thank you for their participation in the interview and as a participant, you'll get early access to the tool as soon as I can get it somewhere besides my laptop.\n\n[Dulaney, Stephen] 14:26:18\nBut…\n\n[Ballew, Suzette] 14:26:20\nI just feel like your overall layout needs to be more intuitive as to the process and steps that you go through And… just compartmentalized a little different.\n\n[Dulaney, Stephen] 14:26:28\nYeah.\n\n[Dulaney, Stephen] 14:26:32\nAnd I look at this tool I'm also working on. I'm working two tracks this is these are basically called custom GPTs This one is when you were talking about is Cynthia. It basically develops a discovery plan So you put in your stuff. And the way it's different is you basically can load in like Talo examples, best practices\n\n[Dulaney, Stephen] 14:26:53\nAnd you can tune the prompt so it focuses on that. I mean, you could do the same thing in just any sidekick.\n\n[Dulaney, Stephen] 14:26:59\nBut this one is Odysseus does journey maps. And this one does personas.\n\n[Dulaney, Stephen] 14:27:05\nUsing just OpenAI. Sidekick style. They're going to be like sidekick skills So I don't know which one's better because when you do this, there's editing tools where you can actually just edit the bullets and you can also still talk to the AI and say, I need to work on the bullets for pain points. Can you find me three more?\n\n[Dulaney, Stephen] 14:27:23\nAnd you can argue with it. And then you can just add it. And I don't have that feature.\n\n[Dulaney, Stephen] 14:27:29\nSo I don't know where it's going to end up. But I'll share these with you too when we get a chance.\n\n[Ballew, Suzette] 14:27:35\nCool.\n\n[Dulaney, Stephen] 14:27:36\nAnd any other kind of insights or ideas are helpful. Thanks for your participation.\n\n[Ballew, Suzette] 14:27:42\nYou're welcome. I hope it was helpful.\n\n[Dulaney, Stephen] 14:27:44\nIt was super helpful. I loved it. Now I just got to make sure before you go that I capture the transcript correctly.\n\n[Dulaney, Stephen] 14:27:53\nBecause I don't see it anymore. Oh my God, I'm starting to panic a little bit.\n\n[Dulaney, Stephen] 14:27:59\nStop. Oh, there's the transcript.\n\n",
  "chunks": [
    {
      "text": " [Dulaney, Stephen] 13:43:31 Testing the transcript. Is the transcript working? Yes.  [Dulaney, Stephen] 13:43:37 This interview will be with Suzette Ballet. She is a researcher.  [Dulaney, Stephen] 13:43:44 The date is Friday, April 18th, 2025.  [Dulaney, Stephen] 13:46:17 Hello. You don't have to go scream on if you don't want to. I just put it on.  [Dulaney, Stephen] 13:46:22 Yes. That's fine. We can go screen off.  [Ballew, Suzette] 13:46:23 I look terrible.  [Dulaney, Stephen] 13:46:28 I may. I have a transcript. I might go ahead and video if that's okay. Do I have your permission to keep a transcript of this testing session?  [Ballew, Suzette] 13:46:36 Sure.  [Dulaney, Stephen] 13:46:37 And then I may go ahead and record because I may play with dovetail later.  [Dulaney, Stephen] 13:46:43 Okay, thank you for participating in the user research about researchers.  [Dulaney, Stephen] 13:46:49 You're hoping to learn a lot about how you plan organize and activate your research activities. We want to learn about some of your pain points and some of your frustrations.  [Dulaney, Stephen] 13:46:59 But let us start by saying, what is your name and what is your current role?  [Ballew, Suzette] 13:47:04 Suzette Ballou, a senior ux designer researcher Product discovery specialist.  [Ballew, Suzette] 13:47:12 At Deloitte.  [Dulaney, Stephen] 13:47:12 Can you tell me about a few of your past positions that you've had that helped you prepare and be successful at your current role as a researcher.  [Ballew, Suzette] 13:47:21 How do you mean?  [Dulaney, Stephen] 13:47:23 What got you ready for the work you do today so well?  [Ballew, Suzette] 13:47:28 I don't know. My curiosity of how things work and trying to make them better.  [Dulaney, Stephen] 13:47:35 Okay, that's good. So with respect to your role as a researcher, what is your primary goal?  [Ballew, Suzette] 13:47:44 To design products that actually work for humans and that are not controlled by bias of stakeholders, of developers, and of researchers.  [Dulaney, Stephen] 13:47:57 Okay, very good. When you're trying to pursue your primary goal, are there some key frustrations that you encounter?  [Ballew, Suzette] 13:48:04 Yes. Stakeholders and developers are always my key frustrations.  [Dulaney, Stephen] 13:48:10 That sounds great. So we're going to move on to a little bit Can you tell me a little bit about how your role works today As a user researcher, do you have the tools that you need and what tools might you want?  [Dulaney, Stephen] 13:48:22 That you don't have.  [Ballew, Suzette] 13:48:26 I feel like I could have some more AI tools to do um synthesis and synthesis and research, better research, more accurate research, usable research instead of you know like this might or might not be right when you check it out on AI  [Ballew, Suzette] 13:48:50 Because they're always like with the AI these days, there's a There's a trust but verify kind of a deal like it might not be correct. So it'd be nice if it was trustworthy.  [Dulaney, Stephen] 13:49:06 Okay, that sounds good. So in the next, what are your vision for the next year with tools to help you do this? What do you think that you would see or what would What would you like to be added to your suite? And that's a good one as far as like hallucination validation.  [Ballew, Suzette] 13:49:07 And you didn't have to verify it.  [Dulaney, Stephen] 13:49:21 Any others?  [Ballew, Suzette] 13:49:24 Um…  [Ballew, Suzette] 13:49:29 I don't know. The biggest tool that I have right now is my brain.  [Dulaney, Stephen] 13:49:33 Okay, well, that's going to be the biggest story even in the future. So tell me a story about a user research project that you thought was going to be swimmingly and easy.  [Dulaney, Stephen] 13:49:41 But ended up being frustrated no matter how hard you tried, it just became a burden at every step.  [Ballew, Suzette] 13:49:50 Um… I would have to say Eli Lilly.  [Ballew, Suzette] 13:49:57 Just because… I have a specific method of you know doing workshops and gathering data And it generally works great, but the people on your team have to be on board with it.  [Ballew, Suzette] 13:50:15 You know, like the product manager and the product manager that i had was just a total hardcore dev person and couldn't think outside of that box.  [Ballew, Suzette] 13:50:28 And that was very frustrating. But everybody else on the team did great but You know, if people can't open up their minds a little bit to see what the art of the possible.  [Ballew, Suzette] 13:50:43 Is then that that's very frustrating.  [Dulaney, Stephen] 13:50:46 Okay, that's a very good story. Can you think of another story that you thought it was going to be hard to get research done and it turned out to just have a happy ending and everybody was very appreciative of your contribution?  [Ballew, Suzette] 13:50:57 Yeah, Graybar. Great Bar Electric.  [Ballew, Suzette] 13:51:02 That one went swimmingly well. Everybody understood my methods. They did the work that I asked them to. We came up with some really great wireframes for the employee portal and an excellent recommendation for the team.  [Ballew, Suzette] 13:51:21 We were chosen to be chosen explore options of a very customized, personalized employee portal.  [Dulaney, Stephen] 13:51:21 How?  [Ballew, Suzette] 13:51:29 Kind of built off of Workday. That was great.  [Dulaney, Stephen] 13:51:34 Let's think about that project and um When you were first asked to do the project, what are the steps that you went through? What was your process to plan and design your experimental Research.  [Ballew, Suzette] 13:51:48 First, I gathered as much information from the client as we could about their system. It was for the Graybar Connect and Graybar.  [Ballew, Suzette] 13:51:57 You know what they currently use and what system it was going to be integrated with and all the technical feasibility and stuff.  [Ballew, Suzette] 13:52:09 And they were working with a certain certain product, I can't remember the name of now and transferring from workday But gathered all the technical feasibility that the product could do layout wise and functionality wise and widget wise and then  [Ballew, Suzette] 13:52:33 Put all of those down on cards, every single piece of functionality that it could do.  [Ballew, Suzette] 13:52:38 And then thought of thought workshopped with tara on extra things that it couldn't do that could be customized.  [Ballew, Suzette] 13:52:47 And then created a huge card sort activity and interviewed 20 of their employees through the card sort And then prioritize the cards as an order of priority of what would help them through their workday.  [Ballew, Suzette] 13:53:04 And that's basically what we did for The activity that we did for that. We only have one month to do this project. So it was very short and quick.  [Ballew, Suzette] 13:53:17 It was me and those me her and we did a great job And that particular activity would agree.  [Dulaney, Stephen] 13:53:21 Now, do you have a list of ask when you start for the part where you want to kind of do background How do you organize your requests or how long does it take to kind of put together what you're needing and how much time do you spend on kind of gathering and analyzing  [Dulaney, Stephen] 13:53:35 Whatever you receive from the client.  [Ballew, Suzette] 13:53:39 It depends on how big my team is and if I have to do it by myself, of course, it takes longer. But if you have a team, you can delegate and things go quicker. But I generally fast track everything as much as possible.  [Ballew, Suzette] 13:53:51 And try to utilize the team and delegate to where towards people's strengths. If somebody is particularly fond of design, I will let them do that and I will do more of the grant work if they like doing the interviews, I will let them do that.  [Ballew, Suzette] 13:54:07 Do the stuff that they don't like to do from a leadership perspective i always pick the stuff that my team doesn't like to do because I can actually do all of it, right?  [Dulaney, Stephen] 13:54:17 Okay.  [Ballew, Suzette] 13:54:18 That's how I expedite projects.  [Dulaney, Stephen] 13:54:21 And did you do formal stakeholder interviews or were you just kind of collecting along the way?  [Ballew, Suzette] 13:54:26 Well, could you repeat that? You bleeped out a little.  [Dulaney, Stephen] 13:54:29 Did you do formal interviews with stakeholders or did you just kind of collect and listen as you're having your kickoff week?  [Ballew, Suzette] 13:54:37 No, we did live interviews and walked them through the card sorts and You know?  [Dulaney, Stephen] 13:54:43 Now, are those different from the user interviews or those? I mean, I'm considered stakeholders  [Ballew, Suzette] 13:54:49 Well, there are all kinds of stakeholders because they're employees of the company.  [Dulaney, Stephen] 13:54:53 Okay, interesting.  [Ballew, Suzette] 13:54:54 So it's kind of… a see a B2E, business to employee.  [Ballew, Suzette] 13:55:02 Right. So, but we've had 20 different employees.  [Ballew, Suzette] 13:55:06 And we went through card sorts with him via video And in like figma jam And walk them through the activity, ask them a bunch of questions, took notes, synthesized the data, and came up with our recommendations.  [Dulaney, Stephen] 13:55:21 So how soon did you realize that a card sort would be one of the activities you would require?  [Ballew, Suzette] 13:55:27 Pretty much right away because it was a feature based thing And a lot of what was out of the box, but then there was some room for customization and You know, picking and choosing the features that are most important  [Ballew, Suzette] 13:55:45 Is easily done in a card sort and then a tree test of the prioritization of them.  [Ballew, Suzette] 13:55:52 More than like a user interview when you're asking questions of a different type of nature to come up with completely 100% customized features or solutions.  [Dulaney, Stephen] 13:56:05 Okay. What kind of artifacts or what kind of reports did you generate based on the card sort?  [Ballew, Suzette] 13:56:05 So…  [Ballew, Suzette] 13:56:13 We did user personas we did different prototypes for um target state and then, you know, a future state like a pared down state that they could probably achieve pretty easily than a really advanced state that would make everybody that we interviewed super happy because they would all get what they want.  [Ballew, Suzette] 13:56:37 Basically just used Figma. And our brains.  [Dulaney, Stephen] 13:56:42 Okay, so how much time did you spend collecting versus analyzing? Just a rough guess.  [Ballew, Suzette] 13:56:50 Um… Probably about 70 30  [Dulaney, Stephen] 13:56:57 Okay, 70 collecting 30 analyzing. And you jump straight to Figma, so you're also kind of kind of building final deliverables at the same time as you're like analyzing.  [Ballew, Suzette] 13:57:00 Yeah.  [Ballew, Suzette] 13:57:08 Yeah, so we would do our workshops in Figma jam do our actual wire framing and other stuff in Figma, but Figma Jam is a great tool to where you can literally create anything you want. It's a lot like marrow so  [Dulaney, Stephen] 13:57:23 Okay. Are there any pitfalls in your process that you see that you might like smoothed out?  [Ballew, Suzette] 13:57:29 Um… Just as the ones I mentioned before.  [Dulaney, Stephen] 13:57:33 Okay, did you consider any actuals to participate or compare your card sort with against the humans?  [Ballew, Suzette] 13:57:41 Not at that time.  [Dulaney, Stephen] 13:57:42 Okay, too early. So we'll move on to another selection. I want to ask you about on a typical project, who do you consider your collaborators?  [Dulaney, Stephen] 13:57:52 Who do you consider your client? That's who you work for and who do you consider who benefits most from what you do? So we'll start with collaborators. Who do you work with?  [Ballew, Suzette] 13:58:00 Repeat that whole statement.  [Dulaney, Stephen] 13:58:02 Okay, so we're just kind of talk about people and try to build a little model. Who are the people that you work with, your collaborators? And just kind of roles in a typical project.  [Ballew, Suzette] 13:58:13 And my squad model approach, it would be a product owner or manager and a tech lead and UX people.  [Dulaney, Stephen] 13:58:24 Who do you work for?  [Ballew, Suzette] 13:58:31 I don't understand the question. I work for Deloitte.  [Dulaney, Stephen] 13:58:33 Okay, okay. So is any particular person that you kind of would consider that you report up to or needs to keep track of your work.  [Ballew, Suzette] 13:58:46 Not really. And the project delivery model, every time we change project, we change our coach  [Dulaney, Stephen] 13:58:47 And then we have rate matrix experiments. And then who do you think benefits most Exactly. Who do you think benefits most from from the work you do.  [Ballew, Suzette] 13:58:59 Users.  [Dulaney, Stephen] 13:59:00 Okay. So of those three, we only have two with you. Basically, your product team, which is your product owner, your tech lead and your UX person, and then the users.  [Dulaney, Stephen] 13:59:08 How would you, who was first in that rating most important to you?  [Ballew, Suzette] 13:59:13 Users.  [Dulaney, Stephen] 13:59:14 You would be surprised how many people have used our research and they missed the answer to that question.  [Ballew, Suzette] 13:59:22 I'm probably one of the most user centric. You add people you offer me.  [Dulaney, Stephen] 13:59:25 Yes. And I just have to bite my time when I'm staying.  [Dulaney, Stephen] 13:59:30 Okay, so we're going to go through a few parts of the process when you kick off a project. When you get a new project, how much time or what kind of tools to use to analyze the intake of the of the discovery process, which in an ideal world  [Ballew, Suzette] 13:59:44 I use Figma and Sidekick a lot.  [Dulaney, Stephen] 13:59:48 Okay.  [Ballew, Suzette] 13:59:50 Especially if it's like products that I don't understand the full breadth of, like maybe out of my depth in a financial nature Or, you know.  [Dulaney, Stephen] 14:00:01 And when in the cycle do you start to identify with what kind of identify what kind user interviews you're going to do. And then how do you go about planning your script  [Ballew, Suzette] 14:00:01 I will…  [Ballew, Suzette] 14:00:12 It depends, again, like on the product. And what the goal is for the product, what kind of user research you're going to do if it's, you know.  [Ballew, Suzette] 14:00:23 Usability testing that's one thing or if it's a brand new concept where you're coming up with features and trying to solve problems to create like an application like kp for instance we did all kinds of Different types of user interviews over there  [Ballew, Suzette] 14:00:45 With patients trying to figure out how might we help them with things like care plan gaps or medication adherence or you know how we might help them take control over their chronic diseases, which is much different than How might we help somebody improve their workday, right?  [Ballew, Suzette] 14:01:09 So in those interviews it was very, you know, very personal type questions that we would ask about their life And, you know.  [Ballew, Suzette] 14:01:22 Their habits and stuff like that because we were trying to affect behavior change but on gray bar We were just trying to figure out what the priorities were for them in their job to help them do their job better and  [Dulaney, Stephen] 14:01:27 Okay.  [Ballew, Suzette] 14:01:37 An employee portal can offer to do that.  [Dulaney, Stephen] 14:01:42 Since my dad's phone. So when you're conducting your interviews What kind of tools do you have to kind of ask the questions, record the answers?  [Dulaney, Stephen] 14:01:52 Other tools that you need, tools that you like.  [Ballew, Suzette] 14:01:55 I prefer Zoom for user interviews and I just take straight notes on the Figma Jamboard.  [Dulaney, Stephen] 14:02:02 Okay.  [Ballew, Suzette] 14:02:03 And I generally read my script out of Microsoft Word.  [Dulaney, Stephen] 14:02:06 Okay, sounds good. And then how many files do you generate and how do you organize your files?  [Ballew, Suzette] 14:02:13 What do you mean files?  [Dulaney, Stephen] 14:02:15 Like transcripts, videos, post-interview notes or  [Ballew, Suzette] 14:02:20 Well, like I said, I just take notes on a Figma Jam board and Then… Sometimes I will feed those notes into like sidekick or something to find commonalities or stuff like that. Or you can do it mentally even by hand, like old school  [Dulaney, Stephen] 14:02:39 Okay, that sounds good. So which of those um Are there pain points or frustrations or opportunities to make that better?  [Ballew, Suzette] 14:02:48 Yeah, one pain point would be it's kind of hard to like get that information into an AI.  [Ballew, Suzette] 14:02:56 I didn't use the transcripts that would have been a better idea  [Dulaney, Stephen] 14:03:00 Okay, and then if you had them, is there like if you could do a lot of stuff in AI, are you able to get it into Figma in a usable form or is it manual?  [Dulaney, Stephen] 14:03:09 Cheers. It's a leading question.  [Ballew, Suzette] 14:03:09 I don't know. I haven't tried it yet.  [Dulaney, Stephen] 14:03:15 So what about recruiting? Who takes care of your recruiting? Are there any pain points around and how much time do you invest in recruiting?  [Ballew, Suzette] 14:03:22 Well, generally the clients are Generally, the clients are, you know, setting up if it's like BDE, they already have the employee, so they would pick the employees and like at kp we had they had a research department where they would  [Dulaney, Stephen] 14:03:23 Awesome. Yeah, we've got that.  [Dulaney, Stephen] 14:03:31 How are you going?  [Ballew, Suzette] 14:03:41 You know um recruit from their members list.  [Ballew, Suzette] 14:03:45 Generally, it's the client. That gives you access to who you're interviewing.  [Dulaney, Stephen] 14:03:51 Well, I know. Okay. I know we've been kind of remote lately, but can you remember field work and what are your feelings about field work as a researcher?  [Ballew, Suzette] 14:04:01 When I was at HMH, which is Hufton, Mifflin, Harcourt. We were designing or redesigning textbooks into digital learning objects And for the younger kids, it's really hard to interview them because they're, you know, they're kids. So we had to do a lot of ethnographical research with them and  [Dulaney, Stephen] 14:04:12 Okay.  [Dulaney, Stephen] 14:04:18 Yeah.  [Ballew, Suzette] 14:04:23 Eye trace studies and i trace stuff like that those are amazingly fun to me.  [Dulaney, Stephen] 14:04:28 I'm going to stop. Is there any kind of digital equivalent to that today that is kind of similar to field work?  [Ballew, Suzette] 14:04:38 I don't think so. Not for ethanographical, who's literally… it's an observational study, right?  [Dulaney, Stephen] 14:04:45 Yep, yep. Just checking, just checking. What about… Do you use the same kind of research design? Do you have like one type of questionnaire that you modify?  [Dulaney, Stephen] 14:04:56 Or do you kind of redesigned based on, or do you have a set number that you pull one up right away in your head. How do you design the actual kind of research part?  [Ballew, Suzette] 14:05:06 Well, I have a kind of a cadence as a framework that I use like you know, getting the subject kind of acclimated to what they're about to do.  [Ballew, Suzette] 14:05:21 Asking him a few questions to get them in the mindset. But as far as the actual questions, it is 100% solely debased on the product and what you're trying to achieve.  [Ballew, Suzette] 14:05:34 That part is always custom. The framework is kind of the same  [Dulaney, Stephen] 14:05:36 And so you kind of, do you have any kind of um do you have any kind of files or assets You can be able to share their like interview guides, tips, or is it all just instinctual  [Ballew, Suzette] 14:05:50 Instinctual. I've been doing it, so I don't really…  [Dulaney, Stephen] 14:05:51 So I had that for you. Okay, so if you had a magic wand What one thing would you change about your user research activities from when you were asked to do it all the way through planning and enacting analysis and deliverables.  [Ballew, Suzette] 14:06:11 Ask me that one more time.  [Dulaney, Stephen] 14:06:12 If you had a magic wand, what one thing would you change?  [Ballew, Suzette] 14:06:25 I would have… the user research be prioritized over user stories and sold into the projects up front instead of an afterthought when we are brought in too late to be effective.  [Dulaney, Stephen] 14:06:43 Very good one. If I go to your customers. Which are your users. And I say, can you please describe Suzette to me in one word? What one word would you want them to tell me?  [Ballew, Suzette] 14:06:54 Empathetic.  [Dulaney, Stephen] 14:06:55 Okay, that's a good one. So that's the end of kind of the question. Are there any questions that you expected me to ask that I haven't asked so far?  [Ballew, Suzette] 14:07:02 Nope, I really had no idea what we were doing today so  [Dulaney, Stephen] 14:07:05 Okay. Do you want to get into the evaluative part and see where I am and just kind of give some feedback to what… what screens are today and what screens? I know there's some errors in them, but maybe you'll point them out and maybe it would be the same or different.  [Ballew, Suzette] 14:07:21 Sure. You're running the show.  [Dulaney, Stephen] 14:07:24 I'm not used to that. Okay, are you seeing the screen?  [Dulaney, Stephen] 14:07:31 No, that's the wrong screen, right?  [Dulaney, Stephen] 14:07:38 You'd think we learn how to get desktops, too. I don't see the ring. It should be showing. Oh, that's showing it there.  [Ballew, Suzette] 14:07:38 I'm going to mute because I have to sneeze.  [Dulaney, Stephen] 14:07:44 So yeah, that's showing. Are you seeing my mouse over here?  [Dulaney, Stephen] 14:07:48 What are you looking at?  [Dulaney, Stephen] 14:07:56 Are you there?  [Ballew, Suzette] 14:08:01 One second.  [Ballew, Suzette] 14:08:11 Sorry, I had a sneezing fit. I had to  [Dulaney, Stephen] 14:08:12 So I guess the question here is if you had a digital assistant, it was like your research and interview assistant.  [Dulaney, Stephen] 14:08:18 What would you like to see on your homepage?  [Ballew, Suzette] 14:08:34 I don't understand what I'm looking at here.  [Dulaney, Stephen] 14:08:36 Well, this is the homepage of a research assistant in um Probably not designed that well right now. So you're looking at the recent interviews.  [Dulaney, Stephen] 14:08:44 That we conducted. This is… from yesterday. This is T's user research interview.  [Dulaney, Stephen] 14:08:51 Then you have the analysis and the metadata. That you can look at from From there, these are the um Oh, I got him.  [Dulaney, Stephen] 14:09:05 These are the recent personas that we created. So it's just kind of like what you did.  [Dulaney, Stephen] 14:09:10 These are the journey maps. That you created. So it's like your research assistant homepage.  [Ballew, Suzette] 14:09:17 Are all of these cards a different project?  [Dulaney, Stephen] 14:09:20 Yes, they just have the same name because I'm doing I've resorted to reading green eggs and ham into the interview guide.  [Dulaney, Stephen] 14:09:27 Because I don't have things to say.  [Dulaney, Stephen] 14:09:32 So this is all your research. Yours will go here next.  [Dulaney, Stephen] 14:09:35 And then I'll start to have real This is the research this is the Goals, streamline research possibilities to enhance to maintain relevance and compete. So this is the one from yesterday.  [Dulaney, Stephen] 14:09:50 One interview. So just in general, she had a research assistant  [Ballew, Suzette] 14:09:55 I'm thinking. So.  [Ballew, Suzette] 14:10:01 I would like, you know, where are we defining in solving the problem statement and the hypothesis.  [Dulaney, Stephen] 14:10:09 Okay, good, good. So specifically like maybe a actual project question page.  [Dulaney, Stephen] 14:10:17 Like, what am I actually here for?  [Ballew, Suzette] 14:10:21 Yeah, so… I wouldn't break it down by recent interviews, personas, or journey months. I would break it down.  [Ballew, Suzette] 14:10:29 But just projects projects only on the dashboard. And then drill down into a product and then have your workshops your problem statement you're a problem statement user journeys, your synthesis you know everything contained under that one project  [Dulaney, Stephen] 14:10:49 Okay, very good. I need the notion of a project kind of background page because I don't really have that yet.  [Dulaney, Stephen] 14:10:55 That's enough on that one because… What you're looking at?  [Ballew, Suzette] 14:10:56 There may be a title Here are all your projects.  [Dulaney, Stephen] 14:11:00 Okay, so this is the new interview page. This is me thinking.  [Dulaney, Stephen] 14:11:07 I always, even though I ask the same script every time I do think about a persona or a journey map or what I'm trying to do.  [Dulaney, Stephen] 14:11:15 A lot of researchers do that, it turns out so um what kind of information would you like to, like now you're going to do like seven interviews under one project what kind of form elements do we need to capture when you're organizing?  [Dulaney, Stephen] 14:11:29 And what would like Oh, and a new interview type.  [Ballew, Suzette] 14:11:34 Well, again, you want to know what problem you're trying to solve with this interview.  [Ballew, Suzette] 14:11:39 Right. And what you're… what mental model of the person you're going to interview is or how to get the mental model from them so  [Dulaney, Stephen] 14:11:39 Okay.  [Dulaney, Stephen] 14:11:52 Can you elaborate on that a little bit?  [Ballew, Suzette] 14:11:59 That generally goes into the type of questions you ask. And the problem you're trying to solve.  [Ballew, Suzette] 14:12:05 But like you want to  [Ballew, Suzette] 14:12:10 Create, you know. You have an event, right?  [Ballew, Suzette] 14:12:17 What thought processes does that person use to get that event done or why it happened say perchance that Somebody doesn't go shopping because they find… everything is too expensive.  [Ballew, Suzette] 14:12:41 What is the thought model by thinking something is too expensive? That's a mental model.  [Dulaney, Stephen] 14:12:46 Now, in your mind, you have a set number of names for the mental models that you're looking for?  [Ballew, Suzette] 14:12:52 Let me see. I can bring them up real quick.  [Ballew, Suzette] 14:13:00 Well… There are all kinds of mental models like Let me find it real quick for you.  [Ballew, Suzette] 14:13:15 That's not it.  [Ballew, Suzette] 14:13:26 All right. So… on an event. The event is I don't go shopping because everything's too expensive. What are the pattern structures and mental models behind that?  [Ballew, Suzette] 14:13:39 Is what you want to know. So the event is what happened The patterns are what trends are observable over time And the structure is what have influenced these patterns like organizations physical artifacts, policies, processes.  [Ballew, Suzette] 14:13:57 And the mental models are what beliefs keep the system in place, beliefs, values, assumptions.  [Ballew, Suzette] 14:14:04 And then you derive questions from all those. What do we need to know to address that event.  [Ballew, Suzette] 14:14:13 And in mental models. Some of the possible answers are decision fatigue, perceived benefits, perceived susceptibility, perceived severity perceived behavioral control, perceived barriers, cues to action, self-advocacy.  [Ballew, Suzette] 14:14:35 Attitudes, behavioral intention, subjective norms, social norms, perceived power, and cognitive dissonance.  [Ballew, Suzette] 14:14:44 There you go.  [Dulaney, Stephen] 14:14:45 Okay, can you share that with me later? Because that's very fascinating to me and I might roll that in.  [Ballew, Suzette] 14:14:49 Sure.  [Dulaney, Stephen] 14:14:50 To continue on here. So that's the project name. I need to redo that section. Are there any like demographic? I call this post interview, but what kind of demographic information do you use typically?  [Dulaney, Stephen] 14:15:02 If any.  [Ballew, Suzette] 14:15:06 Typically. Just the ones that matter as related to the product  [Dulaney, Stephen] 14:15:13 It's a good design principle, just the ones that matter. I agree.  [Dulaney, Stephen] 14:15:19 Do you ever need to use technology usage? Is that ever, I mean, I guess if it matters, it matters. If it doesn't, it doesn't.  [Ballew, Suzette] 14:15:25 Say again?  [Dulaney, Stephen] 14:15:27 Technology uses is that ever? Come into projects as something that matters?  [Ballew, Suzette] 14:15:35 It depends on if you're, you know. Creating a project that's technical into advanced like if you're creating a mobile app for people to use that does matter But if you're… creating the perfect you know maybe litter box maybe it wouldn't matter as much  [Dulaney, Stephen] 14:15:45 Yeah.  [Dulaney, Stephen] 14:15:56 Now, you'd probably do that almost in your head. When in the project do you kind of start to um form ideas of form ideas what matters and what doesn't matter. Is there a formal process or is this just kind of going on as you're taking in information?  [Ballew, Suzette] 14:16:07 You…  [Ballew, Suzette] 14:16:14 Just organically.  [Dulaney, Stephen] 14:16:15 I think so too. Because I'm dealing with like 25 years of experience and I'm trying to capture it into stuff. But that's interesting.  [Dulaney, Stephen] 14:16:20 So I'm going to move along. You've seen the actual interview where it asks questions. I'm not going to go back to that.  [Dulaney, Stephen] 14:16:29 Would as a research assistant, would you want to have a way to view all of your past transcripts, uploaded transcripts artifacts, what would you want it to be in an archive?  [Ballew, Suzette] 14:16:43 I… Well, sometimes you want excerpts right for stakeholder presentations and maybe video clips Those are great but as far as for synthesizing data, I would really only care about a summary.  [Dulaney, Stephen] 14:17:02 Okay. Anything that you would use with a search.  [Dulaney, Stephen] 14:17:06 My search may be broken. Yep, it is broken too.  [Ballew, Suzette] 14:17:11 Yeah, so if you could search transcripts for like maybe you made a note, like, I liked what this user said about this  [Ballew, Suzette] 14:17:21 Specific phrase. And maybe if you could search transcripts to go back and say what exactly part of the video that was in so you could get that video clip without having to sit there and watch the whole thing.  [Dulaney, Stephen] 14:17:23 Okay.  [Dulaney, Stephen] 14:17:36 Okay, I'll dovetail. They do that with mine. We don't have that feature yet, but we might.  [Ballew, Suzette] 14:17:38 30 times 30 times  [Dulaney, Stephen] 14:17:41 Okay, so would you ever find a semantic search interesting when you could search for either mood or mood Positive and positive.  [Dulaney, Stephen] 14:17:54 Part of it. Okay.  [Ballew, Suzette] 14:17:54 Absolutely.  [Dulaney, Stephen] 14:17:59 Good.  [Dulaney, Stephen] 14:18:03 Also not really working. It's getting there.  [Dulaney, Stephen] 14:18:08 Emotions. Right now that emotions it picks up is the interviewer saying That's very interesting. Okay.  [Dulaney, Stephen] 14:18:18 Anything else on it? So this advanced search, I'll work on that. Okay, persona generation. What would you expect to see on a page that generates personas? How would you want to use it?  [Dulaney, Stephen] 14:18:26 And do you generate personas every time? You care.  [Ballew, Suzette] 14:18:34 I would want to… have it help generate it.  [Ballew, Suzette] 14:18:40 Like if you took a sample group of 10 cohorts and knew all these things about them.  [Ballew, Suzette] 14:18:46 To create a generic persona that would encompass them all you would want to know their strengths, their weaknesses, their motivations, their pain points um you know that's kind of the things that matter to them Those kinds.  [Dulaney, Stephen] 14:19:05 Okay, I don't really have very good data in here yet.  [Dulaney, Stephen] 14:19:07 Because it's like, but basically the idea is you select them And then this is new. You pick the model.  [Dulaney, Stephen] 14:19:15 I just added Sonnet today. But it's super slow. Okay, anything about like a persona would, I mean, this organized by project So once I pick a project, I get all the interviews related to that project.  [Dulaney, Stephen] 14:19:27 Would you ever need to grab an interview from a different project and edit in?  [Ballew, Suzette] 14:19:32 Of course.  [Dulaney, Stephen] 14:19:34 Okay, so it needs to be a little flexible. Anything else? Any other kind of features in this now basically just picking your transcripts and then running a script.  [Dulaney, Stephen] 14:19:41 Generating a starting point.  [Ballew, Suzette] 14:19:44 Well, I would like to be able to like interview a cohort of 10 people and ask them you know some specific questions on like your motivations your like I just said a while ago, and then have a while ago  [Ballew, Suzette] 14:20:01 The AI generate an amalgamated persona of all of those people for me.  [Dulaney, Stephen] 14:20:10 Okay, now then once you got that information, how would you work with it in your regular flow?  [Ballew, Suzette] 14:20:20 Well, I always lean to the pain points the most.  [Dulaney, Stephen] 14:20:26 Okay, so…  [Ballew, Suzette] 14:20:28 And what they would like to achieve.  [Dulaney, Stephen] 14:20:33 Okay. I mean, obviously we can tweak this.  [Ballew, Suzette] 14:20:37 Those are pretty good.  [Dulaney, Stephen] 14:20:39 Thank you. This is my favorite one here. You take this job right here.  [Dulaney, Stephen] 14:20:44 Can you copy it. And then you take it over to Microsoft Edge.  [Dulaney, Stephen] 14:20:51 I had to move over here. Let me go to my mouse?  [Dulaney, Stephen] 14:21:00 Then you put it in here.  [Dulaney, Stephen] 14:21:05 And then you… These are my favorite.  [Dulaney, Stephen] 14:21:09 Aspects of this new crazy toy So.  [Dulaney, Stephen] 14:21:15 Creation A. Okay, so that's basically the persona.  [Dulaney, Stephen] 14:21:20 Would it be useful to save this or download this persona?  [Ballew, Suzette] 14:21:25 Yes, and a nicely, beautifully formatted  [Ballew, Suzette] 14:21:32 Pdf or Figma file Or… Or you could like… customize the colors and fonts and stuff as related to maybe your client's branding  [Dulaney, Stephen] 14:21:36 How about a JSON? That's all I have right now. But I'm working on that. I'm working on that because I'm  [Dulaney, Stephen] 14:21:50 Yeah, the idea is to have that so that you could… You could download, drag and drop it into Figma.  [Dulaney, Stephen] 14:21:57 Same thing. I don't have, I mean, this basically does a journey map  [Ballew, Suzette] 14:22:02 One thing that I see there that I just don't understand and what the importance of is the metadata.  [Dulaney, Stephen] 14:22:08 Oh. That's all the stuff about the location, the age.  [Dulaney, Stephen] 14:22:14 If you wanted to go through and figure out, I want only 25 year olds or I want say if you wanted to pick by a certain age, that's where that shows up. That's an analysis and there's a transcript.  [Dulaney, Stephen] 14:22:27 And what's happening, and these are all getting thrown into the vector database And then from the vector database, you get all that semantic search that I'm basically just being vectorized and then you can search and stuff Metadata is like the demographics.  [Ballew, Suzette] 14:22:38 Who?  [Dulaney, Stephen] 14:22:45 Would you not use that at all?  [Ballew, Suzette] 14:22:48 Well, if it was called demographics, I would, but metadata to me is is more of a coder thing.  [Dulaney, Stephen] 14:22:52 It's a terrible name.  [Dulaney, Stephen] 14:22:57 Yes, it is. Good catch. Good catch. Okay, would have totally missed that. And then the last feature is what I'll do with yours is if you have files that you took some other way.  [Dulaney, Stephen] 14:23:09 Where you can upload them. And then add them to them.  [Ballew, Suzette] 14:23:12 Focal.  [Ballew, Suzette] 14:23:16 This is pretty cool.  [Dulaney, Stephen] 14:23:16 To the collection. Okay, homepage, you gave me some good thoughts there.  [Dulaney, Stephen] 14:23:23 This page just needs to be rethought from scratch. I definitely need probably a new project start page or something to configure like the actual research study. What's the question? What's the project?  [Dulaney, Stephen] 14:23:33 Anything else you can think of that I could focus on?  [Ballew, Suzette] 14:23:39 Yeah, from home, start a new project add a new, you know.  [Ballew, Suzette] 14:23:46 Make it customizable a little bit, not so much canned if you could.  [Dulaney, Stephen] 14:23:51 Okay.  [Ballew, Suzette] 14:23:52 Because you won't either for different projects you'll want to be able to do things in different ways.  [Dulaney, Stephen] 14:23:58 Okay, new study.  [Ballew, Suzette] 14:24:00 And maybe by describing the product or project or product that you're trying to create.  [Ballew, Suzette] 14:24:07 If it could… let you know what some good workshop activities to do to solve your problems would be nice. Like you asked me How?  [Dulaney, Stephen] 14:24:20 Okay, so like a discovery planner.  [Ballew, Suzette] 14:24:23 Yeah, so like you asked me about the card sort activity. I've been doing this long enough to know what I need to do but like if there was a research methodology suggestion based on, you know, certain information that you feed it like what is the goal of your project or what type of project is it you know  [Ballew, Suzette] 14:24:41 What is it that you're trying to build? Who are you building it for? What problem are you trying to solve? And then it would say.  [Ballew, Suzette] 14:24:49 I think that this, this, and this would be really good activities to do with your users to help solve their problems.  [Dulaney, Stephen] 14:24:56 That is amazing. Would you later be willing to help me with workshops if I get further along?  [Ballew, Suzette] 14:25:01 Absolutely.  [Dulaney, Stephen] 14:25:03 The biggest insight that I had as far as kind of doing it, sharing it with you, sharing it with Ilya, sharing it with Maya.  [Dulaney, Stephen] 14:25:08 And then Amaya, somehow I came to the conclusion. I was just kind of sharing it, not really asking questions. But somehow I came to the awareness that I needed to do a research study.  [Ballew, Suzette] 14:25:10 I'm saying what?  [Dulaney, Stephen] 14:25:19 And talk to real ears. And it's really been amazing how much progress we've made with just two interviews.  [Ballew, Suzette] 14:25:20 What was it?  [Dulaney, Stephen] 14:25:27 It's kind of funny how you forget. I mean, that's what we do. And then I'm totally, I've been doing this like four weeks now.  [Ballew, Suzette] 14:25:27 Yeah.  [Dulaney, Stephen] 14:25:33 And just now I realized, yeah, wouldn't it be nice to be a user research study and see what researchers want?  [Ballew, Suzette] 14:25:40 It's a pretty good idea.  [Dulaney, Stephen] 14:25:41 Yeah, that's a good idea. Just took me six weeks to figure it out.  [Ballew, Suzette] 14:25:46 Oh.  [Dulaney, Stephen] 14:25:46 But I had to the end of May. So, and I have a lot of people. And the other thing I've noticed about this so far is when you invite a user researcher to take a user research interview.  [Dulaney, Stephen] 14:25:55 They're amazingly accommodating. And excited to participate.  [Ballew, Suzette] 14:26:01 Yeah, I was. Even though I didn't really have the time to do this today.  [Dulaney, Stephen] 14:26:03 So that's been fun. Any last comments?  [Dulaney, Stephen] 14:26:08 I want to thank you for their participation in the interview and as a participant, you'll get early access to the tool as soon as I can get it somewhere besides my laptop.  [Dulaney, Stephen] 14:26:18 But…  [Ballew, Suzette] 14:26:20 I just feel like your overall layout needs to be more intuitive as to the process and steps that you go through And… just compartmentalized a little different.  [Dulaney, Stephen] 14:26:28 Yeah.  [Dulaney, Stephen] 14:26:32 And I look at this tool I'm also working on. I'm working two tracks this is these are basically called custom GPTs This one is when you were talking about is Cynthia. It basically develops a discovery plan So you put in your stuff. And the way it's different is you basically can load in like Talo examples, best practices  [Dulaney, Stephen] 14:26:53 And you can tune the prompt so it focuses on that. I mean, you could do the same thing in just any sidekick.  [Dulaney, Stephen] 14:26:59 But this one is Odysseus does journey maps. And this one does personas.  [Dulaney, Stephen] 14:27:05 Using just OpenAI. Sidekick style. They're going to be like sidekick skills So I don't know which one's better because when you do this, there's editing tools where you can actually just edit the bullets and you can also still talk to the AI and say, I need to work on the bullets for pain points. Can you find me three more?  [Dulaney, Stephen] 14:27:23 And you can argue with it. And then you can just add it. And I don't have that feature.  [Dulaney, Stephen] 14:27:29 So I don't know where it's going to end up. But I'll share these with you too when we get a chance.  [Ballew, Suzette] 14:27:35 Cool.  [Dulaney, Stephen] 14:27:36 And any other kind of insights or ideas are helpful. Thanks for your participation.  [Ballew, Suzette] 14:27:42 You're welcome. I hope it was helpful.  [Dulaney, Stephen] 14:27:44 It was super helpful. I loved it. Now I just got to make sure before you go that I capture the transcript correctly.  [Dulaney, Stephen] 14:27:53 Because I don't see it anymore. Oh my God, I'm starting to panic a little bit.  [Dulaney, Stephen] 14:27:59 Stop. Oh, there's the transcript.  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Suzette Ballew",
      "age": "55-64",
      "gender": "female",
      "location": "Austin, TX",
      "occupation": "Researcher",
      "industry": "Consulting",
      "experience": "21",
      "education": "bachelors"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  },
  "created_at": "2025-04-23T10:17:47.781882"
}