{
  "id": "be2a7156-3310-4673-a3b8-e88cf497a97d",
  "transcript_name": "Nadia's Interview Transcript",
  "project_name": "Daria Research of Researchers",
  "interview_type": "Persona Interview",
  "project_description": "Project aims to explore the research activities and motivations of user researchers to understand how the plan, execute, and analyze research materials.",
  "date": "2025-04-25T10:03:33.306046",
  "transcript": "[Dulaney, Stephen] 08:58:09\nThe transcript.\n\n[Dulaney, Stephen] 09:02:05\nGood morning, Nadia. And we don't have to do video if you don't want. I'm just… It's done.\n\n[Doutcheva, Nadia] 09:02:12\nGood morning.\n\n[Dulaney, Stephen] 09:02:13\nNice background. Do you have your permission to do a recording and a transcript?\n\n[Doutcheva, Nadia] 09:02:18\nYes, sir.\n\n[Dulaney, Stephen] 09:02:19\nThank you. Thank you so much for participating. In my study, it's been very, very enlightening for me, learning a lot about my study methods and all the other people around me.\n\n[Dulaney, Stephen] 09:02:30\nSo this is a research study about research studiers. And I've been a tool to manage to kind of help the discovery process.\n\n[Doutcheva, Nadia] 09:02:34\nOkay.\n\n[Dulaney, Stephen] 09:02:38\nIt occurred to me that I needed to talk to real users, real researchers and understand how they perform their work.\n\n[Dulaney, Stephen] 09:02:44\nAnd before I, so I've kind of gone back to phase zero, thrown out my original design an idea concept and conducted i'm targeting 20. This is my eighth interview different researchers. So thank you for participating.\n\n[Doutcheva, Nadia] 09:02:54\nWow. Yeah, of course.\n\n[Dulaney, Stephen] 09:03:00\nCan you tell me about yourself and how you got involved, how you became a user researcher? What's your background story?\n\n[Doutcheva, Nadia] 09:03:07\nYeah, so… My background is industrial systems engineering.\n\n[Doutcheva, Nadia] 09:03:14\nWhich…\n\n[Doutcheva, Nadia] 09:03:18\nI'm trying to figure out what's the key pieces here um so I really like that element of engineering because it had a lot of variety.\n\n[Doutcheva, Nadia] 09:03:29\nAnd a lot of like different facets of things that you could do And one of those things is human factors or human factors engineering or human factors ergonomics.\n\n[Doutcheva, Nadia] 09:03:40\nBut it's sort of this\n\n[Doutcheva, Nadia] 09:03:45\nFacet of engineering that is related to it's like very applied psychology Is how I explain it to people. And it's very much like okay, people are people, but we also exist in systems and how we exist as people affects how we interact with those systems and the technology and the tools and the processes and the tasks that we have to do\n\n[Doutcheva, Nadia] 09:04:14\nIn all of those systems.\n\n[Doutcheva, Nadia] 09:04:19\nAnd so Throughout undergrad, I wanted to try out each of these kind of elements of industrial systems engineering and the way I did that for human factors is I did a summer research program where I was paired with a graduate level researcher and a graduate level\n\n[Doutcheva, Nadia] 09:04:48\nHold on a sec.\n\n[Doutcheva, Nadia] 09:04:57\nSorry, some cat management here. And so I learned like what it meant and what it was like to do academic research and to do research professionally.\n\n[Doutcheva, Nadia] 09:05:13\nAnd I didn't really know that this was an option or that this was a job before I started, right? I was, you know, we don't get a lot of education undergrad about like what everything, what all the jobs are, what all the options are. So it was fun to\n\n[Doutcheva, Nadia] 09:05:30\nSee like, oh, okay, research is a job that people can have And so at this point, I was like.\n\n[Doutcheva, Nadia] 09:05:37\nRealizing that that's what I wanted to do. And at the same time realizing that like realizing that you know one summer research program would not make me a researcher and that I would have to like get more education to actually learn how to get these skills.\n\n[Doutcheva, Nadia] 09:05:56\nSo… I learned that you know i had to go to grad school which i didn't go to hadn't been wanting to do before then, but I knew I wanted to learn how to be a researcher, how to ask a research question, how to select the right method.\n\n[Doutcheva, Nadia] 09:06:12\nHow to figure out like how to isolate how to isolate the question so that I'm not like conflating learnings.\n\n[Doutcheva, Nadia] 09:06:24\nSo yeah, from that, I decided to go to grad school for human factors engineering. And then I I did the whole thing. I got a PhD.\n\n[Doutcheva, Nadia] 09:06:38\nLearn how to do research. And apply it in a number of different fields.\n\n[Doutcheva, Nadia] 09:06:44\nSo, yeah. Hmm?\n\n[Dulaney, Stephen] 09:06:45\nWhat was your research topic? What was your thesis topic?\n\n[Doutcheva, Nadia] 09:06:50\nSo my dissertation was on the information management systems and processes Specifically, as they exist and use the physical environment.\n\n[Doutcheva, Nadia] 09:07:05\nOf\n\n[Doutcheva, Nadia] 09:07:10\nCaregivers of children with medical complexity. So these are kids who are very like often they need a ventilator to breathe or a feeding tube.\n\n[Doutcheva, Nadia] 09:07:25\nAnd so their parents and caregivers have to become basically like doctors to be taking care of them full time often with very little to no existing, you know, healthcare knowledge So it was about how are they managing all of the things that they have to keep track of?\n\n[Doutcheva, Nadia] 09:07:46\nAs part of that and how are they using the physical environment to do that.\n\n[Dulaney, Stephen] 09:07:53\nThat sounds like a very personal study. What inspired you to choose that topic?\n\n[Doutcheva, Nadia] 09:07:58\nUm… it wasn't really personal. It was like what my lab was working on at the time and I really like the um the management piece.\n\n[Doutcheva, Nadia] 09:08:15\nOf it like information management, specifically the physical environment, I think there's this like idea of like distributed cognition, which like the simplest way to think about that is like writing a to-do list, right? So when you write a to-do list.\n\n[Doutcheva, Nadia] 09:08:27\nYou're like organizing your thoughts and you're keeping your\n\n[Doutcheva, Nadia] 09:08:34\nOops, sorry, you're keeping your brain from like having to manage all that stuff. So like you're distributing your cognition onto a piece of paper But that also happens in a lot of different ways with the physical environment. So like that's where that specific piece came from.\n\n[Doutcheva, Nadia] 09:08:54\nBut it was also just like. What my lab was working on at the time and I thought it was really cool. So I sort of became like the want the lead or one of the leads for that project overall.\n\n[Dulaney, Stephen] 09:09:06\nHow did that lead you to your current position at Deloitte?\n\n[Doutcheva, Nadia] 09:09:10\nI always knew that I wanted to go into industry, like even going into grad school i had learned enough going into it that I was like 75% going to go into industry and now academia when I finish. And I was very like upfront with my advisor and everything\n\n[Doutcheva, Nadia] 09:09:30\nAbout that. Um and I love technology. I always have.\n\n[Doutcheva, Nadia] 09:09:39\nAnd so like learning about user experience research is sort of the natural kind of evolution of, okay, I like want to work in tech. I love tech how do i do research in that.\n\n[Doutcheva, Nadia] 09:09:56\nAnd yeah, yeah, doing research there you know i considered like being like a research scientist Or, you know, if there's a couple other like research or research related roles like you know you could do like human factors and ergonomics um\n\n[Doutcheva, Nadia] 09:10:15\nPre-search, like more on the physical space, which I did a little bit of that in my last position But I knew that like UX research is like pretty much where I wanted to be\n\n[Doutcheva, Nadia] 09:10:29\nSo yeah, so I threw out grad school, I had a number of job experiences, you know, primarily internships And things like that.\n\n[Doutcheva, Nadia] 09:10:45\nVarious industries in UX research. And then my first like full-time role out of school was as an in-house UX researcher And I really liked that and I felt like I developed like an expertise there. But after a while, I didn't feel like I was learning. I just was doing the same stuff over and over again.\n\n[Doutcheva, Nadia] 09:11:09\nAnd so that's what sort of led me to consulting because I wanted to try a bunch of different industries, a bunch of different\n\n[Doutcheva, Nadia] 09:11:22\nClients, like ways of working. So that's sort of what led me to consulting.\n\n[Doutcheva, Nadia] 09:11:28\nAnd… Deloitte.\n\n[Dulaney, Stephen] 09:11:32\nOkay, in your current role at Deloitte, what is your primary\n\n[Doutcheva, Nadia] 09:11:39\nThat's kind of a loaded question. So as a UX researcher at Deloitte you know I'm supposed to get staffed on UX research projects and then help clients with um doing our UX research.\n\n[Doutcheva, Nadia] 09:11:56\nThat's what I like to do. I know there's a lot of other pieces or elements of what we're supposed to be doing here. I do really like\n\n[Doutcheva, Nadia] 09:12:12\nTeaching people or like meant not mentoring but like helping people develop their skills. I do think that I'm a little bit like unique Here, not a lot of other people with a lot of academic training. So it's fun and interesting for me to try to like\n\n[Doutcheva, Nadia] 09:12:30\nHelp people develop their research skills. So that's sort of another thing I like to do but primarily Get staffed on UX research projects and then do UX research in whatever capacity the project needs or requires.\n\n[Dulaney, Stephen] 09:12:47\nOkay, well, you may not know it, but I consider you a mentor to me.\n\n[Doutcheva, Nadia] 09:12:51\nOkay. Oh, thank you. I'm happy to do it.\n\n[Dulaney, Stephen] 09:12:53\nSo with this. You are. You've been great. I've been in the status, but I'm always saying. So with respect to your primary goal, what are some key frustrations you encounter?\n\n[Doutcheva, Nadia] 09:13:03\nUm. So… I'm going to keep it focused on like the actual research aspect. Although I think we both can agree that like getting staffed on projects and looking for projects is like a whole piece of this that is frustrating.\n\n[Doutcheva, Nadia] 09:13:22\nBut specifically to research i think Um… Okay, it's like three things. So number one is I don't often feel like I can affect the scope of how the research projects is planned.\n\n[Doutcheva, Nadia] 09:13:41\nAnd I feel like the people that do do that work are not skilled enough or not knowledgeable enough even in research to understand how long Especially a research project can take and like what you can get out of it in a certain amount of time\n\n[Doutcheva, Nadia] 09:13:59\nAnd so that leads me to like My second frustration is my second frustration is the timelines are often extremely, extremely limited.\n\n[Doutcheva, Nadia] 09:14:14\nThree weeks at the most. And… it's just not feasible to like go from zero to a finished product in three weeks when you're doing research.\n\n[Doutcheva, Nadia] 09:14:33\nThere's that. And I think that comes up again and again and again and again like this like this current like staff aug project that I'm on is like the longest I've ever worked on the same thing.\n\n[Doutcheva, Nadia] 09:14:46\nWhereas like before that, my longest project was eight weeks. And in that eight weeks, I did three things you know so it was like just the timelines can be really expedited. And I think that can lead to you know worse quality\n\n[Doutcheva, Nadia] 09:15:03\nSet up and prep worse quality recruiting and participants not getting to do as many sessions as I would like to do to be able to consider something comprehensive and then like the analysis is very like limited and how deep you can go\n\n[Doutcheva, Nadia] 09:15:24\nIn certain ways.\n\n[Dulaney, Stephen] 09:15:25\nOkay, so the next phase I want to talk about what is your current kind of state of your research practice right now? What kind of tools do you have and how are they working for you?\n\n[Doutcheva, Nadia] 09:15:37\nUm… So I think… you know that this is very like client dependent here Right now on my current client, I think of it as like I was kind of reflecting on this recently. So my current research cycles are in three weeks.\n\n[Doutcheva, Nadia] 09:15:56\nNow, it's really four weeks because there's like a week zero where I have to start recruiting And I do get like more context like leading up to those three weeks.\n\n[Doutcheva, Nadia] 09:16:10\nAnd I have a lot of like support and scoping and context So it is fast, but it's possible because I'm like embedded somewhere as opposed to like going in fresh but anyway In the three week cycles, I kind of think of it as like\n\n[Doutcheva, Nadia] 09:16:29\nOne week is the week word week or the docs week One week is the Excel week or the sheets week, and then one week is the the PowerPoint or slides week, right?\n\n[Doutcheva, Nadia] 09:16:44\nWeek one is like prep. So I'm writing the research guide in a document, the research plan, you know, writing the proposal And then getting some more information, writing the discussion guide in a document Then week two.\n\n[Doutcheva, Nadia] 09:17:03\nIs data collection. So I I think I've shown you how I take notes in Excel or spreadsheet.\n\n[Doutcheva, Nadia] 09:17:16\nSo that's like week two is my primary um tool.\n\n[Doutcheva, Nadia] 09:17:24\nAnd then week three is PowerPoint. So like analysis and reporting, which a lot of that will come from the PowerPoint too.\n\n[Doutcheva, Nadia] 09:17:32\nSorry, from the excel but um happens a lot in the PowerPoint. So I don't know. I just think that's kind of funny but really um a couple of things. So number one there's a like beyond that. So there is a very robust recruiting and like infrastructure team\n\n[Doutcheva, Nadia] 09:17:56\nSo I can just say like, I'm looking for this type of person and they just start finding that person, right? Like I make a screener and I send it to them.\n\n[Doutcheva, Nadia] 09:18:05\nBut like they do all the recruiting, all the scheduling, all of the organization related to that. So that's like one thing that is a huge accelerator to use a Deloitte term.\n\n[Doutcheva, Nadia] 09:18:26\nAnd then…\n\n[Doutcheva, Nadia] 09:18:31\nFor like pretty much like for prep and then data collection, it's just like me meeting with people, trying to understand what the goals are, like any kind of tutorial they can give me or about like the topic Trying to understand making sure that I understand the design intention\n\n[Doutcheva, Nadia] 09:18:52\nBut really, it's just like meeting and talking to people. To prep.\n\n[Doutcheva, Nadia] 09:18:59\nAnd then through\n\n[Doutcheva, Nadia] 09:19:04\nThe research week. It's just the session so Here, I do that a lot through Google Docs or sorry, what is it called teams no Meet, Google Meet.\n\n[Dulaney, Stephen] 09:19:14\nSheets or something. Oh, yeah, yeah, yeah.\n\n[Doutcheva, Nadia] 09:19:17\nSo instead of like Zoom. And then… For analysis.\n\n[Doutcheva, Nadia] 09:19:26\nThey have this interesting tool called recall Which you can upload all your videos and it will generate transcripts. And then it's like you can clip videos out fairly easily. So that's like a a good one if I have a little bit of extra time to like\n\n[Doutcheva, Nadia] 09:19:42\nThrow some videos or some quotes in there. And then… I think you've looked at Notebook LM.\n\n[Doutcheva, Nadia] 09:19:54\nA little bit. So I use that a little bit to try to pull like relevant quotes for participants. It's a little bit faster than like trying to control f through transcripts.\n\n[Doutcheva, Nadia] 09:20:11\nAnd then like people around me will use Gemini a lot, which is like Google's AI tool. I'm not\n\n[Dulaney, Stephen] 09:20:17\nOkay, we're going to, because I think you're starting to get to the next phase. So this is Daria. It's the Deloitte Advanced Research and Interview Assistant.\n\n[Doutcheva, Nadia] 09:20:22\nOkay.\n\n[Dulaney, Stephen] 09:20:27\nAnd so what we're trying to do is blank slate in the next three years, what would you need if you had a digital kind of interview research and interview assistant.\n\n[Dulaney, Stephen] 09:20:37\nWhat do you see happening in the next three years in that realm?\n\n[Doutcheva, Nadia] 09:20:57\nSo right now, I think one of the hardest parts of doing this is of doing this being one person.\n\n[Doutcheva, Nadia] 09:21:09\nAnd doing it all during this session. So in the session, you have to be asking questions listening, like trying to figure out program questions, trying to figure out how to like pull information out of people\n\n[Doutcheva, Nadia] 09:21:30\nSorry. I'm facing. Another apartment and sometimes you see stuff\n\n[Doutcheva, Nadia] 09:21:41\nPaying attention and also like taking notes and trying to watch behavior, especially if you're looking at a prototype together so like sometimes people will like be doing something and then actively saying the opposite.\n\n[Doutcheva, Nadia] 09:21:54\nAnd so trying to capture both what they're saying and what they're doing in a way While also talking to them and listening to them is um a big challenge.\n\n[Doutcheva, Nadia] 09:22:06\nAnd right now, I don't think any of the like AI note-taking tools are good enough for me to trust them to take notes completely.\n\n[Doutcheva, Nadia] 09:22:21\nWithout with me just like sitting back So… I think that would be something that would be really cool is if it could… like track behavior as they're like looking around on the prototype and what they're saying and first of all like\n\n[Doutcheva, Nadia] 09:22:46\nBe able to automatically be like measuring success or like failure or like confusion or errors that they do while we're clicking around on a prototype or even just talking about some designs.\n\n[Doutcheva, Nadia] 09:23:04\nAnd like any incongruence of what they say versus what they do.\n\n[Doutcheva, Nadia] 09:23:14\nAt a more like basic level, if I could just trust it to take like um take very high quality notes.\n\n[Doutcheva, Nadia] 09:23:25\nWhile understanding like the subtleties of like human behavior basically\n\n[Dulaney, Stephen] 09:23:39\nNow, have you found that it does anything with the transcripts that way or what\n\n[Doutcheva, Nadia] 09:23:43\nI mean, the transcripts are just transcripts, right? Like they're just what was said which I don't think is usually enough to like\n\n[Doutcheva, Nadia] 09:24:02\nFully capture the meaning or like the\n\n[Doutcheva, Nadia] 09:24:10\nNeeds fully you know and so and like sometimes\n\n[Dulaney, Stephen] 09:24:13\nThen I'm going to have to work on because I do think the video and the observation, and I think it could Because I do have a word captures emotions from the transcript, but it's not looking.\n\n[Dulaney, Stephen] 09:24:24\nIt probably can if we try to enable that. Because I'm going to go on a little bit. Can you tell me a story of a project that seemed it was going to be dead simple and then no matter how hard you tried.\n\n[Dulaney, Stephen] 09:24:34\nEvery step of the way it was frustrating and just hard.\n\n[Doutcheva, Nadia] 09:24:38\nUh-huh. Um…\n\n[Doutcheva, Nadia] 09:24:48\nI'm like, how dramatic do we want to get So…\n\n[Doutcheva, Nadia] 09:25:02\nOkay, let me talk about this one. A couple of years ago, I was on a project that we it was something like we were trying to improve like the supplier\n\n[Doutcheva, Nadia] 09:25:23\nProcess. Supplier selection process.\n\n[Doutcheva, Nadia] 09:25:31\nSo we did, it was supposed to be three phases. We did… it was supposed to be interviews, survey, and then a workshop, I guess.\n\n[Doutcheva, Nadia] 09:25:46\nI ended up only being able to do the interviews and the workshop or sorry, and the survey, not the workshop. I set everything up for the workshop but\n\n[Doutcheva, Nadia] 09:26:04\nIt was… Again, I think timing is really an issue and especially when a client like doesn't fully understand that like, okay, if we want to have this timeline, like you have to be ready to provide all this stuff for me.\n\n[Doutcheva, Nadia] 09:26:16\nSo like for the interviews, I was interviewing like internal people into the client\n\n[Doutcheva, Nadia] 09:26:26\nLike, yeah, people who work on like the supplier selection process but like The client had no idea how to like select people, how to find people. So that was a big journey and then I was like developing the questions and the questions\n\n[Doutcheva, Nadia] 09:26:44\nThe scope that the client wanted was like was like was like was like way more than you could cover in a one hour interview um and I think people hate to hear that because it's like an hour is such a long time, but it's like, really, it's not. It's really not. If you want something good, it's not.\n\n[Doutcheva, Nadia] 09:27:04\nA long time. And then…\n\n[Doutcheva, Nadia] 09:27:12\nWhen it came to the survey.\n\n[Doutcheva, Nadia] 09:27:21\nIt was just… like I had written questions with the intent of capturing like okay, what are the major pain points of\n\n[Doutcheva, Nadia] 09:27:39\nThe process for like these external And that's Some of them were about like perception. Some of them were about actual ease. Some of them were about understanding And my client…\n\n[Doutcheva, Nadia] 09:28:05\nThought that she knew better. And so then she actually like triplicated all of the questions that there was like one question about understanding ease of use and perception for each topic.\n\n[Doutcheva, Nadia] 09:28:22\nAnd it didn't make sense, frankly. And it was so repetitive and it literally tripled the length of the survey. And I was like, you really think that we're going to get people to answer this now that it's like 45 questions long like Okay.\n\n[Doutcheva, Nadia] 09:28:39\nAnd then… she really wanted like heavy quantitative analysis and she kept being like Regression, regression, regression, regression but like\n\n[Doutcheva, Nadia] 09:28:55\nIt's just like\n\n[Doutcheva, Nadia] 09:28:59\nLike she was asking to put like a car tire on a bicycle You know what I mean? Like it just not what she was asking for like didn't make any sense.\n\n[Doutcheva, Nadia] 09:29:12\nAnd I kept being like, okay, like here is like the quantitative modeling that we can do like here's like.\n\n[Doutcheva, Nadia] 09:29:19\nWhat would make sense with the data that we have, you know.\n\n[Doutcheva, Nadia] 09:29:24\nShe just wouldn't listen to me. And I was like, well, I don't know like I can't give you what you want because it's wrong. Like I can run a regression on this, but it's not going to tell you anything.\n\n[Doutcheva, Nadia] 09:29:38\nAnd none of the things are going to be like significant. And so like, we're all just wasting our time.\n\n[Doutcheva, Nadia] 09:29:46\nSo that was really challenging and like If I had known that she wanted all this like complicated quantitative analysis, then we would have run the survey in a completely different way or I would have like trying to like we should have said in advance like this is the analysis that we want to do based on the questions that we have.\n\n[Doutcheva, Nadia] 09:30:09\nBut, um. Yeah.\n\n[Dulaney, Stephen] 09:30:14\nThat's a good story. I got what I needed out of that.\n\n[Doutcheva, Nadia] 09:30:17\nYeah.\n\n[Dulaney, Stephen] 09:30:18\nSo, and it sounds familiar too. That's how I met Ted. They wanted a survey.\n\n[Dulaney, Stephen] 09:30:21\nAnd I wasn't confident in myself. And so I got dead.\n\n[Dulaney, Stephen] 09:30:25\nAnd he did great. Okay, so the next phase I want to go into your process and you've already kind of described it once, but I want to go through it in a little more detail. When you know that you're going to have a study.\n\n[Dulaney, Stephen] 09:30:36\nHow do you start? What is involved in your um Document week.\n\n[Doutcheva, Nadia] 09:30:42\nOkay. The longest part typically that is like most out of your control is the recruiting so Pretty much as soon as that's like the first place that you have to start like with the client or with the stakeholders is, okay, let's align on who we want\n\n[Doutcheva, Nadia] 09:31:04\nFor this. And who's going to make the most sense, right? And people love to be like, okay, we want to talk to this type of user and this type of user and this type of user and these age groups. And it's like, okay, like.\n\n[Doutcheva, Nadia] 09:31:16\nEspecially in limited time, we only have this much time. Like if we have a long time, great. Let's segment. Let's do all the groups.\n\n[Doutcheva, Nadia] 09:31:25\nYou know um but if we have one week we have to kind of really narrow down, really be specific\n\n[Doutcheva, Nadia] 09:31:34\nAnd then basically like you have to start recruiting as soon as possible. So that's like what happens in week zero, which is what overlaps with like the week three of reporting of the previous study for me right now in my current process.\n\n[Doutcheva, Nadia] 09:31:49\nGiven that I am like running a rapid research program, so it's intentionally quick.\n\n[Doutcheva, Nadia] 09:31:58\nSo… Yeah, I think if you want it to be fast, especially you have to start recruiting quickly And so that really means like defining your participants. And at the same time, I'm also trying to like define as much scope as possible. So like, what are we trying to learn\n\n[Doutcheva, Nadia] 09:32:20\nLike what do we really want out of this? What are the goals that we have out of this research? So a lot of that can go hand in hand with the\n\n[Dulaney, Stephen] 09:32:31\nNow, do you start with research goals or research questions or both? And what's the difference?\n\n[Doutcheva, Nadia] 09:32:31\nRecruitment.\n\n[Doutcheva, Nadia] 09:32:39\nI think goals are a little bit easier for people to like understand.\n\n[Doutcheva, Nadia] 09:32:47\nResearch questions are kind of can often be brought by those goals.\n\n[Doutcheva, Nadia] 09:32:55\nBut I feel like non-researchers don't care as much about research questions.\n\n[Doutcheva, Nadia] 09:33:05\nSo, um. Yeah.\n\n[Doutcheva, Nadia] 09:33:10\nAnd… Yeah, I think it's important to start with the goals because like people will be like, okay, I have this design, I want to make sure it's going to work right so like that's often the situation that will come to me is like, let's test this design. It's like, okay, what do we want to test?\n\n[Doutcheva, Nadia] 09:33:30\nWhat stage is this in? Are we testing perception? Are we testing usability? Are we testing like acceptance of new features like what actually um are we like, do we want needs pain points, you know what I mean?\n\n[Dulaney, Stephen] 09:33:45\nAnd so you're asking all those questions and what do they determine? You're asking this question for a reason.\n\n[Dulaney, Stephen] 09:33:51\nSo when you get all those answers, what is that going to dictate?\n\n[Doutcheva, Nadia] 09:33:55\nSo it dictates the legit, the type of study and like a lot of the logistics of the study so okay are we doing a usability test? Are we doing a design validation interview?\n\n[Doutcheva, Nadia] 09:34:10\nDo we want to do like more of a generative like needs conversation um like I'm like requirement gathering. Are we testing like perception, are we testing like multiple designs to see which one is better And why?\n\n[Doutcheva, Nadia] 09:34:31\nRight. It's kind of giving me like the outline of how and what kind of study I'm going to do.\n\n[Doutcheva, Nadia] 09:34:43\nAnd how to like run the session so like And yeah. And so also like at the same time, it's important to be getting the design right and understanding like how how is it supposed to work? How are we intending this? What is the purpose of each of these things?\n\n[Doutcheva, Nadia] 09:35:03\nSo that… I can like ask questions to people without like directly asking the question, you know what I mean?\n\n[Doutcheva, Nadia] 09:35:17\nDid that answer your question?\n\n[Dulaney, Stephen] 09:35:17\nYes, that does. So now you have a plan. When you start out, do you kind of have like a known plan that you have reused in your mind?\n\n[Dulaney, Stephen] 09:35:26\nAnd then you just kind of use your clarifying questions to pick elements.\n\n[Dulaney, Stephen] 09:35:30\nOf what activities you're going to have. And what activities you're not going to have.\n\n[Doutcheva, Nadia] 09:35:36\nNot really. I have like a little template just for like the structure. So I remember like, okay, we.\n\n[Doutcheva, Nadia] 09:35:43\nI mean, at this point, it's like the most important thing is like participants and like goal and then what kind of design do we have or are we doing like what stage is it in But then I just sort of like fill out\n\n[Doutcheva, Nadia] 09:36:02\nThe structure that I have made. Um but\n\n[Dulaney, Stephen] 09:36:07\nOkay, and so during the actual data collection week, what are your activities? What are the easy parts? What are the hard parts? And where does all the time go?\n\n[Doutcheva, Nadia] 09:36:17\nSo during data collection week. So again, really helpful to have like a recruiter or like some like a partner that you're working with to help schedule and stuff so Thankfully, we have that. So that can be a lot of it, right? It's like the logistics of scheduling\n\n[Doutcheva, Nadia] 09:36:36\nSessions. And then like getting people to sign the appropriate paperwork ahead of time and then like afterwards getting them incentives so thankfully i don't have to do that. I have had to do that in the past but It is what it is.\n\n[Doutcheva, Nadia] 09:36:55\nBut really it's really making sure that One, like I know the context of the participant I'm about to interview going in.\n\n[Doutcheva, Nadia] 09:37:06\nSo like, you know, based on their answers to the screener, you know, some of the like introduction questions especially might be a little bit different.\n\n[Doutcheva, Nadia] 09:37:20\nExcuse me. So yeah, making sure I know like the context of the participant. And then really it's like.\n\n[Doutcheva, Nadia] 09:37:29\nDoing the actual interviews can be very like time.\n\n[Doutcheva, Nadia] 09:37:35\nIntensive and like like brain power intensive, right? Because as I mentioned, you have to be listening, you have to be preparing the next question probing on what they're talking about, taking notes, also observing their behavior and their intonation their like\n\n[Doutcheva, Nadia] 09:37:51\nSubtleties So that's challenging and then challenging and then I've talked about the importance of a post-session summary before so I usually reserve like half the time the interview after so if I'm doing a one hour log session i will\n\n[Doutcheva, Nadia] 09:38:16\nReserve a half hour right after to make sure I'm like writing my um interview summary or sorry, post interview Yeah, post-interview summary.\n\n[Doutcheva, Nadia] 09:38:28\nPost-session summary. And especially in the beginning of the sessions or depending on the type of sessions, like how much structure that has can really affect how easier, difficult or quick or slow that process happens.\n\n[Doutcheva, Nadia] 09:38:51\nYeah. And then, you know, there's like the logistics of making sure all of the transcripts and the video recordings and the notes are like organized and go into the right folders and you're like keeping everything on track.\n\n[Doutcheva, Nadia] 09:39:11\nLike uploading it to like uploading it whatever tools you need to be using, saving it to the correct folders, and especially if there's like any PII involved, like making sure that the data is properly handled properly The recordings are properly handled. Out of every transcript, basically I have to like\n\n[Doutcheva, Nadia] 09:39:33\nTake out the name and any like identifying information of the participant\n\n[Doutcheva, Nadia] 09:39:44\nYeah. So that's like during research week.\n\n[Dulaney, Stephen] 09:39:49\nHe had an assistant for that week, what would the digital assistant be working on?\n\n[Doutcheva, Nadia] 09:39:50\nMost of them.\n\n[Dulaney, Stephen] 09:39:52\nTo help you save time.\n\n[Doutcheva, Nadia] 09:39:56\nThe digital assistant.\n\n[Dulaney, Stephen] 09:40:02\nEven if you had a person assistant, what would they be doing?\n\n[Doutcheva, Nadia] 09:40:05\nWell, a personal assistant is always really helpful to be doing a lot of the note taking so that I can focus on like being in the moment with the participant and like asking the next question.\n\n[Doutcheva, Nadia] 09:40:19\nAnd like only noting down like certain things that I find are like extra kind of insightful And so anytime i've had\n\n[Doutcheva, Nadia] 09:40:32\nLike a assistant it's helpful to do that. And then also like doing the session summary with them to make sure like, okay, we had two eyes, like they said this, how did you interpret this? I interpret it this way okay we match great oh we don't match okay we're going to have to go back and like look at the recording and look at it again.\n\n[Doutcheva, Nadia] 09:40:56\nSo yeah, like taking notes in the moment is really important and then I cannot stress enough.\n\n[Doutcheva, Nadia] 09:41:03\nEspecially when we're trying to be time efficient, the importance of a post-session summary\n\n[Doutcheva, Nadia] 09:41:12\nAnd one that is comprehensive, you know. Like one problem right now I have with a lot of like digital or like AI summaries of meetings or sessions or whatever is that like they will do a okay job like summarizing the conversation, but it doesn't feel comprehensive, right? And so that's what I like to do in the post session summary is I'm like, okay, what are all the topics that we talked about? What did the participants say about each of them?\n\n[Doutcheva, Nadia] 09:41:42\nAnd even if it's not like that notable, right? If they understood something and they liked it like okay that's not, it's like, okay, great. Like that thing worked. Whereas I feel like summaries like that tend to focus on like the conflicts or the problems. And it's like, that's fine. And that's very important to know. But also I'm going to want to\n\n[Doutcheva, Nadia] 09:42:06\nBe confident that okay Sure, three people said that there's these problems But if I don't have any information on the other nine people.\n\n[Doutcheva, Nadia] 09:42:19\nWhether they thought it was fine or good or not, did we just not talk about it? Did it just like not get covered?\n\n[Doutcheva, Nadia] 09:42:28\nDid or did they like it and it was fine or were they did they like were they having the same problems and they were finding the pattern that like they were running into the same pattern that already exists. So I just didn't feel like it was\n\n[Doutcheva, Nadia] 09:42:41\nIn the moment, I just wrote down like a really easy note or whatever So, um.\n\n[Doutcheva, Nadia] 09:42:49\nBeing really like comprehensive and thorough you know so like every kind of note has the same elements so that I feel confident like okay looking at my data you know looking at my data we have our like six topics\n\n[Doutcheva, Nadia] 09:43:09\nOut of our 12 participants here's what they said about all of those six topics.\n\n[Dulaney, Stephen] 09:43:17\nOkay, so now let's go to the third week, the PowerPoint week. What do you do in the president announces in PowerPoint week?\n\n[Doutcheva, Nadia] 09:43:26\nYeah, so because I only have you know, a week do the analysis and the reporting. I tend to very heavily rely on my post-session summaries to help me do the analysis. And that's why I'm very like keen on doing them immediately after and why i\n\n[Doutcheva, Nadia] 09:43:50\nI'm very like say that it's very important to be very comprehensive, right? So I can say like, okay, these are all like, these are all the main topics.\n\n[Doutcheva, Nadia] 09:43:59\nLet's go through what the participants said about each of them.\n\n[Doutcheva, Nadia] 09:44:04\nSo then basically what I do is I go through like the discussion guide or whatever like And I list out all of the topics that were discussed And then I sort of go And whether I do it in a list or whatever, like I sort of go\n\n[Doutcheva, Nadia] 09:44:28\nSometimes I will just like put the topic as like the slide title you know and then I'll just kind of go one topic at a time.\n\n[Doutcheva, Nadia] 09:44:38\nTo be like, okay, we talked about like the file browser, what was everybody's what did everybody say about the file browser? Okay, like looking at my session summaries, I know that like three people said this, six people said this, three people said this. Okay, great.\n\n[Doutcheva, Nadia] 09:44:57\nAnd then I like kind of summarize that and then i develop like develop a\n\n[Doutcheva, Nadia] 09:45:07\nDesign recommendation if relevant based on that.\n\n[Doutcheva, Nadia] 09:45:15\nAnd then I just go on to the next topic, right? Because like.\n\n[Doutcheva, Nadia] 09:45:20\nThese things are quick. And like specifically my role right now, I am doing like a lot of design validation and rapid like rapid research. And so like It doesn't have to be super in-depth, right?\n\n[Doutcheva, Nadia] 09:45:35\nIt does. But right now that's sort of where I'm at, where I'm like, okay, these are all the topics. And sometimes like stuff will come out in the interviews that You weren't expecting to come out or that what isn't necessarily like one of the\n\n[Doutcheva, Nadia] 09:45:55\nTopics that you were thinking of. And so I will write that kind of stuff down in the in my notes and in the session summary And then I try to like include it You know, I was like, okay, like.\n\n[Doutcheva, Nadia] 09:46:11\nWe didn't mean to talk about dragging and dropping organization, but that kept coming up. So I'm going to bring it up.\n\n[Dulaney, Stephen] 09:46:19\nSo you add a topic based on something like that. Okay, so I'm going to move to another section that was very helpful and I'll probably come back to that.\n\n[Doutcheva, Nadia] 09:46:22\nMm-hmm.\n\n[Dulaney, Stephen] 09:46:27\nI want to ask three questions. Who do you work with? Who are your collaborators? Who do you work for and who benefits from your work?\n\n[Dulaney, Stephen] 09:46:35\nSo the benefits from your work would be like your customer, who do you work for would be like your boss and who do you collaborate with would be like your coworkers.\n\n[Doutcheva, Nadia] 09:46:44\nYeah, so with, I work with\n\n[Doutcheva, Nadia] 09:46:50\nThere's like one other researcher right now who is like\n\n[Doutcheva, Nadia] 09:46:59\nAdjacent to me slash like she's like… my main like correspondent basically like I know what the next topic is going to be like from her And then I will go and and that's who I'm working four right are like my stakeholders which is\n\n[Doutcheva, Nadia] 09:47:21\nProduct managers and the UX designers. And the engineers sometimes I do think the UX designer is also like a whiff Because I have to rely on them for the designs and for like any stimulus that I need to And I will often like be like, okay, this part of the prototype, you need to connect it better like this part of the prototype, I have a question here like\n\n[Doutcheva, Nadia] 09:47:51\nOh, we need like a little example here. Can you add in something into the prototype here? So I think that designers also the width.\n\n[Doutcheva, Nadia] 09:47:58\nAnd they also like are the ones that benefit the most from… my research, right, is because they get like design recommendations and design direction And that also goes like for the pms\n\n[Doutcheva, Nadia] 09:48:19\nAnd sometimes engineering, depending on how feasible my recommendation is. Sometimes they're like, you're making my job harder and I'm like.\n\n[Doutcheva, Nadia] 09:48:26\nI'm trying to make the engineers or the engineers the user's job easier.\n\n[Dulaney, Stephen] 09:48:33\nOkay, so of those three, who benefits most, which is kind of the UX and your users, and who you work for, which is also UX, I think that's interesting, employees, and who you work with, which one would you rate first? Most important? Which one would you rate next important and which one would you rate next important after that?\n\n[Doutcheva, Nadia] 09:48:57\nI mean, it depends on how like importance of what, right? If it's like importance of keeping my job, then who I work for is the most important Like making sure that like the PMs and the designers are like happy with my work and finding\n\n[Doutcheva, Nadia] 09:49:15\nThat it's the most valuable. And I think like because right now I'm in a B2B situation, that's probably still true because um you know, like the user is just like like the user of this tool, it's not necessarily like, you know, like sometimes like in healthcare or in driving, it's like, no, like.\n\n[Doutcheva, Nadia] 09:49:37\nThe user is the most important and we should all be working towards that. You know, if it's like a safe, any kind of like safety or like healthcare situation Right. But like all contexts are a little bit different. So right now um\n\n[Doutcheva, Nadia] 09:49:57\nYeah. I'm not in a safety critical\n\n[Dulaney, Stephen] 09:49:58\nThank you. So the next question after that is What do you consider the victory event?\n\n[Doutcheva, Nadia] 09:50:11\nFor me? I think the presentation.\n\n[Doutcheva, Nadia] 09:50:17\nSo after I present. Get like getting to or like even during the presentation, if people are like engaged and like asking me questions and like having a discussion, I consider that to be like a victory because it shows that people are like interested in what I'm saying and are finding it valuable.\n\n[Doutcheva, Nadia] 09:50:36\nAnd any kind of like questions that I get to answer, it's like, okay, like.\n\n[Doutcheva, Nadia] 09:50:40\nLike this is causing you to think And I'm like supporting that.\n\n[Dulaney, Stephen] 09:50:48\nOkay, that's a good one. So now this is the next part. This is my kind of user experience framework. I consider it people really kind of will say that we did a good job.\n\n[Dulaney, Stephen] 09:50:57\nIf they understand the value, if they understand the problems we solve, if they gain education.\n\n[Dulaney, Stephen] 09:51:03\nIf the tools are really good and the look and the feel.\n\n[Dulaney, Stephen] 09:51:07\nSo I want you to kind of think about your work as an educator and an evangelizer as a UX researcher. How do you teach or communicate the value of your work?\n\n[Doutcheva, Nadia] 09:51:23\nI will be 100% honest. I hate doing this. And I think this is my least favorite part because To me, it's so obvious that it's like frustrating to me when it's not when i when i have like it feels like I'm teaching the alphabet to people\n\n[Doutcheva, Nadia] 09:51:43\nYou know what I mean? I'm like, what do you like we're making this product better.\n\n[Doutcheva, Nadia] 09:51:50\nYou know, and\n\n[Dulaney, Stephen] 09:51:50\nSo what problem are you solving on a repeated basis?\n\n[Doutcheva, Nadia] 09:51:58\nI am improving the efficiency, understandability.\n\n[Doutcheva, Nadia] 09:52:09\nLike…\n\n[Doutcheva, Nadia] 09:52:14\nProblems, lack of functionality that exists. In you know a tool or whatever the product is, right? Whether it's software or not working to make that product better, whether it's like developing new features, reducing pain points like creating like making it\n\n[Doutcheva, Nadia] 09:52:41\nMore intuitive, which is a terminology that i don't love But… Yeah. So I'm like working to improve the product in like a number of ways\n\n[Dulaney, Stephen] 09:52:55\nOkay, so how about the, how do you communicate the value of the tools that you use in your work?\n\n[Doutcheva, Nadia] 09:53:04\nUm… the tools i mean\n\n[Dulaney, Stephen] 09:53:10\nAnd I extended to like tools and techniques.\n\n[Doutcheva, Nadia] 09:53:14\nYeah, so…\n\n[Doutcheva, Nadia] 09:53:19\nIt depends on the tools, right? Like something like MUIQ, I think is like a really interesting thing that is like, okay, like it's a great example of like an accelerator Right. Or like any any tool that allows you to do like unmoderated research is interesting because it's like, okay, well, we can get a lot of\n\n[Doutcheva, Nadia] 09:53:39\nAnswers in a short amount of time so like a short amount of time You want to talk to 50 people? Okay, I can't talk to 50 people in a week, but we can do 50 unmoderated interviews and then like\n\n[Doutcheva, Nadia] 09:53:52\nThere's some like automation that those tools have that they can say like, okay.\n\n[Doutcheva, Nadia] 09:53:57\nThis is the success rate. This is the failure if We want… I don't know. I think it's tricky because it's tricky I think people tend to think people tend to overvalue tools And like the critical things that we need tools for is\n\n[Doutcheva, Nadia] 09:54:23\nLike like the biggest blockers i feel like is recruiting.\n\n[Doutcheva, Nadia] 09:54:32\nAnd… like time basically So if…\n\n[Dulaney, Stephen] 09:54:37\nSo let me switch the last one because what is the value of the look and the feel of your artifacts?\n\n[Dulaney, Stephen] 09:54:46\nHow important is it?\n\n[Doutcheva, Nadia] 09:54:49\nOf like the designs that I'm testing or like my reports\n\n[Dulaney, Stephen] 09:54:52\nReports.\n\n[Doutcheva, Nadia] 09:54:57\nUm I think it's very like context dependent or client dependent and like sorry to give like another like it depends answer but um Sometimes people will really like over index on like, oh, like if the presentation looks good, it means it must be good. I think that's like a very Deloitte\n\n[Doutcheva, Nadia] 09:55:21\nThinking and I don't think that's always true and true So… like what I consider to be a good presentation is not necessarily one that like looks good. I mean, obviously it has to be consistent. I think it needs to have like clear like you can apply like UX principles to like\n\n[Doutcheva, Nadia] 09:55:42\nReports, right? Like the points have to be clear. The action item based or the so what of every slide has to be clear\n\n[Doutcheva, Nadia] 09:55:56\nAnd so on. And so I think like And I think the reports need to be able to stand on their own without the voiceover. I think that's something that gets left behind a lot.\n\n[Dulaney, Stephen] 09:56:10\nNow, what role does like outside educational material play? Do you have to have like go-to sources or do you use anything where you're trying to um educate and evangelize. I know you don't have to, but I know that been in this work long enough that if you want to do the work, you have to evangelize.\n\n[Doutcheva, Nadia] 09:56:26\nOh, yeah. I think it's more of like communication tools, right? So like if you can illustrate like what the difference different um what the different possible like types of studies are or the different deliverables, right? Like, are we just doing like a findings report or are we doing a user journey are we like\n\n[Doutcheva, Nadia] 09:56:55\nCreating are we like gathering requirements or are we like what you know so what are the different like outcomes or like deliverables to use like the Deloitte terminology\n\n[Doutcheva, Nadia] 09:57:10\nAnd so like having like visual references or guides to show like, okay, if we have this problem this is this is how we figure that out. This is the research that we do to solve that problem.\n\n[Doutcheva, Nadia] 09:57:26\nSo I think that type of stuff can be very valuable in trying to communicate with people who don't necessarily understand the value of research.\n\n[Doutcheva, Nadia] 09:57:35\nFor the full.\n\n[Dulaney, Stephen] 09:57:35\nIf you have a magic wand, what one thing would you change about your research environment?\n\n[Doutcheva, Nadia] 09:57:44\nOh, what a fun question.\n\n[Doutcheva, Nadia] 09:57:53\nI would… make all participants\n\n[Doutcheva, Nadia] 09:58:02\nMore like forthcoming and like easier to kind of converse with and like be like make it easier to find participants who are like exactly the type of person or like person or like the user that we're looking for.\n\n[Dulaney, Stephen] 09:58:19\nOkay, so during a project, is there anything that keeps you up at night?\n\n[Doutcheva, Nadia] 09:58:30\nOnly my client's expectations and if they're unreasonable.\n\n[Dulaney, Stephen] 09:58:36\nOkay, so I'm going to ask a UX researcher that's both your customer and your coworker and your And your boss to describe Nadia to me in one word, what one word would you want them to tell me?\n\n[Doutcheva, Nadia] 09:58:51\nCurious.\n\n[Dulaney, Stephen] 09:58:51\nOkay, very good. Are there any questions that you expected me to ask that I have forgotten to include in my questioning so far.\n\n[Doutcheva, Nadia] 09:59:05\nMaybe like, how do I expect to interact with tools throughout the process like any and because I feel like you're developing a new tool so how do i interact with how how do I expect to interact with the future?\n\n[Dulaney, Stephen] 09:59:19\nOkay, well, the sad part is we were such a good interview subject that we used all of the time.\n\n[Doutcheva, Nadia] 09:59:25\nI think I lost you. Yes, I do have to run.\n\n[Dulaney, Stephen] 09:59:26\nOh, I'm still here. You here? You do have to run so I will, do I have one minute?\n\n[Doutcheva, Nadia] 09:59:37\nNo, I'm only presenting.\n\n[Dulaney, Stephen] 09:59:37\nOkay. Then I won't do it. That sounds good. So another time I want to share the tools because I want to want your help on like what the hell I'm trying to do and what I've accomplished so far. So I've done a lot of stuff and I realized it was for me.\n\n[Dulaney, Stephen] 09:59:50\nAnd then when I talk to researchers, I'm trying to rethink it and go from fresh and make it more for you.\n\n[Doutcheva, Nadia] 09:59:52\nYeah.\n\n[Dulaney, Stephen] 09:59:56\nThank you so much, Nadia, for your participation. What kind of interview was that? I used the same script for the whole 20 years.\n\n[Dulaney, Stephen] 10:00:03\nWhat am I doing?\n\n[Doutcheva, Nadia] 10:00:06\nI think… a little bit of like a little bit of like It seemed more generative, a little bit of like requirements gathering. Yeah, I really, we can talk more, but I really have to run because I'm presenting.\n\n[Dulaney, Stephen] 10:00:17\nBye-bye. Thanks again.\n\n",
  "chunks": [
    {
      "text": " [Dulaney, Stephen] 08:58:09 The transcript.  [Dulaney, Stephen] 09:02:05 Good morning, Nadia. And we don't have to do video if you don't want. I'm just… It's done.  [Doutcheva, Nadia] 09:02:12 Good morning.  [Dulaney, Stephen] 09:02:13 Nice background. Do you have your permission to do a recording and a transcript?  [Doutcheva, Nadia] 09:02:18 Yes, sir.  [Dulaney, Stephen] 09:02:19 Thank you. Thank you so much for participating. In my study, it's been very, very enlightening for me, learning a lot about my study methods and all the other people around me.  [Dulaney, Stephen] 09:02:30 So this is a research study about research studiers. And I've been a tool to manage to kind of help the discovery process.  [Doutcheva, Nadia] 09:02:34 Okay.  [Dulaney, Stephen] 09:02:38 It occurred to me that I needed to talk to real users, real researchers and understand how they perform their work.  [Dulaney, Stephen] 09:02:44 And before I, so I've kind of gone back to phase zero, thrown out my original design an idea concept and conducted i'm targeting 20. This is my eighth interview different researchers. So thank you for participating.  [Doutcheva, Nadia] 09:02:54 Wow. Yeah, of course.  [Dulaney, Stephen] 09:03:00 Can you tell me about yourself and how you got involved, how you became a user researcher? What's your background story?  [Doutcheva, Nadia] 09:03:07 Yeah, so… My background is industrial systems engineering.  [Doutcheva, Nadia] 09:03:14 Which…  [Doutcheva, Nadia] 09:03:18 I'm trying to figure out what's the key pieces here um so I really like that element of engineering because it had a lot of variety.  [Doutcheva, Nadia] 09:03:29 And a lot of like different facets of things that you could do And one of those things is human factors or human factors engineering or human factors ergonomics.  [Doutcheva, Nadia] 09:03:40 But it's sort of this  [Doutcheva, Nadia] 09:03:45 Facet of engineering that is related to it's like very applied psychology Is how I explain it to people. And it's very much like okay, people are people, but we also exist in systems and how we exist as people affects how we interact with those systems and the technology and the tools and the processes and the tasks that we have to do  [Doutcheva, Nadia] 09:04:14 In all of those systems.  [Doutcheva, Nadia] 09:04:19 And so Throughout undergrad, I wanted to try out each of these kind of elements of industrial systems engineering and the way I did that for human factors is I did a summer research program where I was paired with a graduate level researcher and a graduate level  [Doutcheva, Nadia] 09:04:48 Hold on a sec.  [Doutcheva, Nadia] 09:04:57 Sorry, some cat management here. And so I learned like what it meant and what it was like to do academic research and to do research professionally.  [Doutcheva, Nadia] 09:05:13 And I didn't really know that this was an option or that this was a job before I started, right? I was, you know, we don't get a lot of education undergrad about like what everything, what all the jobs are, what all the options are. So it was fun to  [Doutcheva, Nadia] 09:05:30 See like, oh, okay, research is a job that people can have And so at this point, I was like.  [Doutcheva, Nadia] 09:05:37 Realizing that that's what I wanted to do. And at the same time realizing that like realizing that you know one summer research program would not make me a researcher and that I would have to like get more education to actually learn how to get these skills.  [Doutcheva, Nadia] 09:05:56 So… I learned that you know i had to go to grad school which i didn't go to hadn't been wanting to do before then, but I knew I wanted to learn how to be a researcher, how to ask a research question, how to select the right method.  [Doutcheva, Nadia] 09:06:12 How to figure out like how to isolate how to isolate the question so that I'm not like conflating learnings.  [Doutcheva, Nadia] 09:06:24 So yeah, from that, I decided to go to grad school for human factors engineering. And then I I did the whole thing. I got a PhD.  [Doutcheva, Nadia] 09:06:38 Learn how to do research. And apply it in a number of different fields.  [Doutcheva, Nadia] 09:06:44 So, yeah. Hmm?  [Dulaney, Stephen] 09:06:45 What was your research topic? What was your thesis topic?  [Doutcheva, Nadia] 09:06:50 So my dissertation was on the information management systems and processes Specifically, as they exist and use the physical environment.  [Doutcheva, Nadia] 09:07:05 Of  [Doutcheva, Nadia] 09:07:10 Caregivers of children with medical complexity. So these are kids who are very like often they need a ventilator to breathe or a feeding tube.  [Doutcheva, Nadia] 09:07:25 And so their parents and caregivers have to become basically like doctors to be taking care of them full time often with very little to no existing, you know, healthcare knowledge So it was about how are they managing all of the things that they have to keep track of?  [Doutcheva, Nadia] 09:07:46 As part of that and how are they using the physical environment to do that.  [Dulaney, Stephen] 09:07:53 That sounds like a very personal study. What inspired you to choose that topic?  [Doutcheva, Nadia] 09:07:58 Um… it wasn't really personal. It was like what my lab was working on at the time and I really like the um the management piece.  [Doutcheva, Nadia] 09:08:15 Of it like information management, specifically the physical environment, I think there's this like idea of like distributed cognition, which like the simplest way to think about that is like writing a to-do list, right? So when you write a to-do list.  [Doutcheva, Nadia] 09:08:27 You're like organizing your thoughts and you're keeping your  [Doutcheva, Nadia] 09:08:34 Oops, sorry, you're keeping your brain from like having to manage all that stuff. So like you're distributing your cognition onto a piece of paper But that also happens in a lot of different ways with the physical environment. So like that's where that specific piece came from.  [Doutcheva, Nadia] 09:08:54 But it was also just like. What my lab was working on at the time and I thought it was really cool. So I sort of became like the want the lead or one of the leads for that project overall.  [Dulaney, Stephen] 09:09:06 How did that lead you to your current position at Deloitte?  [Doutcheva, Nadia] 09:09:10 I always knew that I wanted to go into industry, like even going into grad school i had learned enough going into it that I was like 75% going to go into industry and now academia when I finish. And I was very like upfront with my advisor and everything  [Doutcheva, Nadia] 09:09:30 About that. Um and I love technology. I always have.  [Doutcheva, Nadia] 09:09:39 And so like learning about user experience research is sort of the natural kind of evolution of, okay, I like want to work in tech. I love tech how do i do research in that.  [Doutcheva, Nadia] 09:09:56 And yeah, yeah, doing research there you know i considered like being like a research scientist Or, you know, if there's a couple other like research or research related roles like you know you could do like human factors and ergonomics um  [Doutcheva, Nadia] 09:10:15 Pre-search, like more on the physical space, which I did a little bit of that in my last position But I knew that like UX research is like pretty much where I wanted to be  [Doutcheva, Nadia] 09:10:29 So yeah, so I threw out grad school, I had a number of job experiences, you know, primarily internships And things like that.  [Doutcheva, Nadia] 09:10:45 Various industries in UX research. And then my first like full-time role out of school was as an in-house UX researcher And I really liked that and I felt like I developed like an expertise there. But after a while, I didn't feel like I was learning. I just was doing the same stuff over and over again.  [Doutcheva, Nadia] 09:11:09 And so that's what sort of led me to consulting because I wanted to try a bunch of different industries, a bunch of different  [Doutcheva, Nadia] 09:11:22 Clients, like ways of working. So that's sort of what led me to consulting.  [Doutcheva, Nadia] 09:11:28 And… Deloitte.  [Dulaney, Stephen] 09:11:32 Okay, in your current role at Deloitte, what is your primary  [Doutcheva, Nadia] 09:11:39 That's kind of a loaded question. So as a UX researcher at Deloitte you know I'm supposed to get staffed on UX research projects and then help clients with um doing our UX research.  [Doutcheva, Nadia] 09:11:56 That's what I like to do. I know there's a lot of other pieces or elements of what we're supposed to be doing here. I do really like  [Doutcheva, Nadia] 09:12:12 Teaching people or like meant not mentoring but like helping people develop their skills. I do think that I'm a little bit like unique Here, not a lot of other people with a lot of academic training. So it's fun and interesting for me to try to like  [Doutcheva, Nadia] 09:12:30 Help people develop their research skills. So that's sort of another thing I like to do but primarily Get staffed on UX research projects and then do UX research in whatever capacity the project needs or requires.  [Dulaney, Stephen] 09:12:47 Okay, well, you may not know it, but I consider you a mentor to me.  [Doutcheva, Nadia] 09:12:51 Okay. Oh, thank you. I'm happy to do it.  [Dulaney, Stephen] 09:12:53 So with this. You are. You've been great. I've been in the status, but I'm always saying. So with respect to your primary goal, what are some key frustrations you encounter?  [Doutcheva, Nadia] 09:13:03 Um. So… I'm going to keep it focused on like the actual research aspect. Although I think we both can agree that like getting staffed on projects and looking for projects is like a whole piece of this that is frustrating.  [Doutcheva, Nadia] 09:13:22 But specifically to research i think Um… Okay, it's like three things. So number one is I don't often feel like I can affect the scope of how the research projects is planned.  [Doutcheva, Nadia] 09:13:41 And I feel like the people that do do that work are not skilled enough or not knowledgeable enough even in research to understand how long Especially a research project can take and like what you can get out of it in a certain amount of time  [Doutcheva, Nadia] 09:13:59 And so that leads me to like My second frustration is my second frustration is the timelines are often extremely, extremely limited.  [Doutcheva, Nadia] 09:14:14 Three weeks at the most. And… it's just not feasible to like go from zero to a finished product in three weeks when you're doing research.  [Doutcheva, Nadia] 09:14:33 There's that. And I think that comes up again and again and again and again like this like this current like staff aug project that I'm on is like the longest I've ever worked on the same thing.  [Doutcheva, Nadia] 09:14:46 Whereas like before that, my longest project was eight weeks. And in that eight weeks, I did three things you know so it was like just the timelines can be really expedited. And I think that can lead to you know worse quality  [Doutcheva, Nadia] 09:15:03 Set up and prep worse quality recruiting and participants not getting to do as many sessions as I would like to do to be able to consider something comprehensive and then like the analysis is very like limited and how deep you can go  [Doutcheva, Nadia] 09:15:24 In certain ways.  [Dulaney, Stephen] 09:15:25 Okay, so the next phase I want to talk about what is your current kind of state of your research practice right now? What kind of tools do you have and how are they working for you?  [Doutcheva, Nadia] 09:15:37 Um… So I think… you know that this is very like client dependent here Right now on my current client, I think of it as like I was kind of reflecting on this recently. So my current research cycles are in three weeks.  [Doutcheva, Nadia] 09:15:56 Now, it's really four weeks because there's like a week zero where I have to start recruiting And I do get like more context like leading up to those three weeks.  [Doutcheva, Nadia] 09:16:10 And I have a lot of like support and scoping and context So it is fast, but it's possible because I'm like embedded somewhere as opposed to like going in fresh but anyway In the three week cycles, I kind of think of it as like  [Doutcheva, Nadia] 09:16:29 One week is the week word week or the docs week One week is the Excel week or the sheets week, and then one week is the the PowerPoint or slides week, right?  [Doutcheva, Nadia] 09:16:44 Week one is like prep. So I'm writing the research guide in a document, the research plan, you know, writing the proposal And then getting some more information, writing the discussion guide in a document Then week two.  [Doutcheva, Nadia] 09:17:03 Is data collection. So I I think I've shown you how I take notes in Excel or spreadsheet.  [Doutcheva, Nadia] 09:17:16 So that's like week two is my primary um tool.  [Doutcheva, Nadia] 09:17:24 And then week three is PowerPoint. So like analysis and reporting, which a lot of that will come from the PowerPoint too.  [Doutcheva, Nadia] 09:17:32 Sorry, from the excel but um happens a lot in the PowerPoint. So I don't know. I just think that's kind of funny but really um a couple of things. So number one there's a like beyond that. So there is a very robust recruiting and like infrastructure team  [Doutcheva, Nadia] 09:17:56 So I can just say like, I'm looking for this type of person and they just start finding that person, right? Like I make a screener and I send it to them.  [Doutcheva, Nadia] 09:18:05 But like they do all the recruiting, all the scheduling, all of the organization related to that. So that's like one thing that is a huge accelerator to use a Deloitte term.  [Doutcheva, Nadia] 09:18:26 And then…  [Doutcheva, Nadia] 09:18:31 For like pretty much like for prep and then data collection, it's just like me meeting with people, trying to understand what the goals are, like any kind of tutorial they can give me or about like the topic Trying to understand making sure that I understand the design intention  [Doutcheva, Nadia] 09:18:52 But really, it's just like meeting and talking to people. To prep.  [Doutcheva, Nadia] 09:18:59 And then through  [Doutcheva, Nadia] 09:19:04 The research week. It's just the session so Here, I do that a lot through Google Docs or sorry, what is it called teams no Meet, Google Meet.  [Dulaney, Stephen] 09:19:14 Sheets or something. Oh, yeah, yeah, yeah.  [Doutcheva, Nadia] 09:19:17 So instead of like Zoom. And then… For analysis.  [Doutcheva, Nadia] 09:19:26 They have this interesting tool called recall Which you can upload all your videos and it will generate transcripts. And then it's like you can clip videos out fairly easily. So that's like a a good one if I have a little bit of extra time to like  [Doutcheva, Nadia] 09:19:42 Throw some videos or some quotes in there. And then… I think you've looked at Notebook LM.  [Doutcheva, Nadia] 09:19:54 A little bit. So I use that a little bit to try to pull like relevant quotes for participants. It's a little bit faster than like trying to control f through transcripts.  [Doutcheva, Nadia] 09:20:11 And then like people around me will use Gemini a lot, which is like Google's AI tool. I'm not  [Dulaney, Stephen] 09:20:17 Okay, we're going to, because I think you're starting to get to the next phase. So this is Daria. It's the Deloitte Advanced Research and Interview Assistant.  [Doutcheva, Nadia] 09:20:22 Okay.  [Dulaney, Stephen] 09:20:27 And so what we're trying to do is blank slate in the next three years, what would you need if you had a digital kind of interview research and interview assistant.  [Dulaney, Stephen] 09:20:37 What do you see happening in the next three years in that realm?  [Doutcheva, Nadia] 09:20:57 So right now, I think one of the hardest parts of doing this is of doing this being one person.  [Doutcheva, Nadia] 09:21:09 And doing it all during this session. So in the session, you have to be asking questions listening, like trying to figure out program questions, trying to figure out how to like pull information out of people  [Doutcheva, Nadia] 09:21:30 Sorry. I'm facing. Another apartment and sometimes you see stuff  [Doutcheva, Nadia] 09:21:41 Paying attention and also like taking notes and trying to watch behavior, especially if you're looking at a prototype together so like sometimes people will like be doing something and then actively saying the opposite.  [Doutcheva, Nadia] 09:21:54 And so trying to capture both what they're saying and what they're doing in a way While also talking to them and listening to them is um a big challenge.  [Doutcheva, Nadia] 09:22:06 And right now, I don't think any of the like AI note-taking tools are good enough for me to trust them to take notes completely.  [Doutcheva, Nadia] 09:22:21 Without with me just like sitting back So… I think that would be something that would be really cool is if it could… like track behavior as they're like looking around on the prototype and what they're saying and first of all like  [Doutcheva, Nadia] 09:22:46 Be able to automatically be like measuring success or like failure or like confusion or errors that they do while we're clicking around on a prototype or even just talking about some designs.  [Doutcheva, Nadia] 09:23:04 And like any incongruence of what they say versus what they do.  [Doutcheva, Nadia] 09:23:14 At a more like basic level, if I could just trust it to take like um take very high quality notes.  [Doutcheva, Nadia] 09:23:25 While understanding like the subtleties of like human behavior basically  [Dulaney, Stephen] 09:23:39 Now, have you found that it does anything with the transcripts that way or what  [Doutcheva, Nadia] 09:23:43 I mean, the transcripts are just transcripts, right? Like they're just what was said which I don't think is usually enough to like  [Doutcheva, Nadia] 09:24:02 Fully capture the meaning or like the  [Doutcheva, Nadia] 09:24:10 Needs fully you know and so and like sometimes  [Dulaney, Stephen] 09:24:13 Then I'm going to have to work on because I do think the video and the observation, and I think it could Because I do have a word captures emotions from the transcript, but it's not looking.  [Dulaney, Stephen] 09:24:24 It probably can if we try to enable that. Because I'm going to go on a little bit. Can you tell me a story of a project that seemed it was going to be dead simple and then no matter how hard you tried.  [Dulaney, Stephen] 09:24:34 Every step of the way it was frustrating and just hard.  [Doutcheva, Nadia] 09:24:38 Uh-huh. Um…  [Doutcheva, Nadia] 09:24:48 I'm like, how dramatic do we want to get So…  [Doutcheva, Nadia] 09:25:02 Okay, let me talk about this one. A couple of years ago, I was on a project that we it was something like we were trying to improve like the supplier  [Doutcheva, Nadia] 09:25:23 Process. Supplier selection process.  [Doutcheva, Nadia] 09:25:31 So we did, it was supposed to be three phases. We did… it was supposed to be interviews, survey, and then a workshop, I guess.  [Doutcheva, Nadia] 09:25:46 I ended up only being able to do the interviews and the workshop or sorry, and the survey, not the workshop. I set everything up for the workshop but  [Doutcheva, Nadia] 09:26:04 It was… Again, I think timing is really an issue and especially when a client like doesn't fully understand that like, okay, if we want to have this timeline, like you have to be ready to provide all this stuff for me.  [Doutcheva, Nadia] 09:26:16 So like for the interviews, I was interviewing like internal people into the client  [Doutcheva, Nadia] 09:26:26 Like, yeah, people who work on like the supplier selection process but like The client had no idea how to like select people, how to find people. So that was a big journey and then I was like developing the questions and the questions  [Doutcheva, Nadia] 09:26:44 The scope that the client wanted was like was like was like was like way more than you could cover in a one hour interview um and I think people hate to hear that because it's like an hour is such a long time, but it's like, really, it's not. It's really not. If you want something good, it's not.  [Doutcheva, Nadia] 09:27:04 A long time. And then…  [Doutcheva, Nadia] 09:27:12 When it came to the survey.  [Doutcheva, Nadia] 09:27:21 It was just… like I had written questions with the intent of capturing like okay, what are the major pain points of  [Doutcheva, Nadia] 09:27:39 The process for like these external And that's Some of them were about like perception. Some of them were about actual ease. Some of them were about understanding And my client…  [Doutcheva, Nadia] 09:28:05 Thought that she knew better. And so then she actually like triplicated all of the questions that there was like one question about understanding ease of use and perception for each topic.  [Doutcheva, Nadia] 09:28:22 And it didn't make sense, frankly. And it was so repetitive and it literally tripled the length of the survey. And I was like, you really think that we're going to get people to answer this now that it's like 45 questions long like Okay.  [Doutcheva, Nadia] 09:28:39 And then… she really wanted like heavy quantitative analysis and she kept being like Regression, regression, regression, regression but like  [Doutcheva, Nadia] 09:28:55 It's just like  [Doutcheva, Nadia] 09:28:59 Like she was asking to put like a car tire on a bicycle You know what I mean? Like it just not what she was asking for like didn't make any sense.  [Doutcheva, Nadia] 09:29:12 And I kept being like, okay, like here is like the quantitative modeling that we can do like here's like.  [Doutcheva, Nadia] 09:29:19 What would make sense with the data that we have, you know.  [Doutcheva, Nadia] 09:29:24 She just wouldn't listen to me. And I was like, well, I don't know like I can't give you what you want because it's wrong. Like I can run a regression on this, but it's not going to tell you anything.  [Doutcheva, Nadia] 09:29:38 And none of the things are going to be like significant. And so like, we're all just wasting our time.  [Doutcheva, Nadia] 09:29:46 So that was really challenging and like If I had known that she wanted all this like complicated quantitative analysis, then we would have run the survey in a completely different way or I would have like trying to like we should have said in advance like this is the analysis that we want to do based on the questions that we have.  [Doutcheva, Nadia] 09:30:09 But, um. Yeah.  [Dulaney, Stephen] 09:30:14 That's a good story. I got what I needed out of that.  [Doutcheva, Nadia] 09:30:17 Yeah.  [Dulaney, Stephen] 09:30:18 So, and it sounds familiar too. That's how I met Ted. They wanted a survey.  [Dulaney, Stephen] 09:30:21 And I wasn't confident in myself. And so I got dead.  [Dulaney, Stephen] 09:30:25 And he did great. Okay, so the next phase I want to go into your process and you've already kind of described it once, but I want to go through it in a little more detail. When you know that you're going to have a study.  [Dulaney, Stephen] 09:30:36 How do you start? What is involved in your um Document week.  [Doutcheva, Nadia] 09:30:42 Okay. The longest part typically that is like most out of your control is the recruiting so Pretty much as soon as that's like the first place that you have to start like with the client or with the stakeholders is, okay, let's align on who we want  [Doutcheva, Nadia] 09:31:04 For this. And who's going to make the most sense, right? And people love to be like, okay, we want to talk to this type of user and this type of user and this type of user and these age groups. And it's like, okay, like.  [Doutcheva, Nadia] 09:31:16 Especially in limited time, we only have this much time. Like if we have a long time, great. Let's segment. Let's do all the groups.  [Doutcheva, Nadia] 09:31:25 You know um but if we have one week we have to kind of really narrow down, really be specific  [Doutcheva, Nadia] 09:31:34 And then basically like you have to start recruiting as soon as possible. So that's like what happens in week zero, which is what overlaps with like the week three of reporting of the previous study for me right now in my current process.  [Doutcheva, Nadia] 09:31:49 Given that I am like running a rapid research program, so it's intentionally quick.  [Doutcheva, Nadia] 09:31:58 So… Yeah, I think if you want it to be fast, especially you have to start recruiting quickly And so that really means like defining your participants. And at the same time, I'm also trying to like define as much scope as possible. So like, what are we trying to learn  [Doutcheva, Nadia] 09:32:20 Like what do we really want out of this? What are the goals that we have out of this research? So a lot of that can go hand in hand with the  [Dulaney, Stephen] 09:32:31 Now, do you start with research goals or research questions or both? And what's the difference?  [Doutcheva, Nadia] 09:32:31 Recruitment.  [Doutcheva, Nadia] 09:32:39 I think goals are a little bit easier for people to like understand.  [Doutcheva, Nadia] 09:32:47 Research questions are kind of can often be brought by those goals.  [Doutcheva, Nadia] 09:32:55 But I feel like non-researchers don't care as much about research questions.  [Doutcheva, Nadia] 09:33:05 So, um. Yeah.  [Doutcheva, Nadia] 09:33:10 And… Yeah, I think it's important to start with the goals because like people will be like, okay, I have this design, I want to make sure it's going to work right so like that's often the situation that will come to me is like, let's test this design. It's like, okay, what do we want to test?  [Doutcheva, Nadia] 09:33:30 What stage is this in? Are we testing perception? Are we testing usability? Are we testing like acceptance of new features like what actually um are we like, do we want needs pain points, you know what I mean?  [Dulaney, Stephen] 09:33:45 And so you're asking all those questions and what do they determine? You're asking this question for a reason.  [Dulaney, Stephen] 09:33:51 So when you get all those answers, what is that going to dictate?  [Doutcheva, Nadia] 09:33:55 So it dictates the legit, the type of study and like a lot of the logistics of the study so okay are we doing a usability test? Are we doing a design validation interview?  [Doutcheva, Nadia] 09:34:10 Do we want to do like more of a generative like needs conversation um like I'm like requirement gathering. Are we testing like perception, are we testing like multiple designs to see which one is better And why?  [Doutcheva, Nadia] 09:34:31 Right. It's kind of giving me like the outline of how and what kind of study I'm going to do.  [Doutcheva, Nadia] 09:34:43 And how to like run the session so like And yeah. And so also like at the same time, it's important to be getting the design right and understanding like how how is it supposed to work? How are we intending this? What is the purpose of each of these things?  [Doutcheva, Nadia] 09:35:03 So that… I can like ask questions to people without like directly asking the question, you know what I mean?  [Doutcheva, Nadia] 09:35:17 Did that answer your question?  [Dulaney, Stephen] 09:35:17 Yes, that does. So now you have a plan. When you start out, do you kind of have like a known plan that you have reused in your mind?  [Dulaney, Stephen] 09:35:26 And then you just kind of use your clarifying questions to pick elements.  [Dulaney, Stephen] 09:35:30 Of what activities you're going to have. And what activities you're not going to have.  [Doutcheva, Nadia] 09:35:36 Not really. I have like a little template just for like the structure. So I remember like, okay, we.  [Doutcheva, Nadia] 09:35:43 I mean, at this point, it's like the most important thing is like participants and like goal and then what kind of design do we have or are we doing like what stage is it in But then I just sort of like fill out  [Doutcheva, Nadia] 09:36:02 The structure that I have made. Um but  [Dulaney, Stephen] 09:36:07 Okay, and so during the actual data collection week, what are your activities? What are the easy parts? What are the hard parts? And where does all the time go?  [Doutcheva, Nadia] 09:36:17 So during data collection week. So again, really helpful to have like a recruiter or like some like a partner that you're working with to help schedule and stuff so Thankfully, we have that. So that can be a lot of it, right? It's like the logistics of scheduling  [Doutcheva, Nadia] 09:36:36 Sessions. And then like getting people to sign the appropriate paperwork ahead of time and then like afterwards getting them incentives so thankfully i don't have to do that. I have had to do that in the past but It is what it is.  [Doutcheva, Nadia] 09:36:55 But really it's really making sure that One, like I know the context of the participant I'm about to interview going in.  [Doutcheva, Nadia] 09:37:06 So like, you know, based on their answers to the screener, you know, some of the like introduction questions especially might be a little bit different.  [Doutcheva, Nadia] 09:37:20 Excuse me. So yeah, making sure I know like the context of the participant. And then really it's like.  [Doutcheva, Nadia] 09:37:29 Doing the actual interviews can be very like time.  [Doutcheva, Nadia] 09:37:35 Intensive and like like brain power intensive, right? Because as I mentioned, you have to be listening, you have to be preparing the next question probing on what they're talking about, taking notes, also observing their behavior and their intonation their like  [Doutcheva, Nadia] 09:37:51 Subtleties So that's challenging and then challenging and then I've talked about the importance of a post-session summary before so I usually reserve like half the time the interview after so if I'm doing a one hour log session i will  [Doutcheva, Nadia] 09:38:16 Reserve a half hour right after to make sure I'm like writing my um interview summary or sorry, post interview Yeah, post-interview summary.  [Doutcheva, Nadia] 09:38:28 Post-session summary. And especially in the beginning of the sessions or depending on the type of sessions, like how much structure that has can really affect how easier, difficult or quick or slow that process happens.  [Doutcheva, Nadia] 09:38:51 Yeah. And then, you know, there's like the logistics of making sure all of the transcripts and the video recordings and the notes are like organized and go into the right folders and you're like keeping everything on track.  [Doutcheva, Nadia] 09:39:11 Like uploading it to like uploading it whatever tools you need to be using, saving it to the correct folders, and especially if there's like any PII involved, like making sure that the data is properly handled properly The recordings are properly handled. Out of every transcript, basically I have to like  [Doutcheva, Nadia] 09:39:33 Take out the name and any like identifying information of the participant  [Doutcheva, Nadia] 09:39:44 Yeah. So that's like during research week.  [Dulaney, Stephen] 09:39:49 He had an assistant for that week, what would the digital assistant be working on?  [Doutcheva, Nadia] 09:39:50 Most of them.  [Dulaney, Stephen] 09:39:52 To help you save time.  [Doutcheva, Nadia] 09:39:56 The digital assistant.  [Dulaney, Stephen] 09:40:02 Even if you had a person assistant, what would they be doing?  [Doutcheva, Nadia] 09:40:05 Well, a personal assistant is always really helpful to be doing a lot of the note taking so that I can focus on like being in the moment with the participant and like asking the next question.  [Doutcheva, Nadia] 09:40:19 And like only noting down like certain things that I find are like extra kind of insightful And so anytime i've had  [Doutcheva, Nadia] 09:40:32 Like a assistant it's helpful to do that. And then also like doing the session summary with them to make sure like, okay, we had two eyes, like they said this, how did you interpret this? I interpret it this way okay we match great oh we don't match okay we're going to have to go back and like look at the recording and look at it again.  [Doutcheva, Nadia] 09:40:56 So yeah, like taking notes in the moment is really important and then I cannot stress enough.  [Doutcheva, Nadia] 09:41:03 Especially when we're trying to be time efficient, the importance of a post-session summary  [Doutcheva, Nadia] 09:41:12 And one that is comprehensive, you know. Like one problem right now I have with a lot of like digital or like AI summaries of meetings or sessions or whatever is that like they will do a okay job like summarizing the conversation, but it doesn't feel comprehensive, right? And so that's what I like to do in the post session summary is I'm like, okay, what are all the topics that we talked about? What did the participants say about each of them?  [Doutcheva, Nadia] 09:41:42 And even if it's not like that notable, right? If they understood something and they liked it like okay that's not, it's like, okay, great. Like that thing worked. Whereas I feel like summaries like that tend to focus on like the conflicts or the problems. And it's like, that's fine. And that's very important to know. But also I'm going to want to  [Doutcheva, Nadia] 09:42:06 Be confident that okay Sure, three people said that there's these problems But if I don't have any information on the other nine people.  [Doutcheva, Nadia] 09:42:19 Whether they thought it was fine or good or not, did we just not talk about it? Did it just like not get covered?  [Doutcheva, Nadia] 09:42:28 Did or did they like it and it was fine or were they did they like were they having the same problems and they were finding the pattern that like they were running into the same pattern that already exists. So I just didn't feel like it was  [Doutcheva, Nadia] 09:42:41 In the moment, I just wrote down like a really easy note or whatever So, um.  [Doutcheva, Nadia] 09:42:49 Being really like comprehensive and thorough you know so like every kind of note has the same elements so that I feel confident like okay looking at my data you know looking at my data we have our like six topics  [Doutcheva, Nadia] 09:43:09 Out of our 12 participants here's what they said about all of those six topics.  [Dulaney, Stephen] 09:43:17 Okay, so now let's go to the third week, the PowerPoint week. What do you do in the president announces in PowerPoint week?  [Doutcheva, Nadia] 09:43:26 Yeah, so because I only have you know, a week do the analysis and the reporting. I tend to very heavily rely on my post-session summaries to help me do the analysis. And that's why I'm very like keen on doing them immediately after and why i  [Doutcheva, Nadia] 09:43:50 I'm very like say that it's very important to be very comprehensive, right? So I can say like, okay, these are all like, these are all the main topics.  [Doutcheva, Nadia] 09:43:59 Let's go through what the participants said about each of them.  [Doutcheva, Nadia] 09:44:04 So then basically what I do is I go through like the discussion guide or whatever like And I list out all of the topics that were discussed And then I sort of go And whether I do it in a list or whatever, like I sort of go  [Doutcheva, Nadia] 09:44:28 Sometimes I will just like put the topic as like the slide title you know and then I'll just kind of go one topic at a time.  [Doutcheva, Nadia] 09:44:38 To be like, okay, we talked about like the file browser, what was everybody's what did everybody say about the file browser? Okay, like looking at my session summaries, I know that like three people said this, six people said this, three people said this. Okay, great.  [Doutcheva, Nadia] 09:44:57 And then I like kind of summarize that and then i develop like develop a  [Doutcheva, Nadia] 09:45:07 Design recommendation if relevant based on that.  [Doutcheva, Nadia] 09:45:15 And then I just go on to the next topic, right? Because like.  [Doutcheva, Nadia] 09:45:20 These things are quick. And like specifically my role right now, I am doing like a lot of design validation and rapid like rapid research. And so like It doesn't have to be super in-depth, right?  [Doutcheva, Nadia] 09:45:35 It does. But right now that's sort of where I'm at, where I'm like, okay, these are all the topics. And sometimes like stuff will come out in the interviews that You weren't expecting to come out or that what isn't necessarily like one of the  [Doutcheva, Nadia] 09:45:55 Topics that you were thinking of. And so I will write that kind of stuff down in the in my notes and in the session summary And then I try to like include it You know, I was like, okay, like.  [Doutcheva, Nadia] 09:46:11 We didn't mean to talk about dragging and dropping organization, but that kept coming up. So I'm going to bring it up.  [Dulaney, Stephen] 09:46:19 So you add a topic based on something like that. Okay, so I'm going to move to another section that was very helpful and I'll probably come back to that.  [Doutcheva, Nadia] 09:46:22 Mm-hmm.  [Dulaney, Stephen] 09:46:27 I want to ask three questions. Who do you work with? Who are your collaborators? Who do you work for and who benefits from your work?  [Dulaney, Stephen] 09:46:35 So the benefits from your work would be like your customer, who do you work for would be like your boss and who do you collaborate with would be like your coworkers.  [Doutcheva, Nadia] 09:46:44 Yeah, so with, I work with  [Doutcheva, Nadia] 09:46:50 There's like one other researcher right now who is like  [Doutcheva, Nadia] 09:46:59 Adjacent to me slash like she's like… my main like correspondent basically like I know what the next topic is going to be like from her And then I will go and and that's who I'm working four right are like my stakeholders which is  [Doutcheva, Nadia] 09:47:21 Product managers and the UX designers. And the engineers sometimes I do think the UX designer is also like a whiff Because I have to rely on them for the designs and for like any stimulus that I need to And I will often like be like, okay, this part of the prototype, you need to connect it better like this part of the prototype, I have a question here like  [Doutcheva, Nadia] 09:47:51 Oh, we need like a little example here. Can you add in something into the prototype here? So I think that designers also the width.  [Doutcheva, Nadia] 09:47:58 And they also like are the ones that benefit the most from… my research, right, is because they get like design recommendations and design direction And that also goes like for the pms  [Doutcheva, Nadia] 09:48:19 And sometimes engineering, depending on how feasible my recommendation is. Sometimes they're like, you're making my job harder and I'm like.  [Doutcheva, Nadia] 09:48:26 I'm trying to make the engineers or the engineers the user's job easier.  [Dulaney, Stephen] 09:48:33 Okay, so of those three, who benefits most, which is kind of the UX and your users, and who you work for, which is also UX, I think that's interesting, employees, and who you work with, which one would you rate first? Most important? Which one would you rate next important and which one would you rate next important after that?  [Doutcheva, Nadia] 09:48:57 I mean, it depends on how like importance of what, right? If it's like importance of keeping my job, then who I work for is the most important Like making sure that like the PMs and the designers are like happy with my work and finding  [Doutcheva, Nadia] 09:49:15 That it's the most valuable. And I think like because right now I'm in a B2B situation, that's probably still true because um you know, like the user is just like like the user of this tool, it's not necessarily like, you know, like sometimes like in healthcare or in driving, it's like, no, like.  [Doutcheva, Nadia] 09:49:37 The user is the most important and we should all be working towards that. You know, if it's like a safe, any kind of like safety or like healthcare situation Right. But like all contexts are a little bit different. So right now um  [Doutcheva, Nadia] 09:49:57 Yeah. I'm not in a safety critical  [Dulaney, Stephen] 09:49:58 Thank you. So the next question after that is What do you consider the victory event?  [Doutcheva, Nadia] 09:50:11 For me? I think the presentation.  [Doutcheva, Nadia] 09:50:17 So after I present. Get like getting to or like even during the presentation, if people are like engaged and like asking me questions and like having a discussion, I consider that to be like a victory because it shows that people are like interested in what I'm saying and are finding it valuable.  [Doutcheva, Nadia] 09:50:36 And any kind of like questions that I get to answer, it's like, okay, like.  [Doutcheva, Nadia] 09:50:40 Like this is causing you to think And I'm like supporting that.  [Dulaney, Stephen] 09:50:48 Okay, that's a good one. So now this is the next part. This is my kind of user experience framework. I consider it people really kind of will say that we did a good job.  [Dulaney, Stephen] 09:50:57 If they understand the value, if they understand the problems we solve, if they gain education.  [Dulaney, Stephen] 09:51:03 If the tools are really good and the look and the feel.  [Dulaney, Stephen] 09:51:07 So I want you to kind of think about your work as an educator and an evangelizer as a UX researcher. How do you teach or communicate the value of your work?  [Doutcheva, Nadia] 09:51:23 I will be 100% honest. I hate doing this. And I think this is my least favorite part because To me, it's so obvious that it's like frustrating to me when it's not when i when i have like it feels like I'm teaching the alphabet to people  [Doutcheva, Nadia] 09:51:43 You know what I mean? I'm like, what do you like we're making this product better.  [Doutcheva, Nadia] 09:51:50 You know, and  [Dulaney, Stephen] 09:51:50 So what problem are you solving on a repeated basis?  [Doutcheva, Nadia] 09:51:58 I am improving the efficiency, understandability.  [Doutcheva, Nadia] 09:52:09 Like…  [Doutcheva, Nadia] 09:52:14 Problems, lack of functionality that exists. In you know a tool or whatever the product is, right? Whether it's software or not working to make that product better, whether it's like developing new features, reducing pain points like creating like making it  [Doutcheva, Nadia] 09:52:41 More intuitive, which is a terminology that i don't love But… Yeah. So I'm like working to improve the product in like a number of ways  [Dulaney, Stephen] 09:52:55 Okay, so how about the, how do you communicate the value of the tools that you use in your work?  [Doutcheva, Nadia] 09:53:04 Um… the tools i mean  [Dulaney, Stephen] 09:53:10 And I extended to like tools and techniques.  [Doutcheva, Nadia] 09:53:14 Yeah, so…  [Doutcheva, Nadia] 09:53:19 It depends on the tools, right? Like something like MUIQ, I think is like a really interesting thing that is like, okay, like it's a great example of like an accelerator Right. Or like any any tool that allows you to do like unmoderated research is interesting because it's like, okay, well, we can get a lot of  [Doutcheva, Nadia] 09:53:39 Answers in a short amount of time so like a short amount of time You want to talk to 50 people? Okay, I can't talk to 50 people in a week, but we can do 50 unmoderated interviews and then like  [Doutcheva, Nadia] 09:53:52 There's some like automation that those tools have that they can say like, okay.  [Doutcheva, Nadia] 09:53:57 This is the success rate. This is the failure if We want… I don't know. I think it's tricky because it's tricky I think people tend to think people tend to overvalue tools And like the critical things that we need tools for is  [Doutcheva, Nadia] 09:54:23 Like like the biggest blockers i feel like is recruiting.  [Doutcheva, Nadia] 09:54:32 And… like time basically So if…  [Dulaney, Stephen] 09:54:37 So let me switch the last one because what is the value of the look and the feel of your artifacts?  [Dulaney, Stephen] 09:54:46 How important is it?  [Doutcheva, Nadia] 09:54:49 Of like the designs that I'm testing or like my reports  [Dulaney, Stephen] 09:54:52 Reports.  [Doutcheva, Nadia] 09:54:57 Um I think it's very like context dependent or client dependent and like sorry to give like another like it depends answer but um Sometimes people will really like over index on like, oh, like if the presentation looks good, it means it must be good. I think that's like a very Deloitte  [Doutcheva, Nadia] 09:55:21 Thinking and I don't think that's always true and true So… like what I consider to be a good presentation is not necessarily one that like looks good. I mean, obviously it has to be consistent. I think it needs to have like clear like you can apply like UX principles to like  [Doutcheva, Nadia] 09:55:42 Reports, right? Like the points have to be clear. The action item based or the so what of every slide has to be clear  [Doutcheva, Nadia] 09:55:56 And so on. And so I think like And I think the reports need to be able to stand on their own without the voiceover. I think that's something that gets left behind a lot.  [Dulaney, Stephen] 09:56:10 Now, what role does like outside educational material play? Do you have to have like go-to sources or do you use anything where you're trying to um educate and evangelize. I know you don't have to, but I know that been in this work long enough that if you want to do the work, you have to evangelize.  [Doutcheva, Nadia] 09:56:26 Oh, yeah. I think it's more of like communication tools, right? So like if you can illustrate like what the difference different um what the different possible like types of studies are or the different deliverables, right? Like, are we just doing like a findings report or are we doing a user journey are we like  [Doutcheva, Nadia] 09:56:55 Creating are we like gathering requirements or are we like what you know so what are the different like outcomes or like deliverables to use like the Deloitte terminology  [Doutcheva, Nadia] 09:57:10 And so like having like visual references or guides to show like, okay, if we have this problem this is this is how we figure that out. This is the research that we do to solve that problem.  [Doutcheva, Nadia] 09:57:26 So I think that type of stuff can be very valuable in trying to communicate with people who don't necessarily understand the value of research.  [Doutcheva, Nadia] 09:57:35 For the full.  [Dulaney, Stephen] 09:57:35 If you have a magic wand, what one thing would you change about your research environment?  [Doutcheva, Nadia] 09:57:44 Oh, what a fun question.  [Doutcheva, Nadia] 09:57:53 I would… make all participants  [Doutcheva, Nadia] 09:58:02 More like forthcoming and like easier to kind of converse with and like be like make it easier to find participants who are like exactly the type of person or like person or like the user that we're looking for.  [Dulaney, Stephen] 09:58:19 Okay, so during a project, is there anything that keeps you up at night?  [Doutcheva, Nadia] 09:58:30 Only my client's expectations and if they're unreasonable.  [Dulaney, Stephen] 09:58:36 Okay, so I'm going to ask a UX researcher that's both your customer and your coworker and your And your boss to describe Nadia to me in one word, what one word would you want them to tell me?  [Doutcheva, Nadia] 09:58:51 Curious.  [Dulaney, Stephen] 09:58:51 Okay, very good. Are there any questions that you expected me to ask that I have forgotten to include in my questioning so far.  [Doutcheva, Nadia] 09:59:05 Maybe like, how do I expect to interact with tools throughout the process like any and because I feel like you're developing a new tool so how do i interact with how how do I expect to interact with the future?  [Dulaney, Stephen] 09:59:19 Okay, well, the sad part is we were such a good interview subject that we used all of the time.  [Doutcheva, Nadia] 09:59:25 I think I lost you. Yes, I do have to run.  [Dulaney, Stephen] 09:59:26 Oh, I'm still here. You here? You do have to run so I will, do I have one minute?  [Doutcheva, Nadia] 09:59:37 No, I'm only presenting.  [Dulaney, Stephen] 09:59:37 Okay. Then I won't do it. That sounds good. So another time I want to share the tools because I want to want your help on like what the hell I'm trying to do and what I've accomplished so far. So I've done a lot of stuff and I realized it was for me.  [Dulaney, Stephen] 09:59:50 And then when I talk to researchers, I'm trying to rethink it and go from fresh and make it more for you.  [Doutcheva, Nadia] 09:59:52 Yeah.  [Dulaney, Stephen] 09:59:56 Thank you so much, Nadia, for your participation. What kind of interview was that? I used the same script for the whole 20 years.  [Dulaney, Stephen] 10:00:03 What am I doing?  [Doutcheva, Nadia] 10:00:06 I think… a little bit of like a little bit of like It seemed more generative, a little bit of like requirements gathering. Yeah, I really, we can talk more, but I really have to run because I'm presenting.  [Dulaney, Stephen] 10:00:17 Bye-bye. Thanks again.  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Nadia Doutcheva",
      "age": "25-34",
      "gender": "female",
      "location": "Los Angeles CA",
      "occupation": "Researcher",
      "industry": "Consulting",
      "experience": "10",
      "education": "doctorate"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  }
}