{
  "id": "e94c2430-12d0-4b09-b260-ae78e96930a1",
  "transcript_name": "Thomas's AI old method of upload",
  "project_name": "Thomas's AI Study",
  "interview_type": "Persona Interview",
  "project_description": "Study AI ",
  "date": "2025-04-27T10:31:25.649688",
  "transcript": "[Dimino, Thomas] 14:00:32\nHey, Steven.\n\n[Dulaney, Stephen] 14:00:33\nHello, I've turned off my washer. Its noise speaks the loudest time right when I need a call.\n\n[Dimino, Thomas] 14:00:39\nYeah, how are you doing? It feels like it's been uh Yeah, it's been a while.\n\n[Dulaney, Stephen] 14:00:42\nHow are they? Yeah.\n\n[Dimino, Thomas] 14:00:47\nYeah, things are reasonably well. There's kind of a different mood that's come over, I think JB Morgan as of today because They've now announced that they're going to force everyone back to the office like they're eliminating hybrid work and remote work entirely. So this is unfortunate because\n\n[Dimino, Thomas] 14:01:12\nI was actively considering a salary position within this team but within this team it's just not feasible. I would negotiate even around two days in the office but five days Yeah, it's just for me, it's like that would be\n\n[Dulaney, Stephen] 14:01:25\nI go full time back in the office.\n\n[Dimino, Thomas] 14:01:31\nA professional regression. I've learned like how much more effectively i work with flexibility you know versus what I used to do when I was you know working at like marketing agencies where you had to sit under the bright lights and, you know, pound away at the keyboard\n\n[Dimino, Thomas] 14:01:48\nLike my productivity would never equal just being able to be an adult and work responsibly. So it's very kind of very insulting, but it has nothing to do with this team.\n\n[Dulaney, Stephen] 14:02:00\nNot yet.\n\n[Dimino, Thomas] 14:02:00\nIt's just upper management. So, you know, emotionally just kind of processing that but um\n\n[Dulaney, Stephen] 14:02:06\nIt's probably going to ebb and flow. I can't imagine I mean, I can envision that they might back off part of that but\n\n[Dimino, Thomas] 14:02:13\nYeah, it may… It may bite me in the ass because AT&T has already implemented this. And what they're finding is that they simply don't have the infrastructure. They don't have enough desks for all their employees. So you're forcing people to play musical chairs\n\n[Dimino, Thomas] 14:02:32\nAnd I mean, I saw this implemented at Google. Too um it just doesn't make anyone's life easier You know, it's only ever done like for the sake of the stock like because you know shareholders think these things are like wise business, you know, decisions, especially in the age of Trump now but\n\n[Dulaney, Stephen] 14:02:51\nYeah, I think it is a trendy thing. It's Elon and trump and it's like… It'll pass. Hopefully the feet break. I thought it was broken already, but…\n\n[Dimino, Thomas] 14:02:58\nYeah. What's amusing me the most is… a couple of years ago during the pandemic, I worked briefly for Chan Zuckberg Initiative that was kind of my first taste of programming, actually, because I was hired to be a content strategist\n\n[Dimino, Thomas] 14:03:16\nWho would basically learn everything there was to know about this open source platform called Napari, which was for image analysis I would learn everything I could about that because Chan Zuckerberg you know this kind of philanthropic side of meta\n\n[Dimino, Thomas] 14:03:33\nWas trying to invest in different open source projects that were going to be accessible, free.\n\n[Dimino, Thomas] 14:03:40\nAnd just bring about all this good scientific change. And I don't know if you've heard or watched any interviews with Mark Zuckerberg of late, but he has kind of embraced this uh kind of like online like tech bro persona. And it's such a market shift from how he presented himself with his wife\n\n[Dimino, Thomas] 14:04:02\nLike when I worked as a contractor at his company. And it just kind of makes everything feel so much more insincere but You know, it is what it is. I don't really sweat these things because It's just theatrics, but…\n\n[Dulaney, Stephen] 14:04:16\nYeah. Yeah. So how soon are they wanting everyone to go back to the office?\n\n[Dimino, Thomas] 14:04:16\nYeah. C'est la vie.\n\n[Dimino, Thomas] 14:04:23\nI think the memo said March 25th. Yeah, I mean, I think that still excludes me Because… from what i what like Tim shared with me from all the managers have a dashboard where they see the um like how often are people coming to the office so everything is tracked. And if the team fell below\n\n[Dulaney, Stephen] 14:04:25\nOkay, so let's still a couple.\n\n[Dulaney, Stephen] 14:04:31\nYeah.\n\n[Dimino, Thomas] 14:05:04\n60% like in-office attendance than the manager would start to get like.\n\n[Dimino, Thomas] 14:05:04\nThe sweat rolling down his back and his upper management would be like, what's going on? You know, you got to remedy this So I imagine now it's now no one can go below 100% where it used to be 60%.\n\n[Dimino, Thomas] 14:05:21\nAnd that's unfortunate because it's only going to make life of the managers more stressful.\n\n[Dimino, Thomas] 14:05:21\nSo really no one wins in this type of system\n\n[Dimino, Thomas] 14:05:27\nAnd I don't know if you… Didn't hear me at some point my connection Dev.\n\n[Dulaney, Stephen] 14:05:32\nYeah. I got some latency going on, but that's okay. I got most of it.\n\n[Dimino, Thomas] 14:05:36\nOkay, no worries.\n\n[Dulaney, Stephen] 14:05:39\nAnd it's kind of interesting. So I just wanted to make sure I've been kind of working on the research findings and doing that kind of stuff together, but I just want to make sure now that, you know.\n\n[Dulaney, Stephen] 14:05:49\nYou're taking over for… Tim, essentially.\n\n[Dimino, Thomas] 14:05:53\nIt's him as well as another gentleman you may have met are heard on calls is patrons I forget what his exact title was. He was also with Deloitte, but he was overseeing kind of the product design of the wealth plan agent\n\n[Dulaney, Stephen] 14:06:00\nOkay.\n\n[Dimino, Thomas] 14:06:10\nAnd now there's kind of that void there. So I basically volunteered to give some some guidance on how to make the wealth plan agent like useful in production because because right now it's not part of the pilot But of course, they want to push it, I would think, in their next phase of that.\n\n[Dimino, Thomas] 14:06:32\nSo like my contract now will go until end of May, like May 31st. So, you know, my objective is at the very least like see this wealth plan agent you know through to production And then perhaps work with them like\n\n[Dimino, Thomas] 14:06:49\nWhoever's kind of the head of meeting assist which is still be honest with you, kind of unclear to me as if And I would ask the same question of you even just to get your perspective, but I kind of treat\n\n[Dimino, Thomas] 14:07:02\nSarah and Rigved. And Alex kind of as like this little triumvirate They're not a true triumvirate because Sarah is woman. But I feel like they are the decision makers when it comes to the ultimate direction for the product. And they are the ones who usually step in\n\n[Dimino, Thomas] 14:07:21\nUsually more Sarah, I think, than the rest. But Sarah and Rigved have stepped in Yeah, in my experience, Sarah and Ringved both step in to make suggestions around like content proposals or research proposals or even just like engineering proposals. So they in that sense have the final ownership\n\n[Dulaney, Stephen] 14:07:25\nAnd that's their lead, right? Okay.\n\n[Dimino, Thomas] 14:07:43\nSo having kind of having you know gone through all that context again Yeah, I just want to help them with with the Wolf Plan. And I think that's going to involve both um like the prompt tuning of what already exists because they already have something like that's in their um\n\n[Dimino, Thomas] 14:08:02\nVirtual environment in their testing environment So they have it running already. They can already get outputs.\n\n[Dimino, Thomas] 14:08:09\nFrom this agent. It's just kind of a question of this agent essentially is essentially it's given a JSON file.\n\n[Dimino, Thomas] 14:08:19\nThat has upwards of upwards like 600 keys and values in it Which I think mostly are about like the different wealth plan goals different like stats around them. And I have examples of this in a Figma that I shared. I think it was called Drafting the Wealth Plan Agent.\n\n[Dimino, Thomas] 14:08:39\nThat's not updated as of like the latest changes to this code base, but it more or less represents kind of what we're working with so Yeah, there'll be an aspect of just figuring out how do we best use that JSON\n\n[Dimino, Thomas] 14:08:54\nWith the 600 keys and values. You know to to like the the fullest where we're getting like\n\n[Dulaney, Stephen] 14:09:00\nNow, JSON file created for a client. So a customer, they run the thing and it creates the JSON that has all the data about the customer. And then you ask, you query, the agent queries the JSON about recommends.\n\n[Dimino, Thomas] 14:09:11\nOr I guess the way it happens in terms of the engineering flow is like the JSON is generated were exported.\n\n[Dimino, Thomas] 14:09:23\nOr they kind of call it with an API. They call it from, I guess, their wealth plan system. The wealth plan system exports this JSON file that's just that wealth plan, which would usually be like a pdf you know with a bunch of\n\n[Dulaney, Stephen] 14:09:35\nAnd it's a wet plant for that specific customer.\n\n[Dimino, Thomas] 14:09:38\nYeah, for that client. So the system, JPMorgan system already has all that data usually displayed as a pdf So we're instead just asking for the JSON.\n\n[Dulaney, Stephen] 14:09:48\nYeah.\n\n[Dimino, Thomas] 14:09:50\nAnd that JSON is then being converted into a string. That's being given to GPT 4.0 and we're telling it here in this JSON.\n\n[Dimino, Thomas] 14:10:03\nThis is how it's laid out and these are some keys that would be of particular interest to you inside of this field of text.\n\n[Dimino, Thomas] 14:10:12\nAnd then from there, just standard standard prompt you know not they they use the existing summary and insight prompts.\n\n[Dimino, Thomas] 14:10:22\nFrom the CRM agents, the advisor agent, they use that as their base and they kind of modify it from there.\n\n[Dimino, Thomas] 14:10:29\nAnd I think they're at the stage where They want us because they're based in India. So naturally they want us to look at it, make sure like grammatically like logically, you know, it's making sense like nothing is kind of contradicting anything else. And then they want us to help them figure out\n\n[Dimino, Thomas] 14:10:48\nNow that we have this running, how do we actually evaluate it?\n\n[Dimino, Thomas] 14:10:51\nBecause it's not the same evaluation that we were doing before.\n\n[Dimino, Thomas] 14:10:55\nWhere was the question of like is this summary you know like one of these four things and then like how you rate that I feel this will have to be rethought. So there's an evaluation part to it too like how do we how can we actually evaluate this where\n\n[Dulaney, Stephen] 14:10:58\nUseful, yeah.\n\n[Dulaney, Stephen] 14:11:09\nBye.\n\n[Dimino, Thomas] 14:11:11\nWe can tell if it's doing better or worse. As we're changing the prompt behind it and everything.\n\n[Dimino, Thomas] 14:11:18\nAnd yeah, beyond that. It's just a question of, because I think your background, you've done plenty of like engineering right like the front end and back end.\n\n[Dimino, Thomas] 14:11:28\nSo the other side of it is they wrote this in Python. They used a lang graph.\n\n[Dimino, Thomas] 14:11:34\nWhich is, I mean, I've only ever used link chain, so I'm guessing lane graph happened.\n\n[Dulaney, Stephen] 14:11:34\nYeah.\n\n[Dimino, Thomas] 14:11:39\nSometime in the last year.\n\n[Dulaney, Stephen] 14:11:41\nYeah, I've done only like training things on these. So I haven't actually used them in a minute, but I've done a lot of training just where I'm familiar with them and And try to keep up because it is changing fast. You know, one thing I heard, which is surprising to me, I don't know if you already heard this, but so when they were doing chat GPT three.\n\n[Dulaney, Stephen] 14:11:57\nAnd this was on Twitter. Stop me if you already heard this that they found out that they found out it intuited the game of chess just of chess by the language. No one actually gave it the rule.\n\n[Dimino, Thomas] 14:12:08\nOh.\n\n[Dulaney, Stephen] 14:12:08\nOr the board. Which is weird. So if we can do that, what other problems can it into it? So, I mean, I feel like there's certain things that we're missing, like, can it actually intuit?\n\n[Dulaney, Stephen] 14:12:17\nWhat a financial advisor would do with Wealth Plan. And what strategies they want, you know, without us having to like articulate clearly\n\n[Dimino, Thomas] 14:12:24\nRight, without having to be pedantic about it and give it like stricter guidelines. Yeah, I… I think like philosophically speaking, I definitely am of that mind that that If you approach this a little more creatively.\n\n[Dimino, Thomas] 14:12:39\nYou could achieve that. And that's just based on my past experience creating more like role-playing personas like with um different versions of GPT-4 and then the llama model Like they, I think the cleaner and the more minimalistic the prompt\n\n[Dimino, Thomas] 14:12:59\nLike sometimes the more amazing the results, you know, because you kind of get flabbergasted like this is like eerily human And then, of course, it has It's like the prompt itself is both narrowing the focus of all of that\n\n[Dulaney, Stephen] 14:13:03\nYeah.\n\n[Dimino, Thomas] 14:13:14\nLike as latent space it has, right? All those neurons it's like narrowing it And that can be effective, but it's like, when does that come at a cost and And that cost could be that a wealth advisor is not just a wealth advisor they're a human being\n\n[Dimino, Thomas] 14:13:27\nAnd it definitely seems to be very socially driven profession aside from being able to weigh in where the market is telling you to do something so Yeah, I would think there's a certain Like this idea of insight that we're after, like we want insights that are different from summaries, I think\n\n[Dulaney, Stephen] 14:13:28\nRight.\n\n[Dulaney, Stephen] 14:13:42\nYeah.\n\n[Dimino, Thomas] 14:13:45\nTo really do that in a way that would be equal to a seasoned advisor, you would have to kind of more creatively approach the task of even building the persona or the initial prompt like for these agents because right now they're a bit robotic\n\n[Dimino, Thomas] 14:14:02\nAnd I think part of the problem is that there needed to be very strict hallucination checks in place you know and doing that like required just having very explicit language so I just accepted all those limitations.\n\n[Dulaney, Stephen] 14:14:09\nRight.\n\n[Dimino, Thomas] 14:14:17\nHow this project has been built is not how I would build.\n\n[Dimino, Thomas] 14:14:21\nAn AI product, whether it was for enterprise or for personal use just because I have different philosophy, especially since this is about words like to me it's almost like writing a draft for a short story You know, I want to give better\n\n[Dulaney, Stephen] 14:14:30\nRight.\n\n[Dimino, Thomas] 14:14:37\nCreative brief, you know, than what we're currently giving it like Really, case in point, even for meeting assist is For all of the prompts, like the first two, three sentences is basically you are this, you know, it's like.\n\n[Dimino, Thomas] 14:14:51\nKind of like willing it into existence and I had to kind of push them even to tell them like, well, it may help to say that you work at JP Morgan because that itself comes with certain associations. There's like a certain prestige\n\n[Dimino, Thomas] 14:15:08\nWhereas if I'm saying you're just a world advisor. You could be doing it as a hobby. I don't know. You know, technically speak.\n\n[Dulaney, Stephen] 14:15:14\nYeah, yeah. It does.\n\n[Dulaney, Stephen] 14:15:17\nOne thing, do you know, like it seems obvious to me like you'd be able to have this JSON file of the actual customer and it would be like the meetings plus the financial plan. And then it seems like the agent should be able to ask\n\n[Dulaney, Stephen] 14:15:32\nFollow-on questions. Like there'd be a chat where they could where they're in the conversation or they see the prompt.\n\n[Dulaney, Stephen] 14:15:38\nAnd they should be able to ask a follow-on question on that data set.\n\n[Dimino, Thomas] 14:15:42\nRight. Like you're thinking like there should be kind of a series of steps like between the initial prompt and then the output and meeting assist.\n\n[Dulaney, Stephen] 14:15:52\nYeah. And if the meeting users gave up some ideas like um you know this guy likes pets or whatever. It's a contrived example.\n\n[Dimino, Thomas] 14:15:54\nWhere… Right.\n\n[Dulaney, Stephen] 14:16:01\nBut when was the last time that he had a new pet And it just seems like the ability to have them ask a follow-up It's low hanging fruit at some point because right now we're just spitting out some stuff and we're not letting them use their own brain.\n\n[Dimino, Thomas] 14:16:14\nRight. Right, right. Everything is just one shot so far.\n\n[Dimino, Thomas] 14:16:20\nI think that's a good point because that's a good point Again, all the past work I did, it's like a series of thought processes, right? It's like, because even human being who was just seeing a problem and then going straight to the answer. It's always like a zigzag you know it's like a maze of\n\n[Dulaney, Stephen] 14:16:21\nYeah.\n\n[Dimino, Thomas] 14:16:36\nOf synapses firing. I think with that, the lowest hanging fruit Which I think the wealth plan could be a good space to experiment with this because it's not live in production.\n\n[Dimino, Thomas] 14:16:47\nWould be to add an intermediary prompt like that's kind of that middle step where the agent that… Yeah, we could give it like uh if then.\n\n[Dulaney, Stephen] 14:16:53\nDrop down to follow on prompts, like 16 or so, and they could pick um That's better than not.\n\n[Dimino, Thomas] 14:17:01\nSort of conditions where we could kind of even like tweak the prompt you know it could be I don't know, based on the tone of the summaries I just generated, you know, what I want to do next and like I've done that in a\n\n[Dimino, Thomas] 14:17:17\nBoulayan way where I'll ask the model, like, is this true or false then if it is true or false, then which of these options are you going to choose? And I would give it like a to e And I would watch like, well, how often does it actually like\n\n[Dimino, Thomas] 14:17:32\nChoose different options. And I found like if you construct that very like just very simply that the LLM knows intuitively like these are my choices you will get like a relatively fair distribution Depending on, you know, other factors Like if I tell it, you can respond to me in one of five ways and it's like\n\n[Dimino, Thomas] 14:17:56\nYou can respectfully retort, you know, you can verbally abuse, all those types of things like it's it's usually tracked for me why the LM would choose the option.\n\n[Dimino, Thomas] 14:18:10\nBased on the prior context. Like it's never just so totally random. So I would want to do the same here where we can think, well.\n\n[Dimino, Thomas] 14:18:19\nWhat are those other options that could affect the prompt or the ultimate output based typically on like what we're doing with the wealth plan like what the outputs are supposed to look like. How can we give it some options and\n\n[Dimino, Thomas] 14:18:32\nThe other thing that I really wanted to do is how could we give the model its own internal model of the client, you know, like where it's able to say like, well, in my internal model This is also a JSON, and one of those keys could be age\n\n[Dulaney, Stephen] 14:18:42\nYeah, yeah. That's right.\n\n[Dimino, Thomas] 14:18:51\nThis or that. It's the sort of object where you could pass it you know it's it's not It's not being altered. You're just appending to it.\n\n[Dulaney, Stephen] 14:18:53\nYeah.\n\n[Dimino, Thomas] 14:19:00\nYou know, you're pending like more to that And that becomes like the core memory.\n\n[Dulaney, Stephen] 14:19:01\nYeah.\n\n[Dimino, Thomas] 14:19:06\nI know that… Alex has heard about this and he was intrigued. So he kind of already has given buy-in to we should think about doing memory because it's everyone else is using it\n\n[Dulaney, Stephen] 14:19:17\nNow, there's a new guy, Alexander, that took over. I believe he might have taken over for Patrick.\n\n[Dimino, Thomas] 14:19:22\nOh, really? No, no, I didn't meet Alexander then.\n\n[Dulaney, Stephen] 14:19:23\nHave you met yet? I mean, he's got like a PhD in and he's Russian and I mean, he seems to be Russian background for mathematics for his undergraduate and graduate so He seems like you're really smart. I haven't… And he's trying to take over on that architecture high inside.\n\n[Dimino, Thomas] 14:19:38\nGreat.\n\n[Dimino, Thomas] 14:19:42\nOh, he is. Is he focusing just on that or is he also doing wealth plan? Do you know?\n\n[Dulaney, Stephen] 14:19:48\nI think he'll be like the overall architect for worth playing and meeting exists and He's like the big brains on our side as far as like how AI models work at a deeper level.\n\n[Dimino, Thomas] 14:19:53\nOkay, okay. I'm getting ahead of myself then.\n\n[Dimino, Thomas] 14:20:02\nOkay, great. Yeah, I really like to I mean, man. And this is different from Alex, who is the lead, like, I guess the product owner I forget his title.\n\n[Dulaney, Stephen] 14:20:14\nYeah, I think it's Alexander, he's only been with us about of two weeks and he sent And I know that I think it was Patrick was the one that was with us um you know he was real conversational. He was in a lot of those that was his role\n\n[Dimino, Thomas] 14:20:17\nOh, oh yeah then he's then he's totally new.\n\n[Dulaney, Stephen] 14:20:31\nUm forgive me.\n\n[Dimino, Thomas] 14:20:32\nWhen did you have a chance to… to speak with Alexander.\n\n[Dulaney, Stephen] 14:20:36\nWell, he's just on our, we have the daily stand-up calls and I haven't spoken. I would need to set up a one-on-one. So I've only, you know.\n\n[Dulaney, Stephen] 14:20:42\nHeard him get up to speed and trying to like, I need more meetings i need to Because it's got to be daunting to come in and take over for like an architect that has a stuff in her head.\n\n[Dimino, Thomas] 14:20:42\nOkay.\n\n[Dimino, Thomas] 14:20:52\nYeah, yeah. Well, and I, yeah, having already kind of been thinking these things and not had necessarily like the right partners to talk about them with.\n\n[Dulaney, Stephen] 14:21:03\nYeah.\n\n[Dimino, Thomas] 14:21:03\nIt would be really great to connect with them. Could you tell me, what's his last name? And is he basically Alexander?\n\n[Dimino, Thomas] 14:21:08\nLike in the system is in the system\n\n[Dulaney, Stephen] 14:21:11\nLet's see what he is. I've got him in the… Well, there he is. It's Alex on here. It's Alex Kies, K-A-P-L-U-N-O-V-I-C-H.\n\n[Dulaney, Stephen] 14:21:22\nKyle Polinovich. Yeah, yeah. Look at our past meeting notes where he was in the calls. Let me check a few more.\n\n[Dimino, Thomas] 14:21:25\nWould you be able just to chat that? Only because I…\n\n[Dulaney, Stephen] 14:21:33\nBy the same name. Yeah.\n\n[Dimino, Thomas] 14:21:36\nYeah, because whenever I hear about someone like that on a team it's like I could definitely learn something from them.\n\n[Dimino, Thomas] 14:21:43\nAnd maybe they could learn something from me and it becomes a\n\n[Dulaney, Stephen] 14:21:47\nNow, I think that's what he's supposed to be in because those are coming out of teams our teams.\n\n[Dulaney, Stephen] 14:21:55\nHe introduced himself as Alexander the first episode, DC Specialist Master.\n\n[Dulaney, Stephen] 14:22:02\nBut yeah, you just, you know, you hear these guys and informally give their background. I was always intrigued.\n\n[Dulaney, Stephen] 14:22:08\nBut I need to spend some individual one-on-one time. I kind of came late to it because I was a math major in in college and the differentiality differential geometry and and tensors and Relativity.\n\n[Dulaney, Stephen] 14:22:24\nAnd there's parts of this that are like echoes that you know the tensors, the vector spaces, but we had pretty relatively small dimensional vector spaces and curvatures and these are like you know, 1024 dimensions Based on how many and more.\n\n[Dimino, Thomas] 14:22:25\nYeah, which… Mm-hmm.\n\n[Dulaney, Stephen] 14:22:44\nBut they are single vector spaces and dot products and transformations and likenesses and perpendicularities.\n\n[Dimino, Thomas] 14:22:45\nMm-hmm.\n\n[Dulaney, Stephen] 14:22:51\nSo it's…\n\n[Dimino, Thomas] 14:22:51\nYeah, and would you say that they're still the LLMs themselves are still non-deterministic?\n\n[Dimino, Thomas] 14:22:58\nIs that do you think like a law that Or do you think that that's not always the case, depending on like how the LM is trained and I guess the transformer architecture.\n\n[Dulaney, Stephen] 14:23:09\nI'm trying to look for kind of how i mean we we looked for structures that were invariant across transformations and some of the And I think some of the techniques they do are looking for those same things.\n\n[Dulaney, Stephen] 14:23:21\nBut I think as far as deterministic Yeah, I think they do this thing. It's a little bit different. They don't really know how it works. They just, they tune it.\n\n[Dulaney, Stephen] 14:23:30\nWhereas there's other modelers where they kind of want to understand what they're doing before they do it.\n\n[Dulaney, Stephen] 14:23:35\nAnd… So I don't i i'd probably… I would say right now it's say right now looks like it's non-deterministic, but it could be.\n\n[Dulaney, Stephen] 14:23:45\nIt's just the way they go about it. They're on success and they're not trying to really try to map it out or try to it does feel more like quantum than real relativity.\n\n[Dimino, Thomas] 14:23:47\nYeah, I mean…\n\n[Dulaney, Stephen] 14:24:02\nThey don't know what's going on, but it works. It gets great results. Whereas Relativity was all about trying to get and predict and reproduce really accurate calculations and that bending light by eclipse.\n\n[Dimino, Thomas] 14:24:02\nThat's…\n\n[Dulaney, Stephen] 14:24:15\nAnd they knew why it had happened.\n\n[Dimino, Thomas] 14:24:18\nNo, I mean, for me, um. From the moment I learned about quantum mechanics, even just as a layman like it It was so… It resonated so much with me because I mean, I studied biology when I was undergraduate but\n\n[Dimino, Thomas] 14:24:34\nI had a humanities leaning so that had that then became kind of my my path like through adulthood and I've always been a believer in uh some sense of magic. And now I'm kind of up against so many different sciences that just\n\n[Dimino, Thomas] 14:24:52\nKind of explain the nuances of it. And in a way, I'm angry at the sciences because I preferred when uh It was just something kind of… subjective. But now I see like you can you can explain so much especially um so\n\n[Dimino, Thomas] 14:25:08\nNon-local phenomenon, like, you know, with quantum mechanics, it's like, oh, of course, of course that's possible like\n\n[Dulaney, Stephen] 14:25:14\nI struggled with quantum mechanics because it went against my core. I got kind of taken in by the relativist first. And then so when I got to my quantum classes, I just didn't want to It's like, you can't just do this. You're making stuff up.\n\n[Dulaney, Stephen] 14:25:27\nAnd I finally have given into it, but it really was hard for me.\n\n[Dimino, Thomas] 14:25:33\nMm-hmm. Yeah, I think, and I think that even then ties into just the relativity of consciousness as well it's like it's relative because it's there aren't even necessarily static laws, you know, the laws themselves can can bend because you're you're seeing things move between\n\n[Dimino, Thomas] 14:25:53 Variable states. And that's i mean even the the explanations that I've read about how consciousness even exists you know in a in plasma form like it's it's something that's kind of in between states As well. And like in that space you can\n\n[Dulaney, Stephen] 14:26:09\nYep.\n\n[Dimino, Thomas] 14:26:13\nSee phenomenon that you call conscious and You could expect consciousness in any sufficiently large enough object that had the same sort of activity occurring, you know, with the right channels the right the right kind of soup of uh of that and a star could be a potential sentient creature. I guess a large enough rock\n\n[Dimino, Thomas] 14:26:39\nI mean, virtually anything. And that's very exciting because it just makes you aware that there's kind of enormous untold like caches of data in a sense, like in the environment everywhere. And it's just how do you even engage it you know is it supposed to be done more intuitively you know through meditation\n\n[Dulaney, Stephen] 14:26:39\nYep.\n\n[Dimino, Thomas] 14:27:01\nOther things or can you quantify that or turn that into some sort of mechanism it's um I think all those things just naturally start occurring to you come into mind with LLMs because they do feel very much like um\n\n[Dimino, Thomas] 14:27:16\nThey're in the middle of these states. And it has to always raise questions about how human consciousness works and develops.\n\n[Dimino, Thomas] 14:27:26\nAnd then why, you know, why the LLM is not convincing? What is it missing necessarily that it should have and that that's like a trillion dollar question right now because agents are everywhere\n\n[Dulaney, Stephen] 14:27:38\nIt is. I don't know. Leonard Susskind, who was a relativist, he's actually really good teachers basically I followed his teachings as far as relativity, and he's the one that probably got me closest to understanding quantum.\n\n[Dulaney, Stephen] 14:27:51\nBut in his late, late life, like in his last years, he's struggling with quantum mechanics and consciousness And I haven't heard anything he said about large language models, but that would be interesting to see.\n\n[Dulaney, Stephen] 14:28:03\nHow he fits that into his understanding in his fading days.\n\n[Dimino, Thomas] 14:28:08\nMy own kind of my own kind of take on the large language model is that if you kind of pull away all the thoughts about the machine learning that led to them.\n\n[Dimino, Thomas] 14:28:19\nI don't think they're that different from like a book or any sufficiently large text and It's all just a question of how the agent is trained You know, to interpret that book or what what that what that uh that\n\n[Dulaney, Stephen] 14:28:24\nYeah.\n\n[Dimino, Thomas] 14:28:39\nLanguage set is going to elicit? What is it going to induce the agent to do?\n\n[Dimino, Thomas] 14:28:43\nYou know, for a human, if you give me a book, I'd probably write a million essays about it.\n\n[Dimino, Thomas] 14:28:50\nUse some of the language and conversation. There's a million different ways it could have seeded or imprinted itself.\n\n[Dimino, Thomas] 14:28:55\nAnd I think that's why with all these architectures, to go back to the meeting assist.\n\n[Dimino, Thomas] 14:29:01\nLike memory is you know an obvious tool that the model needs But then how do you do the memory? Like I've seen many different ways to do that and and i think Very simply, just being able to store objects\n\n[Dimino, Thomas] 14:29:17\nAnd then import the objects make prompts that refer to the objects or the information inside the objects, that's the best way to do it. And I don't think that's too dissimilar from how humans do it.\n\n[Dimino, Thomas] 14:29:31\nLike in a sense, it's just you know there's much more complexity to that.\n\n[Dulaney, Stephen] 14:29:35\nYeah, that's where it gets back into like they're basically making vectors and vector stores is in this big old chunk of numbers.\n\n[Dulaney, Stephen] 14:29:42\nBut it's weird how the whole fact that it's got language and it's got um you know as language has these different concepts And it could actually translate without being told it needs to translate.\n\n[Dulaney, Stephen] 14:29:54\nThat's getting at that deeper relationship between things and so at some point i see how it's like.\n\n[Dimino, Thomas] 14:29:54\nMm-hmm.\n\n[Dulaney, Stephen] 14:30:00\nIt's demystified when you see that it plagiarize everything. And then when I find out little tidbits i could It just picked up chess. And you're like And what else can it do? So that's where I understand it. It seems like it's just\n\n[Dulaney, Stephen] 14:30:15\nComputer code that's read a lot of stuff and made these connections. Then there's other parts that are still a mystery to me.\n\n[Dimino, Thomas] 14:30:21\nYeah, and that thread on the chest I believe I saw it.\n\n[Dimino, Thomas] 14:30:26\nI think by the time I read it, it had been shared or I don't know, liked a million times, but I recall it was kind of a proof of how the LM was able to play.\n\n[Dulaney, Stephen] 14:30:31\nYeah.\n\n[Dimino, Thomas] 14:30:38\nOr make those decisions. From an indeterminate place.\n\n[Dulaney, Stephen] 14:30:44\nExactly. Not like it didn't. They tried to check to make sure it was just not finding old games. He was making was using the concepts in language embedded in language and um That's what I think, what else are we missing? There's probably some other easy prompts.\n\n[Dimino, Thomas] 14:30:48\nRight, right.\n\n[Dulaney, Stephen] 14:30:58\nWhere it can pick up these relationships that are embedded in language and you get, you know, when I talk about the stuff you get for free.\n\n[Dulaney, Stephen] 14:31:04\nBut you still have to discover what they are and how to prompt for them.\n\n[Dimino, Thomas] 14:31:09\nMm-hmm.\n\n[Dulaney, Stephen] 14:31:13\nNow, one question. When you do your prompts, what environment like do you have a window? Because I don't want to just go to chat GBT and type in stuff for JP Morgan.\n\n[Dimino, Thomas] 14:31:14\nI forgot what I was going to say, but yes, what was your question?\n\n[Dulaney, Stephen] 14:31:25\nBut is there an environment that you work in or windows that you actually, how do you do your work?\n\n[Dimino, Thomas] 14:31:30\nWhat I found useful on the work laptop, which was different from how I do my personal, is that I just use Visual Studio Code.\n\n[Dimino, Thomas] 14:31:39\nTo have a space where I can just see the prompt laid out as a markdown file. And at least then, you know, there's some like coloring of syntax. It just makes it easier to read. And then, of course, having like the\n\n[Dimino, Thomas] 14:31:55\nAnd the line number is useful too. So that… Oh, oh, no. Up until now.\n\n[Dulaney, Stephen] 14:31:58\nBut I mean, you have an environment that you're running the Once again.\n\n[Dimino, Thomas] 14:32:03\nI didn't want to go through the headache of like getting all the necessary permissions in order to just have my own environment, especially since We're not… I mean, that's my first question. Were you able to access the Bitbucket link?\n\n[Dulaney, Stephen] 14:32:21\nNo, no, I haven't done that. It's like I'm in the same place you are. I don't want to I don't want to do anything wrong, but I want to be able to run experiments And right now I've kind of been on the sideline, but I would run it, you know, how can I help you more? How can I support you more?\n\n[Dimino, Thomas] 14:32:23\nBecause…\n\n[Dimino, Thomas] 14:32:36\nWell, yeah, so to that question what uh What I think would probably be the best\n\n[Dimino, Thomas] 14:32:46\nLike compromise, not even compromise, but I think the solution would be If you wanted, you could join at the least these weekly calls that I have with Sandeep and… And they're the ones who are i think Before Patrick left, we're directly responsible for\n\n[Dulaney, Stephen] 14:32:57\nI'd love to. Yeah.\n\n[Dimino, Thomas] 14:33:05\nLike actually working with the Python, running it. In their like in their test environment And then getting some outputs. So they, uh, they seem like very responsive thoughtful people so we if we told them like could you guys give us outputs for this like\n\n[Dimino, Thomas] 14:33:27\nEvery other day. They could probably do that on our behalf. So we'd get around us having to go through all the hoops of being able to finally Yeah. Like the steps that it would take for me to be able to have a terminal that I could use that would be like connected to all the different services.\n\n[Dulaney, Stephen] 14:33:32\nRight, right, right. So comma developer, and then all the responsibility.\n\n[Dulaney, Stephen] 14:33:43\nYeah.\n\n[Dimino, Thomas] 14:33:44\nAnd then, you know, we're not even calling like OpenAI we're calling I forget some other provider that is calling to OpenAI. So it's like There's lots of different credentials and permissions. And I was just like.\n\n[Dulaney, Stephen] 14:33:53\nYeah.\n\n[Dimino, Thomas] 14:33:58\nThis is not above my pay grade it's just above my pay grade it's going to take me away from the work I'm supposed to be doing.\n\n[Dulaney, Stephen] 14:34:04\nI have a kind of an exclusion where I have like this. I've been given permission to do AI research.\n\n[Dulaney, Stephen] 14:34:10\nAnd so I have access to a lot of those models through that kind of grant is like tinkerer, but I try not to use that with on the client work.\n\n[Dulaney, Stephen] 14:34:19\nAs much because so with client work, I got to stick to the SOW and, you know, make sure everything's clear.\n\n[Dimino, Thomas] 14:34:24\nSo with your grant, it's it's um you basically have an account with one of these LM providers that offers like a bunch of models.\n\n[Dulaney, Stephen] 14:34:32\nDeloitte has the open ai model and then um with the um What's the one that I've used?\n\n[Dimino, Thomas] 14:34:39\nIs what what was unfortunate for me was that I used to work closely with a startup that Also, ultimately went to an LLM provider, but they at least were the the middlemen And they built out kind of their own api\n\n[Dimino, Thomas] 14:34:58\nAnd it made it very easy to build agents and characters and then just select the model I wanted.\n\n[Dimino, Thomas] 14:35:06\nWrite the prompts, write the actual programming. But took away lots of the headache You know, of dealing with these API calls and lots of the formatting of outputs and various things.\n\n[Dulaney, Stephen] 14:35:08\nYeah.\n\n[Dulaney, Stephen] 14:35:18\nSo Deloitte has its own account with open API. So that's a Deloitte logon. And then the other one I use a lot is deep learning ai And… And it has a lot of Python examples.\n\n[Dimino, Thomas] 14:35:28\nOh, yeah, I've heard of that.\n\n[Dulaney, Stephen] 14:35:32\nAnd then in that Python dev environment, I run the scripts. And so connect to the LAMA model.\n\n[Dulaney, Stephen] 14:35:39\nSo that's kind of getting on the gray zone because I connect a lot of the… the meta models.\n\n[Dimino, Thomas] 14:35:39\nI mean, if…\n\n[Dulaney, Stephen] 14:35:46\nThrough the landline.\n\n[Dimino, Thomas] 14:35:47\nYeah, if that's the case, then… I mean, if you really wanted beyond like us being able to talk to Sandeep and Nagula you could you could probably just copy like most of the Python that they have, like in the code base and at least like the essential parts\n\n[Dimino, Thomas] 14:36:05\nAnd then, you know, wherever it's trying to import something, you could just substitute you know with your own And you could probably get that running to at least validate like the quality of the prompt.\n\n[Dimino, Thomas] 14:36:15\nYou know, so you could iterate on it more quickly I used to have all this set up.\n\n[Dimino, Thomas] 14:36:22\nOn my personal laptop, but I haven't been able to do any coding now Probably six months, like since I've been able to do it like for hours on end.\n\n[Dimino, Thomas] 14:36:32\nI want to get back into it. There's so many different open source projects now but It's been a gradual thing.\n\n[Dulaney, Stephen] 14:36:36\nOkay.\n\n[Dimino, Thomas] 14:36:42\nBecause of personal life and my partner going through some treatments. So it's been hard to you know have um the free time.\n\n[Dimino, Thomas] 14:36:50\nThere's not as much carefree time. But…\n\n[Dulaney, Stephen] 14:36:51\nIt's… Yeah, yeah.\n\n[Dulaney, Stephen] 14:36:55\nWell, let's try to do regular meetings. And if there are meetings, that sounds great. And then just be able to reach out. I know I have capacity if there's things that you want to either just talk about or hand off, please feel free.\n\n[Dimino, Thomas] 14:36:58\nSure.\n\n[Dimino, Thomas] 14:37:07\nYeah, I think that's the most constructive and uh healthiest way to go about my time with Jimmy Morgan.\n\n[Dimino, Thomas] 14:37:16\nSo as I… Same.\n\n[Dulaney, Stephen] 14:37:16\nYeah, mine too. I'd love to take advantage of learning as much as I can in this whole AI thing. And it's kind of hard to get totally ramped involved with. And I did. I've been playing with this using those those\n\n[Dulaney, Stephen] 14:37:27\nTranscripts and running AI scripts against them And that's kind of how, you know, I load up three or four transcripts and then ask questions. And there's a lot you can do there, but I kind of exhausted that. I want to kind of figure out, you know, what's next.\n\n[Dimino, Thomas] 14:37:42\nYeah, there was talk I'm trying to remember where it fit in.\n\n[Dimino, Thomas] 14:37:49\nI think this conversation, and I'll just say this quickly because then I have to go to a meeting with Rigved and anna Which is for editing a script.\n\n[Dimino, Thomas] 14:37:59\nFor a promotional video for meeting assist but Someone said that they want meeting assist to have a feature, kind of a final step.\n\n[Dimino, Thomas] 14:38:09\nWhere… And LM is able to make a characterization of the client.\n\n[Dimino, Thomas] 14:38:15\nLike, oh, there's six types of clients this could be like six different personas, which persona does this client fall into?\n\n[Dulaney, Stephen] 14:38:21\nYeah.\n\n[Dimino, Thomas] 14:38:26\nI don't think they really have the persona research even done. So that is something that came up.\n\n[Dimino, Thomas] 14:38:32\nWhich they would like to which they would like have in some form, you know, even if it's just kind of like the scaffolding of it.\n\n[Dimino, Thomas] 14:38:40\nTo even just suggest what those six personas could be. I mean, if…\n\n[Dulaney, Stephen] 14:38:40\nYep. Well, there's three that are pretty much universals. There's like conservative savers there's relationship focused people and active traders.\n\n[Dulaney, Stephen] 14:38:50\nAnd those are almost are universal in like computer buyers. I mean, those are just shoppers in general. There's there's um there's\n\n[Dimino, Thomas] 14:38:50\nMm-hmm.\n\n[Dimino, Thomas] 14:38:56\nAnd those are people who would still have wealth advisors like Bye.\n\n[Dulaney, Stephen] 14:39:00\nExactly. And you know, like advisors do this in their head. They know if this is a conservative saver, they're going to want to have like big safe balances. Their cash management is really too large Whereas they're active traders, they're going to want to have a lot of like\n\n[Dulaney, Stephen] 14:39:15\nControl day trading and then the relationships are the ones that just like they really value to talk to a lot and just handle a lot of stuff off to you.\n\n[Dulaney, Stephen] 14:39:22\nAnd those are just three, but they're pretty universal. When you get to six, then you start to get… But even then, if you had just an icon You know, and maybe people are a score there's some conservative some relationship\n\n[Dulaney, Stephen] 14:39:35\nBut that's a good place on that idea to start. Without having to do a whole lot because that's pretty universal.\n\n[Dimino, Thomas] 14:39:40\nYeah. And they… they've expressed, like Alex and another person on the call they expressed that say you don't have any qualms about trying to… I just label these clients you know just like create some more metadata about each of them.\n\n[Dimino, Thomas] 14:39:59\nAnd use the LLM to kind of make the judgment or fit them or fit them into a bucket so there you could…\n\n[Dulaney, Stephen] 14:40:05\nAnd the other one was readiness to transfer money. And we're going to score there is um And there could be.\n\n[Dimino, Thomas] 14:40:10\nRight, right. And that's kind of like the Buland, right? It's like a yes or no, like.\n\n[Dulaney, Stephen] 14:40:14\nThere's like a state model that you could do like the near shopper you know we do that with when people start to focus on the same item in their basket over and over.\n\n[Dimino, Thomas] 14:40:15\nLike a…\n\n[Dulaney, Stephen] 14:40:21\nThey're about ready to purchase. If they're early stage, they're switching between categories.\n\n[Dulaney, Stephen] 14:40:26\nAnd so that's the the state model for like readiness to to activate. Those two, I think we talked about in that last big meeting.\n\n[Dulaney, Stephen] 14:40:37\nWhen I had those on my little next step ideas charts.\n\n[Dulaney, Stephen] 14:40:41\nBut that's a good feedback.\n\n[Dimino, Thomas] 14:40:43\nYeah, and with some of those, they could probably use just like rules-based logic but more subjective things.\n\n[Dulaney, Stephen] 14:40:50\nI almost think one, I almost think that the motto that's like the chess game. I almost think it could actually intuit that for free without having to like set up a state model.\n\n[Dulaney, Stephen] 14:40:59\nThe old school that if it had access to the, you know, it might be able to intuit that More than we think. And then as far as the Exactly. Yeah.\n\n[Dimino, Thomas] 14:41:00\nYeah. Yes.\n\n[Dimino, Thomas] 14:41:06\nYeah, it's all just a question of cost at the end, right?\n\n[Dulaney, Stephen] 14:41:11\nSo that's why you could do a state model or you could just make a clever prompt and see how far you get.\n\n[Dimino, Thomas] 14:41:18\nYes, I would talk to you more, but I have to go on this call with Rick Ved now. But yeah.\n\n[Dulaney, Stephen] 14:41:20\nI did. That's good.\n\n",
  "chunks": [
    {
      "text": " [Dimino, Thomas] 14:00:32 Hey, Steven.  [Dulaney, Stephen] 14:00:33 Hello, I've turned off my washer. Its noise speaks the loudest time right when I need a call.  [Dimino, Thomas] 14:00:39 Yeah, how are you doing? It feels like it's been uh Yeah, it's been a while.  [Dulaney, Stephen] 14:00:42 How are they? Yeah.  [Dimino, Thomas] 14:00:47 Yeah, things are reasonably well. There's kind of a different mood that's come over, I think JB Morgan as of today because They've now announced that they're going to force everyone back to the office like they're eliminating hybrid work and remote work entirely. So this is unfortunate because  [Dimino, Thomas] 14:01:12 I was actively considering a salary position within this team but within this team it's just not feasible. I would negotiate even around two days in the office but five days Yeah, it's just for me, it's like that would be  [Dulaney, Stephen] 14:01:25 I go full time back in the office.  [Dimino, Thomas] 14:01:31 A professional regression. I've learned like how much more effectively i work with flexibility you know versus what I used to do when I was you know working at like marketing agencies where you had to sit under the bright lights and, you know, pound away at the keyboard  [Dimino, Thomas] 14:01:48 Like my productivity would never equal just being able to be an adult and work responsibly. So it's very kind of very insulting, but it has nothing to do with this team.  [Dulaney, Stephen] 14:02:00 Not yet.  [Dimino, Thomas] 14:02:00 It's just upper management. So, you know, emotionally just kind of processing that but um  [Dulaney, Stephen] 14:02:06 It's probably going to ebb and flow. I can't imagine I mean, I can envision that they might back off part of that but  [Dimino, Thomas] 14:02:13 Yeah, it may… It may bite me in the ass because AT&T has already implemented this. And what they're finding is that they simply don't have the infrastructure. They don't have enough desks for all their employees. So you're forcing people to play musical chairs  [Dimino, Thomas] 14:02:32 And I mean, I saw this implemented at Google. Too um it just doesn't make anyone's life easier You know, it's only ever done like for the sake of the stock like because you know shareholders think these things are like wise business, you know, decisions, especially in the age of Trump now but  [Dulaney, Stephen] 14:02:51 Yeah, I think it is a trendy thing. It's Elon and trump and it's like… It'll pass. Hopefully the feet break. I thought it was broken already, but…  [Dimino, Thomas] 14:02:58 Yeah. What's amusing me the most is… a couple of years ago during the pandemic, I worked briefly for Chan Zuckberg Initiative that was kind of my first taste of programming, actually, because I was hired to be a content strategist  [Dimino, Thomas] 14:03:16 Who would basically learn everything there was to know about this open source platform called Napari, which was for image analysis I would learn everything I could about that because Chan Zuckerberg you know this kind of philanthropic side of meta  [Dimino, Thomas] 14:03:33 Was trying to invest in different open source projects that were going to be accessible, free.  [Dimino, Thomas] 14:03:40 And just bring about all this good scientific change. And I don't know if you've heard or watched any interviews with Mark Zuckerberg of late, but he has kind of embraced this uh kind of like online like tech bro persona. And it's such a market shift from how he presented himself with his wife  [Dimino, Thomas] 14:04:02 Like when I worked as a contractor at his company. And it just kind of makes everything feel so much more insincere but You know, it is what it is. I don't really sweat these things because It's just theatrics, but…  [Dulaney, Stephen] 14:04:16 Yeah. Yeah. So how soon are they wanting everyone to go back to the office?  [Dimino, Thomas] 14:04:16 Yeah. C'est la vie.  [Dimino, Thomas] 14:04:23 I think the memo said March 25th. Yeah, I mean, I think that still excludes me Because… from what i what like Tim shared with me from all the managers have a dashboard where they see the um like how often are people coming to the office so everything is tracked. And if the team fell below  [Dulaney, Stephen] 14:04:25 Okay, so let's still a couple.  [Dulaney, Stephen] 14:04:31 Yeah.  [Dimino, Thomas] 14:05:04 60% like in-office attendance than the manager would start to get like.  [Dimino, Thomas] 14:05:04 The sweat rolling down his back and his upper management would be like, what's going on? You know, you got to remedy this So I imagine now it's now no one can go below 100% where it used to be 60%.  [Dimino, Thomas] 14:05:21 And that's unfortunate because it's only going to make life of the managers more stressful.  [Dimino, Thomas] 14:05:21 So really no one wins in this type of system  [Dimino, Thomas] 14:05:27 And I don't know if you… Didn't hear me at some point my connection Dev.  [Dulaney, Stephen] 14:05:32 Yeah. I got some latency going on, but that's okay. I got most of it.  [Dimino, Thomas] 14:05:36 Okay, no worries.  [Dulaney, Stephen] 14:05:39 And it's kind of interesting. So I just wanted to make sure I've been kind of working on the research findings and doing that kind of stuff together, but I just want to make sure now that, you know.  [Dulaney, Stephen] 14:05:49 You're taking over for… Tim, essentially.  [Dimino, Thomas] 14:05:53 It's him as well as another gentleman you may have met are heard on calls is patrons I forget what his exact title was. He was also with Deloitte, but he was overseeing kind of the product design of the wealth plan agent  [Dulaney, Stephen] 14:06:00 Okay.  [Dimino, Thomas] 14:06:10 And now there's kind of that void there. So I basically volunteered to give some some guidance on how to make the wealth plan agent like useful in production because because right now it's not part of the pilot But of course, they want to push it, I would think, in their next phase of that.  [Dimino, Thomas] 14:06:32 So like my contract now will go until end of May, like May 31st. So, you know, my objective is at the very least like see this wealth plan agent you know through to production And then perhaps work with them like  [Dimino, Thomas] 14:06:49 Whoever's kind of the head of meeting assist which is still be honest with you, kind of unclear to me as if And I would ask the same question of you even just to get your perspective, but I kind of treat  [Dimino, Thomas] 14:07:02 Sarah and Rigved. And Alex kind of as like this little triumvirate They're not a true triumvirate because Sarah is woman. But I feel like they are the decision makers when it comes to the ultimate direction for the product. And they are the ones who usually step in  [Dimino, Thomas] 14:07:21 Usually more Sarah, I think, than the rest. But Sarah and Rigved have stepped in Yeah, in my experience, Sarah and Ringved both step in to make suggestions around like content proposals or research proposals or even just like engineering proposals. So they in that sense have the final ownership  [Dulaney, Stephen] 14:07:25 And that's their lead, right? Okay.  [Dimino, Thomas] 14:07:43 So having kind of having you know gone through all that context again Yeah, I just want to help them with with the Wolf Plan. And I think that's going to involve both um like the prompt tuning of what already exists because they already have something like that's in their um  [Dimino, Thomas] 14:08:02 Virtual environment in their testing environment So they have it running already. They can already get outputs.  [Dimino, Thomas] 14:08:09 From this agent. It's just kind of a question of this agent essentially is essentially it's given a JSON file.  [Dimino, Thomas] 14:08:19 That has upwards of upwards like 600 keys and values in it Which I think mostly are about like the different wealth plan goals different like stats around them. And I have examples of this in a Figma that I shared. I think it was called Drafting the Wealth Plan Agent.  [Dimino, Thomas] 14:08:39 That's not updated as of like the latest changes to this code base, but it more or less represents kind of what we're working with so Yeah, there'll be an aspect of just figuring out how do we best use that JSON  [Dimino, Thomas] 14:08:54 With the 600 keys and values. You know to to like the the fullest where we're getting like  [Dulaney, Stephen] 14:09:00 Now, JSON file created for a client. So a customer, they run the thing and it creates the JSON that has all the data about the customer. And then you ask, you query, the agent queries the JSON about recommends.  [Dimino, Thomas] 14:09:11 Or I guess the way it happens in terms of the engineering flow is like the JSON is generated were exported.  [Dimino, Thomas] 14:09:23 Or they kind of call it with an API. They call it from, I guess, their wealth plan system. The wealth plan system exports this JSON file that's just that wealth plan, which would usually be like a pdf you know with a bunch of  [Dulaney, Stephen] 14:09:35 And it's a wet plant for that specific customer.  [Dimino, Thomas] 14:09:38 Yeah, for that client. So the system, JPMorgan system already has all that data usually displayed as a pdf So we're instead just asking for the JSON.  [Dulaney, Stephen] 14:09:48 Yeah.  [Dimino, Thomas] 14:09:50 And that JSON is then being converted into a string. That's being given to GPT 4.0 and we're telling it here in this JSON.  [Dimino, Thomas] 14:10:03 This is how it's laid out and these are some keys that would be of particular interest to you inside of this field of text.  [Dimino, Thomas] 14:10:12 And then from there, just standard standard prompt you know not they they use the existing summary and insight prompts.  [Dimino, Thomas] 14:10:22 From the CRM agents, the advisor agent, they use that as their base and they kind of modify it from there.  [Dimino, Thomas] 14:10:29 And I think they're at the stage where They want us because they're based in India. So naturally they want us to look at it, make sure like grammatically like logically, you know, it's making sense like nothing is kind of contradicting anything else. And then they want us to help them figure out  [Dimino, Thomas] 14:10:48 Now that we have this running, how do we actually evaluate it?  [Dimino, Thomas] 14:10:51 Because it's not the same evaluation that we were doing before.  [Dimino, Thomas] 14:10:55 Where was the question of like is this summary you know like one of these four things and then like how you rate that I feel this will have to be rethought. So there's an evaluation part to it too like how do we how can we actually evaluate this where  [Dulaney, Stephen] 14:10:58 Useful, yeah.  [Dulaney, Stephen] 14:11:09 Bye.  [Dimino, Thomas] 14:11:11 We can tell if it's doing better or worse. As we're changing the prompt behind it and everything.  [Dimino, Thomas] 14:11:18 And yeah, beyond that. It's just a question of, because I think your background, you've done plenty of like engineering right like the front end and back end.  [Dimino, Thomas] 14:11:28 So the other side of it is they wrote this in Python. They used a lang graph.  [Dimino, Thomas] 14:11:34 Which is, I mean, I've only ever used link chain, so I'm guessing lane graph happened.  [Dulaney, Stephen] 14:11:34 Yeah.  [Dimino, Thomas] 14:11:39 Sometime in the last year.  [Dulaney, Stephen] 14:11:41 Yeah, I've done only like training things on these. So I haven't actually used them in a minute, but I've done a lot of training just where I'm familiar with them and And try to keep up because it is changing fast. You know, one thing I heard, which is surprising to me, I don't know if you already heard this, but so when they were doing chat GPT three.  [Dulaney, Stephen] 14:11:57 And this was on Twitter. Stop me if you already heard this that they found out that they found out it intuited the game of chess just of chess by the language. No one actually gave it the rule.  [Dimino, Thomas] 14:12:08 Oh.  [Dulaney, Stephen] 14:12:08 Or the board. Which is weird. So if we can do that, what other problems can it into it? So, I mean, I feel like there's certain things that we're missing, like, can it actually intuit?  [Dulaney, Stephen] 14:12:17 What a financial advisor would do with Wealth Plan. And what strategies they want, you know, without us having to like articulate clearly  [Dimino, Thomas] 14:12:24 Right, without having to be pedantic about it and give it like stricter guidelines. Yeah, I… I think like philosophically speaking, I definitely am of that mind that that If you approach this a little more creatively.  [Dimino, Thomas] 14:12:39 You could achieve that. And that's just based on my past experience creating more like role-playing personas like with um different versions of GPT-4 and then the llama model Like they, I think the cleaner and the more minimalistic the prompt  [Dimino, Thomas] 14:12:59 Like sometimes the more amazing the results, you know, because you kind of get flabbergasted like this is like eerily human And then, of course, it has It's like the prompt itself is both narrowing the focus of all of that  [Dulaney, Stephen] 14:13:03 Yeah.  [Dimino, Thomas] 14:13:14 Like as latent space it has, right? All those neurons it's like narrowing it And that can be effective, but it's like, when does that come at a cost and And that cost could be that a wealth advisor is not just a wealth advisor they're a human being  [Dimino, Thomas] 14:13:27 And it definitely seems to be very socially driven profession aside from being able to weigh in where the market is telling you to do something so Yeah, I would think there's a certain Like this idea of insight that we're after, like we want insights that are different from summaries, I think  [Dulaney, Stephen] 14:13:28 Right.  [Dulaney, Stephen] 14:13:42 Yeah.  [Dimino, Thomas] 14:13:45 To really do that in a way that would be equal to a seasoned advisor, you would have to kind of more creatively approach the task of even building the persona or the initial prompt like for these agents because right now they're a bit robotic  [Dimino, Thomas] 14:14:02 And I think part of the problem is that there needed to be very strict hallucination checks in place you know and doing that like required just having very explicit language so I just accepted all those limitations.  [Dulaney, Stephen] 14:14:09 Right.  [Dimino, Thomas] 14:14:17 How this project has been built is not how I would build.  [Dimino, Thomas] 14:14:21 An AI product, whether it was for enterprise or for personal use just because I have different philosophy, especially since this is about words like to me it's almost like writing a draft for a short story You know, I want to give better  [Dulaney, Stephen] 14:14:30 Right.  [Dimino, Thomas] 14:14:37 Creative brief, you know, than what we're currently giving it like Really, case in point, even for meeting assist is For all of the prompts, like the first two, three sentences is basically you are this, you know, it's like.  [Dimino, Thomas] 14:14:51 Kind of like willing it into existence and I had to kind of push them even to tell them like, well, it may help to say that you work at JP Morgan because that itself comes with certain associations. There's like a certain prestige  [Dimino, Thomas] 14:15:08 Whereas if I'm saying you're just a world advisor. You could be doing it as a hobby. I don't know. You know, technically speak.  [Dulaney, Stephen] 14:15:14 Yeah, yeah. It does.  [Dulaney, Stephen] 14:15:17 One thing, do you know, like it seems obvious to me like you'd be able to have this JSON file of the actual customer and it would be like the meetings plus the financial plan. And then it seems like the agent should be able to ask  [Dulaney, Stephen] 14:15:32 Follow-on questions. Like there'd be a chat where they could where they're in the conversation or they see the prompt.  [Dulaney, Stephen] 14:15:38 And they should be able to ask a follow-on question on that data set.  [Dimino, Thomas] 14:15:42 Right. Like you're thinking like there should be kind of a series of steps like between the initial prompt and then the output and meeting assist.  [Dulaney, Stephen] 14:15:52 Yeah. And if the meeting users gave up some ideas like um you know this guy likes pets or whatever. It's a contrived example.  [Dimino, Thomas] 14:15:54 Where… Right.  [Dulaney, Stephen] 14:16:01 But when was the last time that he had a new pet And it just seems like the ability to have them ask a follow-up It's low hanging fruit at some point because right now we're just spitting out some stuff and we're not letting them use their own brain.  [Dimino, Thomas] 14:16:14 Right. Right, right. Everything is just one shot so far.  [Dimino, Thomas] 14:16:20 I think that's a good point because that's a good point Again, all the past work I did, it's like a series of thought processes, right? It's like, because even human being who was just seeing a problem and then going straight to the answer. It's always like a zigzag you know it's like a maze of  [Dulaney, Stephen] 14:16:21 Yeah.  [Dimino, Thomas] 14:16:36 Of synapses firing. I think with that, the lowest hanging fruit Which I think the wealth plan could be a good space to experiment with this because it's not live in production.  [Dimino, Thomas] 14:16:47 Would be to add an intermediary prompt like that's kind of that middle step where the agent that… Yeah, we could give it like uh if then.  [Dulaney, Stephen] 14:16:53 Drop down to follow on prompts, like 16 or so, and they could pick um That's better than not.  [Dimino, Thomas] 14:17:01 Sort of conditions where we could kind of even like tweak the prompt you know it could be I don't know, based on the tone of the summaries I just generated, you know, what I want to do next and like I've done that in a  [Dimino, Thomas] 14:17:17 Boulayan way where I'll ask the model, like, is this true or false then if it is true or false, then which of these options are you going to choose? And I would give it like a to e And I would watch like, well, how often does it actually like  [Dimino, Thomas] 14:17:32 Choose different options. And I found like if you construct that very like just very simply that the LLM knows intuitively like these are my choices you will get like a relatively fair distribution Depending on, you know, other factors Like if I tell it, you can respond to me in one of five ways and it's like  [Dimino, Thomas] 14:17:56 You can respectfully retort, you know, you can verbally abuse, all those types of things like it's it's usually tracked for me why the LM would choose the option.  [Dimino, Thomas] 14:18:10 Based on the prior context. Like it's never just so totally random. So I would want to do the same here where we can think, well.  [Dimino, Thomas] 14:18:19 What are those other options that could affect the prompt or the ultimate output based typically on like what we're doing with the wealth plan like what the outputs are supposed to look like. How can we give it some options and  [Dimino, Thomas] 14:18:32 The other thing that I really wanted to do is how could we give the model its own internal model of the client, you know, like where it's able to say like, well, in my internal model This is also a JSON, and one of those keys could be age  [Dulaney, Stephen] 14:18:42 Yeah, yeah. That's right.  [Dimino, Thomas] 14:18:51 This or that. It's the sort of object where you could pass it you know it's it's not It's not being altered. You're just appending to it.  [Dulaney, Stephen] 14:18:53 Yeah.  [Dimino, Thomas] 14:19:00 You know, you're pending like more to that And that becomes like the core memory.  [Dulaney, Stephen] 14:19:01 Yeah.  [Dimino, Thomas] 14:19:06 I know that… Alex has heard about this and he was intrigued. So he kind of already has given buy-in to we should think about doing memory because it's everyone else is using it  [Dulaney, Stephen] 14:19:17 Now, there's a new guy, Alexander, that took over. I believe he might have taken over for Patrick.  [Dimino, Thomas] 14:19:22 Oh, really? No, no, I didn't meet Alexander then.  [Dulaney, Stephen] 14:19:23 Have you met yet? I mean, he's got like a PhD in and he's Russian and I mean, he seems to be Russian background for mathematics for his undergraduate and graduate so He seems like you're really smart. I haven't… And he's trying to take over on that architecture high inside.  [Dimino, Thomas] 14:19:38 Great.  [Dimino, Thomas] 14:19:42 Oh, he is. Is he focusing just on that or is he also doing wealth plan? Do you know?  [Dulaney, Stephen] 14:19:48 I think he'll be like the overall architect for worth playing and meeting exists and He's like the big brains on our side as far as like how AI models work at a deeper level.  [Dimino, Thomas] 14:19:53 Okay, okay. I'm getting ahead of myself then.  [Dimino, Thomas] 14:20:02 Okay, great. Yeah, I really like to I mean, man. And this is different from Alex, who is the lead, like, I guess the product owner I forget his title.  [Dulaney, Stephen] 14:20:14 Yeah, I think it's Alexander, he's only been with us about of two weeks and he sent And I know that I think it was Patrick was the one that was with us um you know he was real conversational. He was in a lot of those that was his role  [Dimino, Thomas] 14:20:17 Oh, oh yeah then he's then he's totally new.  [Dulaney, Stephen] 14:20:31 Um forgive me.  [Dimino, Thomas] 14:20:32 When did you have a chance to… to speak with Alexander.  [Dulaney, Stephen] 14:20:36 Well, he's just on our, we have the daily stand-up calls and I haven't spoken. I would need to set up a one-on-one. So I've only, you know.  [Dulaney, Stephen] 14:20:42 Heard him get up to speed and trying to like, I need more meetings i need to Because it's got to be daunting to come in and take over for like an architect that has a stuff in her head.  [Dimino, Thomas] 14:20:42 Okay.  [Dimino, Thomas] 14:20:52 Yeah, yeah. Well, and I, yeah, having already kind of been thinking these things and not had necessarily like the right partners to talk about them with.  [Dulaney, Stephen] 14:21:03 Yeah.  [Dimino, Thomas] 14:21:03 It would be really great to connect with them. Could you tell me, what's his last name? And is he basically Alexander?  [Dimino, Thomas] 14:21:08 Like in the system is in the system  [Dulaney, Stephen] 14:21:11 Let's see what he is. I've got him in the… Well, there he is. It's Alex on here. It's Alex Kies, K-A-P-L-U-N-O-V-I-C-H.  [Dulaney, Stephen] 14:21:22 Kyle Polinovich. Yeah, yeah. Look at our past meeting notes where he was in the calls. Let me check a few more.  [Dimino, Thomas] 14:21:25 Would you be able just to chat that? Only because I…  [Dulaney, Stephen] 14:21:33 By the same name. Yeah.  [Dimino, Thomas] 14:21:36 Yeah, because whenever I hear about someone like that on a team it's like I could definitely learn something from them.  [Dimino, Thomas] 14:21:43 And maybe they could learn something from me and it becomes a  [Dulaney, Stephen] 14:21:47 Now, I think that's what he's supposed to be in because those are coming out of teams our teams.  [Dulaney, Stephen] 14:21:55 He introduced himself as Alexander the first episode, DC Specialist Master.  [Dulaney, Stephen] 14:22:02 But yeah, you just, you know, you hear these guys and informally give their background. I was always intrigued.  [Dulaney, Stephen] 14:22:08 But I need to spend some individual one-on-one time. I kind of came late to it because I was a math major in in college and the differentiality differential geometry and and tensors and Relativity.  [Dulaney, Stephen] 14:22:24 And there's parts of this that are like echoes that you know the tensors, the vector spaces, but we had pretty relatively small dimensional vector spaces and curvatures and these are like you know, 1024 dimensions Based on how many and more.  [Dimino, Thomas] 14:22:25 Yeah, which… Mm-hmm.  [Dulaney, Stephen] 14:22:44 But they are single vector spaces and dot products and transformations and likenesses and perpendicularities.  [Dimino, Thomas] 14:22:45 Mm-hmm.  [Dulaney, Stephen] 14:22:51 So it's…  [Dimino, Thomas] 14:22:51 Yeah, and would you say that they're still the LLMs themselves are still non-deterministic?  [Dimino, Thomas] 14:22:58 Is that do you think like a law that Or do you think that that's not always the case, depending on like how the LM is trained and I guess the transformer architecture.  [Dulaney, Stephen] 14:23:09 I'm trying to look for kind of how i mean we we looked for structures that were invariant across transformations and some of the And I think some of the techniques they do are looking for those same things.  [Dulaney, Stephen] 14:23:21 But I think as far as deterministic Yeah, I think they do this thing. It's a little bit different. They don't really know how it works. They just, they tune it.  [Dulaney, Stephen] 14:23:30 Whereas there's other modelers where they kind of want to understand what they're doing before they do it.  [Dulaney, Stephen] 14:23:35 And… So I don't i i'd probably… I would say right now it's say right now looks like it's non-deterministic, but it could be.  [Dulaney, Stephen] 14:23:45 It's just the way they go about it. They're on success and they're not trying to really try to map it out or try to it does feel more like quantum than real relativity.  [Dimino, Thomas] 14:23:47 Yeah, I mean…  [Dulaney, Stephen] 14:24:02 They don't know what's going on, but it works. It gets great results. Whereas Relativity was all about trying to get and predict and reproduce really accurate calculations and that bending light by eclipse.  [Dimino, Thomas] 14:24:02 That's…  [Dulaney, Stephen] 14:24:15 And they knew why it had happened.  [Dimino, Thomas] 14:24:18 No, I mean, for me, um. From the moment I learned about quantum mechanics, even just as a layman like it It was so… It resonated so much with me because I mean, I studied biology when I was undergraduate but  [Dimino, Thomas] 14:24:34 I had a humanities leaning so that had that then became kind of my my path like through adulthood and I've always been a believer in uh some sense of magic. And now I'm kind of up against so many different sciences that just  [Dimino, Thomas] 14:24:52 Kind of explain the nuances of it. And in a way, I'm angry at the sciences because I preferred when uh It was just something kind of… subjective. But now I see like you can you can explain so much especially um so  [Dimino, Thomas] 14:25:08 Non-local phenomenon, like, you know, with quantum mechanics, it's like, oh, of course, of course that's possible like  [Dulaney, Stephen] 14:25:14 I struggled with quantum mechanics because it went against my core. I got kind of taken in by the relativist first. And then so when I got to my quantum classes, I just didn't want to It's like, you can't just do this. You're making stuff up.  [Dulaney, Stephen] 14:25:27 And I finally have given into it, but it really was hard for me.  [Dimino, Thomas] 14:25:33 Mm-hmm. Yeah, I think, and I think that even then ties into just the relativity of consciousness as well it's like it's relative because it's there aren't even necessarily static laws, you know, the laws themselves can can bend because you're you're seeing things move between  [Dimino, Thomas] 14:25:53 Variable states. And that's i mean even the the explanations that I've read about how consciousness even exists you know in a in plasma form like it's it's something that's kind of in between states As well. And like in that space you can  [Dulaney, Stephen] 14:26:09 Yep.  [Dimino, Thomas] 14:26:13 See phenomenon that you call conscious and You could expect consciousness in any sufficiently large enough object that had the same sort of activity occurring, you know, with the right channels the right the right kind of soup of uh of that and a star could be a potential sentient creature. I guess a large enough rock  [Dimino, Thomas] 14:26:39 I mean, virtually anything. And that's very exciting because it just makes you aware that there's kind of enormous untold like caches of data in a sense, like in the environment everywhere. And it's just how do you even engage it you know is it supposed to be done more intuitively you know through meditation  [Dulaney, Stephen] 14:26:39 Yep.  [Dimino, Thomas] 14:27:01 Other things or can you quantify that or turn that into some sort of mechanism it's um I think all those things just naturally start occurring to you come into mind with LLMs because they do feel very much like um  [Dimino, Thomas] 14:27:16 They're in the middle of these states. And it has to always raise questions about how human consciousness works and develops.  [Dimino, Thomas] 14:27:26 And then why, you know, why the LLM is not convincing? What is it missing necessarily that it should have and that that's like a trillion dollar question right now because agents are everywhere  [Dulaney, Stephen] 14:27:38 It is. I don't know. Leonard Susskind, who was a relativist, he's actually really good teachers basically I followed his teachings as far as relativity, and he's the one that probably got me closest to understanding quantum.  [Dulaney, Stephen] 14:27:51 But in his late, late life, like in his last years, he's struggling with quantum mechanics and consciousness And I haven't heard anything he said about large language models, but that would be interesting to see.  [Dulaney, Stephen] 14:28:03 How he fits that into his understanding in his fading days.  [Dimino, Thomas] 14:28:08 My own kind of my own kind of take on the large language model is that if you kind of pull away all the thoughts about the machine learning that led to them.  [Dimino, Thomas] 14:28:19 I don't think they're that different from like a book or any sufficiently large text and It's all just a question of how the agent is trained You know, to interpret that book or what what that what that uh that  [Dulaney, Stephen] 14:28:24 Yeah.  [Dimino, Thomas] 14:28:39 Language set is going to elicit? What is it going to induce the agent to do?  [Dimino, Thomas] 14:28:43 You know, for a human, if you give me a book, I'd probably write a million essays about it.  [Dimino, Thomas] 14:28:50 Use some of the language and conversation. There's a million different ways it could have seeded or imprinted itself.  [Dimino, Thomas] 14:28:55 And I think that's why with all these architectures, to go back to the meeting assist.  [Dimino, Thomas] 14:29:01 Like memory is you know an obvious tool that the model needs But then how do you do the memory? Like I've seen many different ways to do that and and i think Very simply, just being able to store objects  [Dimino, Thomas] 14:29:17 And then import the objects make prompts that refer to the objects or the information inside the objects, that's the best way to do it. And I don't think that's too dissimilar from how humans do it.  [Dimino, Thomas] 14:29:31 Like in a sense, it's just you know there's much more complexity to that.  [Dulaney, Stephen] 14:29:35 Yeah, that's where it gets back into like they're basically making vectors and vector stores is in this big old chunk of numbers.  [Dulaney, Stephen] 14:29:42 But it's weird how the whole fact that it's got language and it's got um you know as language has these different concepts And it could actually translate without being told it needs to translate.  [Dulaney, Stephen] 14:29:54 That's getting at that deeper relationship between things and so at some point i see how it's like.  [Dimino, Thomas] 14:29:54 Mm-hmm.  [Dulaney, Stephen] 14:30:00 It's demystified when you see that it plagiarize everything. And then when I find out little tidbits i could It just picked up chess. And you're like And what else can it do? So that's where I understand it. It seems like it's just  [Dulaney, Stephen] 14:30:15 Computer code that's read a lot of stuff and made these connections. Then there's other parts that are still a mystery to me.  [Dimino, Thomas] 14:30:21 Yeah, and that thread on the chest I believe I saw it.  [Dimino, Thomas] 14:30:26 I think by the time I read it, it had been shared or I don't know, liked a million times, but I recall it was kind of a proof of how the LM was able to play.  [Dulaney, Stephen] 14:30:31 Yeah.  [Dimino, Thomas] 14:30:38 Or make those decisions. From an indeterminate place.  [Dulaney, Stephen] 14:30:44 Exactly. Not like it didn't. They tried to check to make sure it was just not finding old games. He was making was using the concepts in language embedded in language and um That's what I think, what else are we missing? There's probably some other easy prompts.  [Dimino, Thomas] 14:30:48 Right, right.  [Dulaney, Stephen] 14:30:58 Where it can pick up these relationships that are embedded in language and you get, you know, when I talk about the stuff you get for free.  [Dulaney, Stephen] 14:31:04 But you still have to discover what they are and how to prompt for them.  [Dimino, Thomas] 14:31:09 Mm-hmm.  [Dulaney, Stephen] 14:31:13 Now, one question. When you do your prompts, what environment like do you have a window? Because I don't want to just go to chat GBT and type in stuff for JP Morgan.  [Dimino, Thomas] 14:31:14 I forgot what I was going to say, but yes, what was your question?  [Dulaney, Stephen] 14:31:25 But is there an environment that you work in or windows that you actually, how do you do your work?  [Dimino, Thomas] 14:31:30 What I found useful on the work laptop, which was different from how I do my personal, is that I just use Visual Studio Code.  [Dimino, Thomas] 14:31:39 To have a space where I can just see the prompt laid out as a markdown file. And at least then, you know, there's some like coloring of syntax. It just makes it easier to read. And then, of course, having like the  [Dimino, Thomas] 14:31:55 And the line number is useful too. So that… Oh, oh, no. Up until now.  [Dulaney, Stephen] 14:31:58 But I mean, you have an environment that you're running the Once again.  [Dimino, Thomas] 14:32:03 I didn't want to go through the headache of like getting all the necessary permissions in order to just have my own environment, especially since We're not… I mean, that's my first question. Were you able to access the Bitbucket link?  [Dulaney, Stephen] 14:32:21 No, no, I haven't done that. It's like I'm in the same place you are. I don't want to I don't want to do anything wrong, but I want to be able to run experiments And right now I've kind of been on the sideline, but I would run it, you know, how can I help you more? How can I support you more?  [Dimino, Thomas] 14:32:23 Because…  [Dimino, Thomas] 14:32:36 Well, yeah, so to that question what uh What I think would probably be the best  [Dimino, Thomas] 14:32:46 Like compromise, not even compromise, but I think the solution would be If you wanted, you could join at the least these weekly calls that I have with Sandeep and… And they're the ones who are i think Before Patrick left, we're directly responsible for  [Dulaney, Stephen] 14:32:57 I'd love to. Yeah.  [Dimino, Thomas] 14:33:05 Like actually working with the Python, running it. In their like in their test environment And then getting some outputs. So they, uh, they seem like very responsive thoughtful people so we if we told them like could you guys give us outputs for this like  [Dimino, Thomas] 14:33:27 Every other day. They could probably do that on our behalf. So we'd get around us having to go through all the hoops of being able to finally Yeah. Like the steps that it would take for me to be able to have a terminal that I could use that would be like connected to all the different services.  [Dulaney, Stephen] 14:33:32 Right, right, right. So comma developer, and then all the responsibility.  [Dulaney, Stephen] 14:33:43 Yeah.  [Dimino, Thomas] 14:33:44 And then, you know, we're not even calling like OpenAI we're calling I forget some other provider that is calling to OpenAI. So it's like There's lots of different credentials and permissions. And I was just like.  [Dulaney, Stephen] 14:33:53 Yeah.  [Dimino, Thomas] 14:33:58 This is not above my pay grade it's just above my pay grade it's going to take me away from the work I'm supposed to be doing.  [Dulaney, Stephen] 14:34:04 I have a kind of an exclusion where I have like this. I've been given permission to do AI research.  [Dulaney, Stephen] 14:34:10 And so I have access to a lot of those models through that kind of grant is like tinkerer, but I try not to use that with on the client work.  [Dulaney, Stephen] 14:34:19 As much because so with client work, I got to stick to the SOW and, you know, make sure everything's clear.  [Dimino, Thomas] 14:34:24 So with your grant, it's it's um you basically have an account with one of these LM providers that offers like a bunch of models.  [Dulaney, Stephen] 14:34:32 Deloitte has the open ai model and then um with the um What's the one that I've used?  [Dimino, Thomas] 14:34:39 Is what what was unfortunate for me was that I used to work closely with a startup that Also, ultimately went to an LLM provider, but they at least were the the middlemen And they built out kind of their own api  [Dimino, Thomas] 14:34:58 And it made it very easy to build agents and characters and then just select the model I wanted.  [Dimino, Thomas] 14:35:06 Write the prompts, write the actual programming. But took away lots of the headache You know, of dealing with these API calls and lots of the formatting of outputs and various things.  [Dulaney, Stephen] 14:35:08 Yeah.  [Dulaney, Stephen] 14:35:18 So Deloitte has its own account with open API. So that's a Deloitte logon. And then the other one I use a lot is deep learning ai And… And it has a lot of Python examples.  [Dimino, Thomas] 14:35:28 Oh, yeah, I've heard of that.  [Dulaney, Stephen] 14:35:32 And then in that Python dev environment, I run the scripts. And so connect to the LAMA model.  [Dulaney, Stephen] 14:35:39 So that's kind of getting on the gray zone because I connect a lot of the… the meta models.  [Dimino, Thomas] 14:35:39 I mean, if…  [Dulaney, Stephen] 14:35:46 Through the landline.  [Dimino, Thomas] 14:35:47 Yeah, if that's the case, then… I mean, if you really wanted beyond like us being able to talk to Sandeep and Nagula you could you could probably just copy like most of the Python that they have, like in the code base and at least like the essential parts  [Dimino, Thomas] 14:36:05 And then, you know, wherever it's trying to import something, you could just substitute you know with your own And you could probably get that running to at least validate like the quality of the prompt.  [Dimino, Thomas] 14:36:15 You know, so you could iterate on it more quickly I used to have all this set up.  [Dimino, Thomas] 14:36:22 On my personal laptop, but I haven't been able to do any coding now Probably six months, like since I've been able to do it like for hours on end.  [Dimino, Thomas] 14:36:32 I want to get back into it. There's so many different open source projects now but It's been a gradual thing.  [Dulaney, Stephen] 14:36:36 Okay.  [Dimino, Thomas] 14:36:42 Because of personal life and my partner going through some treatments. So it's been hard to you know have um the free time.  [Dimino, Thomas] 14:36:50 There's not as much carefree time. But…  [Dulaney, Stephen] 14:36:51 It's… Yeah, yeah.  [Dulaney, Stephen] 14:36:55 Well, let's try to do regular meetings. And if there are meetings, that sounds great. And then just be able to reach out. I know I have capacity if there's things that you want to either just talk about or hand off, please feel free.  [Dimino, Thomas] 14:36:58 Sure.  [Dimino, Thomas] 14:37:07 Yeah, I think that's the most constructive and uh healthiest way to go about my time with Jimmy Morgan.  [Dimino, Thomas] 14:37:16 So as I… Same.  [Dulaney, Stephen] 14:37:16 Yeah, mine too. I'd love to take advantage of learning as much as I can in this whole AI thing. And it's kind of hard to get totally ramped involved with. And I did. I've been playing with this using those those  [Dulaney, Stephen] 14:37:27 Transcripts and running AI scripts against them And that's kind of how, you know, I load up three or four transcripts and then ask questions. And there's a lot you can do there, but I kind of exhausted that. I want to kind of figure out, you know, what's next.  [Dimino, Thomas] 14:37:42 Yeah, there was talk I'm trying to remember where it fit in.  [Dimino, Thomas] 14:37:49 I think this conversation, and I'll just say this quickly because then I have to go to a meeting with Rigved and anna Which is for editing a script.  [Dimino, Thomas] 14:37:59 For a promotional video for meeting assist but Someone said that they want meeting assist to have a feature, kind of a final step.  [Dimino, Thomas] 14:38:09 Where… And LM is able to make a characterization of the client.  [Dimino, Thomas] 14:38:15 Like, oh, there's six types of clients this could be like six different personas, which persona does this client fall into?  [Dulaney, Stephen] 14:38:21 Yeah.  [Dimino, Thomas] 14:38:26 I don't think they really have the persona research even done. So that is something that came up.  [Dimino, Thomas] 14:38:32 Which they would like to which they would like have in some form, you know, even if it's just kind of like the scaffolding of it.  [Dimino, Thomas] 14:38:40 To even just suggest what those six personas could be. I mean, if…  [Dulaney, Stephen] 14:38:40 Yep. Well, there's three that are pretty much universals. There's like conservative savers there's relationship focused people and active traders.  [Dulaney, Stephen] 14:38:50 And those are almost are universal in like computer buyers. I mean, those are just shoppers in general. There's there's um there's  [Dimino, Thomas] 14:38:50 Mm-hmm.  [Dimino, Thomas] 14:38:56 And those are people who would still have wealth advisors like Bye.  [Dulaney, Stephen] 14:39:00 Exactly. And you know, like advisors do this in their head. They know if this is a conservative saver, they're going to want to have like big safe balances. Their cash management is really too large Whereas they're active traders, they're going to want to have a lot of like  [Dulaney, Stephen] 14:39:15 Control day trading and then the relationships are the ones that just like they really value to talk to a lot and just handle a lot of stuff off to you.  [Dulaney, Stephen] 14:39:22 And those are just three, but they're pretty universal. When you get to six, then you start to get… But even then, if you had just an icon You know, and maybe people are a score there's some conservative some relationship  [Dulaney, Stephen] 14:39:35 But that's a good place on that idea to start. Without having to do a whole lot because that's pretty universal.  [Dimino, Thomas] 14:39:40 Yeah. And they… they've expressed, like Alex and another person on the call they expressed that say you don't have any qualms about trying to… I just label these clients you know just like create some more metadata about each of them.  [Dimino, Thomas] 14:39:59 And use the LLM to kind of make the judgment or fit them or fit them into a bucket so there you could…  [Dulaney, Stephen] 14:40:05 And the other one was readiness to transfer money. And we're going to score there is um And there could be.  [Dimino, Thomas] 14:40:10 Right, right. And that's kind of like the Buland, right? It's like a yes or no, like.  [Dulaney, Stephen] 14:40:14 There's like a state model that you could do like the near shopper you know we do that with when people start to focus on the same item in their basket over and over.  [Dimino, Thomas] 14:40:15 Like a…  [Dulaney, Stephen] 14:40:21 They're about ready to purchase. If they're early stage, they're switching between categories.  [Dulaney, Stephen] 14:40:26 And so that's the the state model for like readiness to to activate. Those two, I think we talked about in that last big meeting.  [Dulaney, Stephen] 14:40:37 When I had those on my little next step ideas charts.  [Dulaney, Stephen] 14:40:41 But that's a good feedback.  [Dimino, Thomas] 14:40:43 Yeah, and with some of those, they could probably use just like rules-based logic but more subjective things.  [Dulaney, Stephen] 14:40:50 I almost think one, I almost think that the motto that's like the chess game. I almost think it could actually intuit that for free without having to like set up a state model.  [Dulaney, Stephen] 14:40:59 The old school that if it had access to the, you know, it might be able to intuit that More than we think. And then as far as the Exactly. Yeah.  [Dimino, Thomas] 14:41:00 Yeah. Yes.  [Dimino, Thomas] 14:41:06 Yeah, it's all just a question of cost at the end, right?  [Dulaney, Stephen] 14:41:11 So that's why you could do a state model or you could just make a clever prompt and see how far you get.  [Dimino, Thomas] 14:41:18 Yes, I would talk to you more, but I have to go on this call with Rick Ved now. But yeah.  [Dulaney, Stephen] 14:41:20 I did. That's good.  ",
      "speaker": "",
      "start_time": null,
      "end_time": null,
      "metadata": {
        "emotion": {
          "primary": {
            "label": "neutral",
            "score": 0.0
          },
          "secondary": [],
          "confidence": 0.0
        },
        "emotion_intensity": 0,
        "theme": [],
        "insightTag": [],
        "sentiment_score": 0,
        "sentiment": "neutral",
        "themes": [],
        "relatedFeature": null
      }
    }
  ],
  "metadata": {
    "researcher": {
      "name": "Stephen Dulaney",
      "email": "sdulaney@deloitte.com",
      "role": "UX Researcher"
    },
    "interviewee": {
      "name": "Thomas Dimino",
      "age": "35-44",
      "gender": "male",
      "location": "NY, NY",
      "occupation": "Researcher",
      "industry": "Financial Services",
      "experience": "12",
      "education": "masters"
    },
    "technology": {
      "deviceType": "laptop",
      "operatingSystem": "macos",
      "browser": "chrome"
    },
    "interview_details": {},
    "consent": true
  }
}